Перем КаталогОбмена;

Функция УстановитьКартинку(ИмяФайла)
	
	КаталогКартинок = КаталогОбмена + "Images\";
	Файл = Новый Файл(ИмяФайла);
	
	НовоеМестоположениеКартинки = КаталогКартинок + БПАГ.ПревратитьСтрокуВТранслит(Файл.Имя);
	НовыйФайлКартинки = Новый Файл(НовоеМестоположениеКартинки);
	
	Если ВРег(Файл.ПолноеИмя) = ВРег(НовоеМестоположениеКартинки) Тогда //картинка уже лежит на нужном месте
		НоваяКартинка = Объект.Картинки.Добавить();
		НоваяКартинка.Имя = НовыйФайлКартинки.Имя;
		Возврат Истина;
	ИначеЕсли НовыйФайлКартинки.Существует() Тогда
		
	КонецЕсли;
	
	Попытка
		КопироватьФайл(Файл.ПолноеИмя, НовоеМестоположениеКартинки);
		
		НоваяКартинка = Объект.Картинки.Добавить();
		НоваяКартинка.Имя = НовыйФайлКартинки.Имя;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

Процедура ОбновитьКартинки()
	
   КаталогКартинок = КаталогОбмена+"Images\";
	
	ШиринаКартинки = 128;
	ВысотаКартинки = 90;
	Промежуток = 16;
	
	// Удаляем ненужные реквизиты
	МассивНаУдаление = Новый Массив;
	МассивЭлементовНаУдаление = Новый Массив;
	Для Каждого Элемент Из Элементы Цикл
		Если Лев(Элемент.Имя,8) = "Картинка" и СокрЛП(Элемент.Вид) = "Поле картинки" Тогда
			МассивНаУдаление.Добавить(Элемент.Имя);
			МассивЭлементовНаУдаление.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из МассивЭлементовНаУдаление Цикл
		Элементы.Удалить(ТекЭлемент);
	КонецЦикла;
	
	ИзменитьРеквизиты(,МассивНаУдаление);

	
	Для Каждого тмпКартинка Из Объект.Картинки Цикл	
				
		СсылкаНаКартинку = ПоместитьКартинкуВоВременноеХранилище(тмпКартинка.Имя);
				// Отобразить на форме
		//ЭтаФорма.Картинка = СсылкаНаКартинку;
		НаименованиеНовойкартинки = "Картинка"+СокрЛП(тмпКартинка.Номерстроки);
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(НаименованиеНовойкартинки, Новый ОписаниеТипов("Строка"), ));
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		НоваяКартинка = Элементы.Добавить(НаименованиеНовойкартинки, Тип("ПолеФормы"), Элементы.Коллекция);
		НоваяКартинка.Вид = ВидПоляФормы.ПолеКартинки;
		
		тмпЗаголовок = "(" + СокрЛП(тмпКартинка.НомерСтроки) + ") " + тмпКартинка.Имя;
		НоваяКартинка.Заголовок = ?(СтрДлина(тмпЗаголовок) > 18, Лев(тмпЗаголовок, 17) + "…", тмпЗаголовок);
		
		НоваяКартинка.ПутьКДанным = НаименованиеНовойкартинки;
		НоваяКартинка.РастягиватьПоВертикали = Ложь;
		НоваяКартинка.РастягиватьПоГоризонтали = Ложь;
		Новаякартинка.Ширина = 15;
		НоваяКартинка.Высота = 5;
		НоваяКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
		НоваяКартинка.Гиперссылка = Истина;
		НоваяКартинка.УстановитьДействие("Нажатие", "ПолеКартинкиНажатие");
		ЭтаФорма[НаименованиеНовойкартинки] = СсылкаНаКартинку;
        
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВИнтернете(Команда)
	Форма = ПолучитьФорму("Обработка.БПАГПоискКартинокВИнтернете.Форма.УПФорма");
	Форма.Объект.ПараметрыПоиска = Объект.Наименование;
	Форма.Объект.ИдентификаторФормы = УникальныйИдентификатор;
	Форма.ОткрытьМодально();	
	Если Форма.Объект.КартинкиВыбраны Тогда
		Для Каждого Строка Из Форма.Объект.ВыбранныеКартинки Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Строка.СсылкаНаКартинку);
		СохранитьКартинкуИзИнтернета(ДвоичныеДанные, Строка.ИмяКартинки);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура СохранитьКартинкуИзИнтернета(ДвоичныеДанные, ИмяФайлаКартинки)
	КаталогКартинок = КаталогОбмена + "Images\";
	
	Счетчик = 0;
	ИмяНовогоФайла = КаталогКартинок + ИмяФайлаКартинки;
	ФлагПрисутствияФайла = Истина;
	Пока ФлагПрисутствияФайла Цикл
		Если ФайлСуществует(ИмяНовогоФайла) Тогда
			Счетчик = Счетчик + 1;
			ИмяНовогоФайла = КаталогКартинок + СокрЛП(Счетчик) + ИмяФайлаКартинки;
		Иначе
			ФлагПрисутствияФайла = Ложь;
		КонецЕсли;
	КонецЦикла;	
	
	ДвоичныеДанные.Записать(ИмяНовогоФайла);
	УстановитьКартинку(ИмяНовогоФайла);
	ОбновитьКартинки();
КонецПроцедуры

Функция ФайлСуществует(ИмяФайла)
	ФС = Новый Файл(ИмяФайла);
	Если ФС.Существует() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура УдалитьКартинку(Команда)
	// Вставить содержимое обработчика.
	ИмяТекЭлемент = ЭтаФорма.ТекущийЭлемент.Имя;
	
	Если Лев(ИмяТекЭлемент,8) = "Картинка"  Тогда
		// ОпределитьНомерСтроки
		УдалитьКартинкуИЭлемент(ИмяТекЭлемент);
	КонецЕсли;	
КонецПроцедуры

Процедура УдалитьКартинкуИЭлемент(ИмяЭлемента)	
	НомерКартинки = Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента)-8));
	Объект.Картинки.Удалить(НомерКартинки-1);
	ОбновитьКартинки();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	// Вставить содержимое обработчика.
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	//ДиалогОткрытияФайла.ПолноеИмяФайла = КаталогКартинок;
	ДиалогОткрытияФайла.Фильтр = 
		"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
		+ "Веб-страницы (*.htm;*.html)|*.htm;*.html|"
		+ "Все файлы (*.*)|*.*|"
		+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
		+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
		+ "Формат TIFF (*.tif)|*.tif|"
		+ "Формат GIF (*.gif)|*.gif|"
		+ "Формат PNG (*.png)|*.png|"
		+ "Формат icon (*.ico)|*.ico|"
		+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; // картинки
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
			Для Каждого ИмяФайла Из ДиалогОткрытияФайла.ВыбранныеФайлы Цикл	
				// Проверить сущестрование
				ИмяСуществующегоФайла = ФайлСуществуетВКаталогеОбмена(ИмяФайла);
				Если ИмяСуществующегоФайла = 0 Тогда
					УстановитьКартинку(ИмяФайла);
					ОбновитьКартинки();
				Иначе
					КодВозврата = Вопрос("В каталоге картинок уже существует файл с именем " + ИмяСуществующегоФайла + "! Заменить?", РежимДиалогаВопрос.ДаНет);
					Если КодВозврата = КодВозвратаДиалога.Да Тогда
						 УстановитьКартинку(ИмяФайла);
						 ОбновитьКартинки();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;				
		Иначе
			Возврат;
		КонецЕсли;
	КонецПроцедуры

Функция ФайлСуществуетВКаталогеОбмена(ИмяФайла)
	КаталогКартинок = КаталогОбмена+"Images\";
	
	Файл = Новый Файл(ИмяФайла);
	НовоеМестоположениеКартинки = КаталогКартинок + БПАГ.ПревратитьСтрокуВТранслит(Файл.Имя);
	НовыйФайлКартинки = Новый Файл(НовоеМестоположениеКартинки);
	Если НовыйФайлКартинки.Существует() Тогда
		Возврат Файл.Имя;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Если Объект.ЭтоГруппа Тогда
		ЭтаФорма.Элементы.ГруппаКартинок.Видимость = Ложь;
	Иначе
		ОбновитьКартинки();
	КонецЕсли;
КонецПроцедуры

Функция ПоместитьКартинкуВоВременноеХранилище(ИмяКартинки)
	КаталогКартинок= КаталогОбмена+"Images\";
	
	НайденныеФайлы = НайтиФайлы(КаталогКартинок, ИмяКартинки, Ложь);
	Если НайденныеФайлы.Количество()>0 тогда
		СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Новый Картинка(НайденныеФайлы[0].ПолноеИмя, Истина), УникальныйИдентификатор);
		Возврат СсылкаНаКартинку;
	Иначе
		Сообщить("Файл "+ИмяКартинки+" не найден.");
		Возврат 0;
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ПолеКартинкиНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

КаталогОбмена = БПАГ.БПАГПолучитьНастройку("1СКаталогОбмена");



