#Область ДополнительныеПроцедурыИФункции

&НаКлиенте
Процедура СообщитьОбОшибке(текстСообщения, реквизитФормы)
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = текстСообщения;
	Сообщение.Поле = реквизитФормы;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКоманд

&НаКлиенте
Процедура ВыполнитьЗаполнение(Команда)
	
	Если ГруппаПродукта.Пустая() Тогда
		СообщитьОбОшибке(НСтр("ru = 'Необходимо указать Группу продукта'"), "ГруппаПродукта");
		Возврат;
	КонецЕсли;
	
	структураПараметров = Новый Структура;
	
	структураПараметров.Вставить("ГруппаПродукта", ГруппаПродукта);
	структураПараметров.Вставить("КатегорийнаяГруппа", КатегорийнаяГруппа);
	
	структураПараметров.Вставить("СписокПодразделений", СписокПодразделений);
	структураПараметров.Вставить("СписокНоменклатуры", СписокНоменклатуры);
	
	структураПараметров.Вставить("ПериодЗаполнения", ПериодЗаполнения);
	
	Оповестить("ВыполнитьЗаполнениеИсходнойТаблицыСтандартаПрисутствия", структураПараметров);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти