
&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(Список, "Подразделение", ОтборПодразделение, ЗначениеЗаполнено(ОтборПодразделение));

КонецПроцедуры


&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(Список, "Автор", ОтборАвтор, ЗначениеЗаполнено(ОтборАвтор));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборПодразделение = Настройки.Получить("ОтборПодразделение");
	ОтборНоменклатурнаяГруппа = Настройки.Получить("ОтборНоменклатурнаяГруппа");
	ОтборАвтор = Настройки.Получить("ОтборАвтор");
	
	УправлениеНебольшойФирмойСервер.ИзменитьЭлементОтбораСписка(Список, "Подразделение", ОтборПодразделение, ЗначениеЗаполнено(ОтборПодразделение));
	УправлениеНебольшойФирмойСервер.ИзменитьЭлементОтбораСписка(Список, "НоменклатурнаяГруппа", ОтборНоменклатурнаяГруппа, ЗначениеЗаполнено(ОтборНоменклатурнаяГруппа));
	УправлениеНебольшойФирмойСервер.ИзменитьЭлементОтбораСписка(Список, "Автор", ОтборАвтор, ЗначениеЗаполнено(ОтборАвтор));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатурнаяГруппаПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(Список, "НоменклатурнаяГруппа", ОтборНоменклатурнаяГруппа, ЗначениеЗаполнено(ОтборНоменклатурнаяГруппа));
	
КонецПроцедуры
