
#Область ОбработчикиСобытий

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, объектКопирования);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(данныеЗаполнения, стандартнаяОбработка)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеНовогоДокумента(ЭтотОбъект, данныеЗаполнения);
	
	Если Подразделение.Пустая() Тогда
		Подразделение = ПользователиСервер.ПолучитьЗначениеНастройки("ОсновноеПодразделение");
	КонецЕсли; 
	
	Если Ответственный.Пустая() Тогда
		Ответственный = ПользователиСервер.ПолучитьЗначениеНастройки("ОсновнойОтветственный");
	КонецЕсли;
	
	Если ДатаНачала = Дата('00010101') Тогда
		ДатаНачала = НачалоМесяца(Дата);
	КонецЕсли;
	
	Если ДатаОкончания = Дата('00010101') Тогда
		ДатаОкончания = КонецМесяца(Дата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
	
	// проверка даты окончания акции
	Если КонецМесяца(ДатаНачала) <> КонецДня(ДатаОкончания) Тогда
		
		текстСообщения = НСтр("ru = 'Окончание периода действия должно быть концом месяца.'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "ПериодДействия");

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти