#Область ОбработчикиСобытий
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭлементОтбора = СписокРегистрации.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Узел");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.ПравоеЗначение   = Объект.Ссылка;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		Элементы.ГруппаРегистрацияИзменений.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(имяСобытия, параметр, источник)
	
	Если имяСобытия = "УдалениеРегистрацииИзменений" Тогда
		Элементы.СписокРегистрации.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 