&НаСервере
Процедура КомандаУдалитьРегистрациюНаСервере(списокУзлов)
	
	Для индекс = 1 По списокУзлов.Количество() Цикл
		
		узел = списокУзлов[индекс-1];
		
		Если узел = ПланыОбмена.ОбменСМуравьинойЛогистикой.ЭтотУзел() Тогда
			Продолжить;
		КонецЕсли;
		
		ПланыОбмена.УдалитьРегистрациюИзменений(узел.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(параметрКоманды, параметрыВыполненияКоманды)
	
	КомандаУдалитьРегистрациюНаСервере(параметрКоманды);
	
	ОповеститьОбИзменении(Тип("ПланОбменаСсылка.ОбменСМуравьинойЛогистикой"));
	Оповестить("УдалениеРегистрацииИзменений");
	
КонецПроцедуры
