
&НаСервере
Процедура КомандаВыполнитьНаСервере()
	
	отказ = Ложь;
	
	Если Район.Пустая() Тогда
		текстСообщения = НСтр("ru = 'Необходимо указать район!'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект,"Район");
	КонецЕсли;
	
	Если Менеджер.Пустая() Тогда
		текстСообщения = НСтр("ru = 'Необходимо указать менеджера!'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект,"Менеджер");
	КонецЕсли;
	
	Если ГруппаПродукта.Пустая() Тогда
		текстСообщения = НСтр("ru = 'Необходимо указать группу продукта!'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект,"ГруппаПродукта");
	КонецЕсли;
	
	Если ОсновнаяОрганизация.Пустая() Тогда
		текстСообщения = НСтр("ru = 'Необходимо указать организацию!'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект,"ОсновнаяОрганизация");
	КонецЕсли;
	
	Если отказ Тогда
		Возврат;
	КонецЕсли;
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновнойРайон.Ссылка,
	|	КонтрагентыМенеджеры.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)
	|			ТОГДА ОсновнойРайон.ТипЦен
	|		ИНАЧЕ &ТипЦен
	|	КОНЕЦ КАК ТипЦен
	|ИЗ
	|	Справочник.Контрагенты.Менеджеры КАК ОсновнойРайон
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.Менеджеры КАК КонтрагентыМенеджеры
	|		ПО ОсновнойРайон.Ссылка = КонтрагентыМенеджеры.Ссылка
	|			И (КонтрагентыМенеджеры.ГруппаПродукта = &ГруппаПродукта)
	|ГДЕ
	|	ОсновнойРайон.Менеджер = &Район
	|	И ОсновнойРайон.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("Район", Район);
	запрос.УстановитьПараметр("ГруппаПродукта", ГруппаПродукта);
	запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	результатЗапроса = запрос.Выполнить();
	
	данныеЗаполнения = Новый Структура("Менеджер, ГруппаПродукта, ОсновнаяОрганизация, ТипЦен", Менеджер, ГруппаПродукта, ОсновнаяОрганизация, ТипЦен);
	
	НачатьТранзакцию();
	
	выборка = результатЗапроса.Выбрать();
	Пока выборка.Следующий() Цикл
		
		данныеЗаполнения.ТипЦен = выборка.ТипЦен;
		
		контрагентОбъект = выборка.Ссылка.ПолучитьОбъект();
		
		Если Не выборка.НомерСтроки = Null Тогда
			строкаМенеджеры = контрагентОбъект.Менеджеры[выборка.НомерСтроки-1];
		Иначе
			строкаМенеджеры = контрагентОбъект.Менеджеры.Добавить();
		КонецЕсли;
		
		
		
		Если Не строкаМенеджеры.ГруппаПродукта = данныеЗаполнения.ГруппаПродукта Или
			Не строкаМенеджеры.ОсновнаяОрганизация = данныеЗаполнения.ОсновнаяОрганизация Или
			Не строкаМенеджеры.ТипЦен = данныеЗаполнения.ТипЦен Или
			Не строкаМенеджеры.Менеджер = данныеЗаполнения.Менеджер Тогда
			
			
			ЗаполнитьЗначенияСвойств(строкаМенеджеры, данныеЗаполнения);
			
			контрагентОбъект.Записать();
			
			сообщить(контрагентОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(команда)
	
	началоОбработки = ТекущаяДата();
	
	КомандаВыполнитьНаСервере();
	
	сообщить((ТекущаяДата()-началоОбработки)/60);
	
КонецПроцедуры
