
//////&НаСервере
//////Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//////	
//////	СформироватьУсловноеОформление();
//////	
//////	Список.Отбор.Элементы.Очистить();
//////	
//////	Если Параметры.Свойство("Агент") Тогда
//////		Если ЗначениеЗаполнено(Параметры.Агент) Тогда	
//////			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "Агент", ВидСравненияКомпоновкиДанных.Равно, Параметры.Агент, , Истина);
//////		КонецЕсли;	
//////	КонецЕсли;
//////	
//////	Если Параметры.Свойство("День") Тогда
//////		Если ЗначениеЗаполнено(Параметры.День) Тогда					
//////			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "Период", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, НачалоДня(Параметры.День), , Истина);
//////			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "Период", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, КонецДня(Параметры.День), , Истина);	 
//////		КонецЕсли;	
//////	КонецЕсли;
//////	
//////	Элементы.Список.Обновить();
//////	
//////КонецПроцедуры

//////&НаСервере
//////Функция ПолучитьИмяДокумента(Док)
//////	
//////	ИмяДок = Док.Метаданные().Имя;
//////	
//////	Возврат ИмяДок;
//////	
//////КонецФункции

//////&НаКлиенте
//////Процедура ОткрытьДокумент(Команда)
//////	
//////	ТекДанные = Элементы.Список.ТекущиеДанные;
//////	
//////	Если ТекДанные = Неопределено Тогда
//////		Возврат;
//////	КонецЕсли;
//////	
//////	ТекДок = ТекДанные.Документ;
//////	
//////	Если ЗначениеЗаполнено(ТекДок) Тогда		
//////		ИмяДок = ПолучитьИмяДокумента(ТекДок);
//////		Форма = ПолучитьФорму("Документ." + ИмяДок + ".Форма.ФормаДокумента", Новый Структура("Ключ", ТекДок));
//////		Форма.Открыть();		
//////	КонецЕсли;
//////	
//////КонецПроцедуры

//////&НаСервере
//////Функция ПолучитьСписокЦветов()
//////	
//////	Запрос = Новый Запрос(
//////	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//////	|	апКатегорииДокументов.Ссылка КАК Категория,
//////	|	апКатегорииДокументов.ЦветТекста
//////	|ИЗ
//////	|	Справочник.апКатегорииДокументов КАК апКатегорииДокументов
//////	|ГДЕ
//////	|	апКатегорииДокументов.ЦветТекста <> """"");
//////	
//////	Выборка = Запрос.Выполнить().Выбрать();
//////	
//////	СписокЦветов = Новый СписокЗначений;
//////	
//////	Пока Выборка.Следующий() Цикл
//////		
//////		НужныйЦвет = Выборка.Категория.Цвет.Получить();
//////			
//////		Если НужныйЦвет.Вид <> ВидЦвета.Абсолютный Тогда
//////			НужныйЦвет = апСервер.ПреобразоватьЦветВАбсолютный(НужныйЦвет);
//////		КонецЕсли;	
//////		
//////		Красный = НужныйЦвет.Красный;
//////		Зеленый = НужныйЦвет.Зеленый;
//////		Синий   = НужныйЦвет.Синий;
//////		
//////		Структура = Новый Структура("Цвет, Категория", Новый Цвет(Красный,Зеленый,Синий), Выборка.Категория);
//////		
//////		СписокЦветов.Добавить(Структура); 
//////		
//////	КонецЦикла;
//////	
//////	Возврат СписокЦветов;
//////	
//////КонецФункции

//////&НаСервере
//////Процедура СформироватьУсловноеОформление()
//////	
//////	ЭлементыОформления = Список.УсловноеОформление.Элементы;
//////	
//////	Если ЭлементыОформления.Количество() > 0 Тогда
//////		Для Каждого Элемент Из ЭлементыОформления Цикл
//////			Список.УсловноеОформление.Элементы.Удалить(Элемент);
//////		КонецЦикла;
//////	КонецЕсли;
//////	
//////	СписокЦветов = ПолучитьСписокЦветов();
//////	
//////	Для Каждого ЭлементСписка Из СписокЦветов Цикл	
//////		
//////		Стр = ЭлементСписка.Значение;
//////		
//////		ЭлементУсловногоОформления = ЭлементыОформления.Добавить();
//////		
//////		ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("TextColor");
//////		ЭлементЦветаОформления.Значение 	 = Стр.Цвет;   
//////		ЭлементЦветаОформления.Использование = Истина;
//////		
//////		ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//////		ЭлементОтбораДанных.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Категория");
//////		ЭлементОтбораДанных.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//////		ЭлементОтбораДанных.Использование  = Истина;
//////		ЭлементОтбораДанных.ПравоеЗначение = Стр.Категория;
//////		
//////	КонецЦикла; 
//////	
//////КонецПроцедуры

//////&НаКлиенте
//////Процедура СписокПриИзменении(Элемент)
//////	
//////	СформироватьУсловноеОформление();

//////КонецПроцедуры

//////&НаКлиенте
//////Процедура Фотографии(Команда)
//////	
//////	ТекДанные = Элементы.Список.ТекущиеДанные;
//////	
//////	Если ТекДанные = Неопределено Тогда
//////		Возврат;
//////	КонецЕсли;
//////	
//////	ПараметрыФормы = Новый Структура("Документ", ТекДанные.Документ);
//////	ОткрытьФорму("Справочник.апФотографииДокументов.ФормаСписка", ПараметрыФормы, ЭтаФорма);
//////	
//////КонецПроцедуры

//////&НаКлиенте
//////Процедура ПриОткрытии(Отказ)
//////	Элементы.Список.Обновить();
//////КонецПроцедуры



