
#Область КомандыФормы

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если КомандаЗаполнитьНаСервере() Тогда
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НоменклатураСкидкиНаВес"));
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции


&НаСервере
Функция КомандаЗаполнитьНаСервере()
	
	результат = Ложь;
	
	НачатьТранзакцию();
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыУчетаПоПодразделениямСрезПоследних.СтруктурнаяЕдиница КАК Подразделение,
	|	Номенклатура.Ссылка КАК НоменклатурнаяГруппа,
	|	Номенклатура.ПроцентСкидкиНаВес
	|ПОМЕСТИТЬ ВТ_УстановленныеСкидки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура,
	|	РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних КАК ПараметрыУчетаПоПодразделениямСрезПоследних
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ИСТИНА
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И ПараметрыУчетаПоПодразделениямСрезПоследних.ЕстьСкидкаНаВес = ИСТИНА
	|	И Номенклатура.ПроцентСкидкиНаВес <> 0
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Справочник.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатурнаяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период,
	|	ВТ_УстановленныеСкидки.Подразделение,
	|	ВТ_УстановленныеСкидки.НоменклатурнаяГруппа КАК Номенклатура,
	|	ВТ_УстановленныеСкидки.ПроцентСкидкиНаВес КАК ПроцентСкидки,
	|	НоменклатураСкидкиНаВесСрезПоследних.ПроцентСкидки КАК ПроцентСкидкиРегистр
	|ИЗ
	|	ВТ_УстановленныеСкидки КАК ВТ_УстановленныеСкидки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСкидкиНаВес.СрезПоследних КАК НоменклатураСкидкиНаВесСрезПоследних
	|		ПО ВТ_УстановленныеСкидки.Подразделение = НоменклатураСкидкиНаВесСрезПоследних.Подразделение
	|			И (НоменклатураСкидкиНаВесСрезПоследних.СегментПартнеров = ЗНАЧЕНИЕ(справочник.СегментыПартнеров.ПустаяСсылка))
	|			И ВТ_УстановленныеСкидки.НоменклатурнаяГруппа = НоменклатураСкидкиНаВесСрезПоследних.Номенклатура
	|ГДЕ
	|	НоменклатураСкидкиНаВесСрезПоследних.ПроцентСкидки ЕСТЬ NULL ";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	
	результатЗапроса = запрос.Выполнить();
	
	результат = Не результатЗапроса.Пустой();
	
	выборка = результатЗапроса.Выбрать();
	Пока выборка.Следующий() Цикл
		
		менеджерЗаписи = РегистрыСведений.НоменклатураСкидкиНаВес.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(менеджерЗаписи, выборка);
		
		менеджерЗаписи.Записать(Истина);
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат (результат);
	
КонецФункции

#КонецОбласти