
&НаКлиенте
Процедура ВидыАнкетПриАктивизацииСтроки(Элемент)
	ОбновитьВопросы(Элемент.ТекущаяСтрока);
КонецПроцедуры

Процедура ОбновитьВопросы(Владелец)
	
	Для Каждого ЭлементОтбора Из ВопросыАнкет.Отбор.Элементы Цикл
    	Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец") И (ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно) Тогда
			ВопросыАнкет.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
    КонецЦикла;
    ЭлементОтбора = ВопросыАнкет.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.ПравоеЗначение = Владелец; 
    ЭлементОтбора.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВопросы(Неопределено);
	УстановитьЦветВопроса();
	УстановитьЦветОтвета();
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветВопроса()
	
	УО = ВопросыАнкет.УсловноеОформление.Элементы;
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000000000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Черный);
	
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255255255";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Белый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255000000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);

	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000255000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЗеленоЖелтый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000000255";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Синий);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255255000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255000255";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НасыщенноРозовый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000255255";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Бирюзовый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "083106194";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СинеСерый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "218165032";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Золотистый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "178034034";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Малиновый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "218112214";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ТеплоРозовый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "050205050";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛимонноЗеленый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000128000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ТемноЗеленый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "065105225";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.КоролевскиГолубой);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "218165032";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ХакиТемный);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255099071";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "112128144";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ГрифельноСерый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "189183107";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Древесный);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветВопросаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветВопроса");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "173255047";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЗеленаяЛужайка);
	
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьЦветОтвета()
	
	УО = ВопросыАнкет.УсловноеОформление.Элементы;
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000000000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Черный);
	
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255255255";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Белый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255000000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);

	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000255000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЗеленоЖелтый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000000255";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Синий);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255255000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255000255";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НасыщенноРозовый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000255255";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Бирюзовый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "083106194";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СинеСерый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "218165032";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Золотистый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "178034034";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Малиновый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "218112214";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ТеплоРозовый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "050205050";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛимонноЗеленый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "000128000";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ТемноЗеленый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "065105225";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.КоролевскиГолубой);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "218165032";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ХакиТемный);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "255099071";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "112128144";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ГрифельноСерый);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "189183107";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Древесный);
	
	ЭлементУО = УО.Добавить();
	//Раскрашиваем только поле "ЦветВопросаПредставление"
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветОтветаПредставление");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦветОтвета");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение = "173255047";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЗеленаяЛужайка);
	
	
КонецПроцедуры	


&НаСервере
Процедура ЗаписатьЦветВопроса(Цвет)
	
	Объ = Элементы.ВопросыАнкет.ТекущаяСтрока.Ссылка.ПолучитьОбъект();
	Объ.ЦветВопроса = Цвет;
	Объ.Записать();
	
	УстановитьЦветВопроса();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦветОтвета(Цвет)
	
	Объ = Элементы.ВопросыАнкет.ТекущаяСтрока.Ссылка.ПолучитьОбъект();
	Объ.ЦветОтвета = Цвет;
	Объ.Записать();
	
	УстановитьЦветОтвета();

КонецПроцедуры


&НаКлиенте
Процедура ВопросыАнкетПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент.Имя = "ВопросыАнкетЦветВопросаПредставление" Тогда
		ФормаВыбораЦвета = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаВыбораЦвета");
		Цвет = ФормаВыбораЦвета.ОткрытьМодально();
		
		Если СтрДлина(Цвет) = 9 Тогда
			ЗаписатьЦветВопроса(Цвет);
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;
	Если Элемент.ТекущийЭлемент.Имя = "ВопросыАнкетЦветОтветаПредставление" Тогда
		ФормаВыбораЦвета = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаВыбораЦвета");
		Цвет = ФормаВыбораЦвета.ОткрытьМодально();
		
		Если СтрДлина(Цвет) = 9 Тогда
			ЗаписатьЦветОтвета(Цвет);
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;

	
КонецПроцедуры
