#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(отказ, стандартнаяОбработка)
	// Параметры:
	//   Если передан параметр Расчет, то параметры ТабличныйДокумент и ВыделенныеОбласти не используются.
	//   Расчет - Структура - Результат функции СтандартныеПодсистемыКлиентСервер.РасчетЯчеек().
	//   ТабличныйДокумент - ТабличныйДокумент - Таблица, для которой выполняются расчеты.
	//   ВыделенныеОбласти - Массив - Области документа, которые требуется рассчитать.
	//       См. возвращаемое значение функции СтандартныеПодсистемыКлиент.ВыделенныеОбласти().
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	расчет = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Расчет");
	
	Если ТипЗнч(расчет) <> Тип("Структура") Тогда
		расчет = СтандартныеПодсистемыКлиентСервер.РасчетЯчеек(параметры.ТабличныйДокумент, параметры.ВыделенныеОбласти);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, расчет);
	
	разрядностьЧисел    = Макс(0, Разрядность(Сумма), Разрядность(Минимум), Разрядность(Максимум));
	разрядностьСреднего = Макс(РазрядностьЧисел, Разрядность(Среднее));
	
	форматЧисел = "ЧДЦ=" + Строка(РазрядностьЧисел) + "; ЧН=0";
	
	Элементы.Сумма.ФорматРедактирования    = форматЧисел;
	Элементы.Минимум.ФорматРедактирования  = форматЧисел;
	Элементы.Максимум.ФорматРедактирования = форматЧисел;
	Элементы.Среднее.ФорматРедактирования  = "ЧДЦ=" + Строка(разрядностьСреднего) + "; ЧН=0";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция Разрядность(число)
	Возврат СтрДлина(Макс(число,-число)%1)-2;
КонецФункции

#КонецОбласти