
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|ГДЕ
	|	ИсполнителиЗадач.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Исполнитель
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|ГДЕ
	|	ИсполнителиЗадач.РольИсполнителя <> ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РольИсполнителя
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсполнителиЗадач.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|ГДЕ
	|	ИсполнителиЗадач.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение
	|АВТОУПОРЯДОЧИВАНИЕ";
	#КонецОбласти
	
	результаты = запрос.ВыполнитьПакет();
	Элементы.КлиентыИсполнитель.СписокВыбора.ЗагрузитьЗначения(результаты[0].Выгрузить().ВыгрузитьКолонку(0));
	Элементы.КлиентыРольИсполнителя.СписокВыбора.ЗагрузитьЗначения(результаты[1].Выгрузить().ВыгрузитьКолонку(0));
	Элементы.КлиентыПодразделение.СписокВыбора.ЗагрузитьЗначения(результаты[2].Выгрузить().ВыгрузитьКолонку(0));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораНаСервере()
	
	Результат = Новый Массив;
	Результат.Добавить(Справочники.Менеджеры.БезМенеджера);
	Результат.Добавить(Справочники.Менеджеры.НайтиПоКоду("000000133"));
	
	
	
	//Элементы.КлиентыМенеджер.СписокВыбора.ЗагрузитьЗначения(
	
	Возврат (Результат);
	
КонецФункции

&НаКлиенте
Процедура КлиентыМенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокВыбораНаСервере());
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентыКлиентПриИзменении(Элемент)
	ОбработатьДанныеСтрокПриИзмененииКлиента(Элементы.Клиенты.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти


#Область ОбработкаДанныхСтрок
&НаКлиенте
Процедура ОбработатьДанныеСтрокПриИзмененииКлиента(ДанныеСтрок)
	
	ОбработатьДанныеСтрокПриИзмененииКлиентаНаСервере(ОбработкаТабличныхЧастейКлиентСервер.ПолучитьИдентификаторыСтрок(ДанныеСтрок));
	
КонецПроцедуры // ОбработатьДанныеСтрокПриИзмененииКлиента()

&НаСервере
Процедура ОбработатьДанныеСтрокПриИзмененииКлиентаНаСервере(Знач мИдентификаторыСтрок)
	
	мДанныеСтрок = ОбработкаТабличныхЧастейКлиентСервер.ПолучитьСтрокиПоИдентификаторам(Объект.Клиенты, мИдентификаторыСтрок);
	мКлиенты = ОбработкаТабличныхЧастейКлиентСервер.ВыгрузитьКолонку(мДанныеСтрок, "Клиент");

	соМенеджеры = ПолучитьМенеджеровПоКлиентам(Объект.НомерКоманды, мКлиенты);
	
	Для каждого ДанныеСтроки Из мДанныеСтрок Цикл
		
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, соМенеджеры[ДанныеСтроки.Клиент]);
		
	КонецЦикла; 

КонецПроцедуры // ОбработатьДанныеСтрокПриИзмененииКлиентаНаСервере()

&НаСервере
Функция ПолучитьМенеджеровПоКлиентам(НомерКоманды, Клиенты)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КонтрагентыМенеджеры.Менеджер,
	|	КонтрагентыМенеджеры.Ссылка КАК Контрагент,
	|	КонтрагентыМенеджеры.Менеджер.Подразделение КАК Подразделение
	|ИЗ
	|	Справочник.Контрагенты.Менеджеры КАК КонтрагентыМенеджеры
	|ГДЕ
	|	КонтрагентыМенеджеры.Менеджер.НомерКоманды = &НомерКоманды
	|	И КонтрагентыМенеджеры.Ссылка В(&Клиенты)");
	
	Запрос.УстановитьПараметр("Клиенты", Клиенты);
	Запрос.УстановитьПараметр("НомерКоманды", НомерКоманды);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	соМенеджеры = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		соМенеджеры.Вставить(Выборка.Контрагент, Новый Структура("Менеджер, Подразделение", Выборка.Менеджер, Выборка.Подразделение));
		
	КонецЦикла;
	
	Возврат (соМенеджеры);
	
КонецФункции // ПолучитьМенеджеровПоКлиентам()

&НаКлиенте
Процедура НомерКомандыПриИзменении(Элемент)
	ЗаполнитьМенеджеровПоНомеруКоманды();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМенеджеровПоНомеруКоманды()
	
	мКлиенты = ОбработкаТабличныхЧастейКлиентСервер.ВыгрузитьКолонку(Объект.Клиенты, "Клиент");
	соМенеджеры = ПолучитьМенеджеровПоКлиентам(Объект.НомерКоманды, мКлиенты);
	
	Для каждого СтрокаКлиенты Из Объект.Клиенты Цикл
		
		СтрокаКлиенты.Менеджер = соМенеджеры[СтрокаКлиенты.Клиент].Менеджер;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
