////Удаляет элемент отбора динамического списка
////
////Параметры:
////Список  - обрабатываемый динамический список,
////ИмяПоля - имя поля компоновки, отбор по которому нужно удалить
////
//Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля)
//	
//	ЭлементыОтбора = Список.Отбор.Элементы;
//	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
//	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
//		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
//			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
//			ЭлементыОтбора.Удалить(ЭлементОтбора);
//		КонецЕсли;
//	КонецЦикла;
//	
//КонецПроцедуры // УдалитьЭлементОтбораСписка()

////Устанавливает элемент отбор динамического списка
////
////Параметры:
////Список			- обрабатываемый динамический список,
////ИмяПоля			- имя поля компоновки, отбор по которому нужно установить,
////ВидСравнения		- вид сравнения отбора, по умолчанию - Равно,
////ПравоеЗначение 	- значение отбора
////
//Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)
//	
//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
//	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
//	ЭлементОтбора.Использование    = Истина;
//	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
//	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
//	
//КонецПроцедуры // УстановитьЭлементОтбораСписка()

////Изменяет элемент отбора динамического списка
////
////Параметры:
////Список         - обрабатываемый динамический список,
////ИмяПоля        - имя поля компоновки, отбор по которому нужно установить,
////ВидСравнения   - вид сравнения отбора, по умолчанию - Равно,
////ПравоеЗначение - значение отбора,
////Установить     - признак необходимости установить отбор
////
//Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено)
//	
//	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
//	
//	Если Установить Тогда
//		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
//	КонецЕсли;
//	
//КонецПроцедуры // ИзменитьЭлементОтбораСписка()

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	Если Параметры.Свойство("Номенклатура") Тогда
//		ИзменитьЭлементОтбораСписка(Список, "Номенклатура", Параметры.Номенклатура, Истина);
//		//Если Параметры.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
//		//	ТекстЗаголовка = НСтр("ru = 'Для элемента: ""%ОтборНоменклатура%"" штрих коды не могут быть заданы.'");
//		//	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ОтборНоменклатура%", Строка(Параметры.Номенклатура));
//		//	АвтоЗаголовок = Ложь;
//		//	Заголовок = ТекстЗаголовка;
//		//	Элементы.Список.ТолькоПросмотр = Истина;
//		//КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры