//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ, В КОТОРОМ ОПРЕДЕЛЯЮТСЯ НАСТРОЙКИ ПОДСИСТЕМЫ

// Функция должна вернуть список значений с описанием виртуальных подсистем
// Пример кода:
//
//	Функция ОписаниеВиртуальныхПодсистем() Экспорт
//		СписокПодсистем = Новый СписокЗначений;
//		СписокПодсистем.Добавить("Маркетинг\АнализКлиентов", "Работа с клиентами")
//		Возврат СписокПодсистем;
//	КонецФункции
//
Функция ОписаниеВиртуальныхПодсистем() Экспорт
	
	СписокПодсистем = Новый СписокЗначений;
	
	
	
	Возврат СписокПодсистем;
	
КонецФункции

// Функция должна вернуть соответсвие с кодом сортировки для каждого варианта отчета
// Пример кода:
//
//	Функция СортировкаПредопределенныхВариантов() Экспорт
//		СоответствиеСортировкиИВариантов = Новый Соответствие;
//		СоответствиеСортировкиИВариантов.Вставить("Отчет.БизнесПроцессыИЗадачи\Основной", "АА00001");
//		Возврат СоответствиеСортировкиИВариантов;
//	КонецФункции
//
Функция СортировкаПредопределенныхВариантов() Экспорт
	
	СоответствиеСортировкиИВариантов = Новый Соответствие;
	Возврат СоответствиеСортировкиИВариантов;
	
КонецФункции

// Функция должна вернуть список значений с ключами отчета, которые поддерживаются подсистемой
//
Функция СписокОтчетовПоддерживаемыхПодсистемой() Экспорт
	
	СписокОтчетов = Новый СписокЗначений;
	
	СписокОтчетов.Добавить("Отчет.ОборотнаяВедомость");
	СписокОтчетов.Добавить("Отчет.ВзаиморасчетыСПоставщиками");
	СписокОтчетов.Добавить("Отчет.ВзаиморасчетыСПокупателями");
	СписокОтчетов.Добавить("Отчет.ВзаиморасчетыССотрудниками");
	СписокОтчетов.Добавить("Отчет.СводныйЗаказПокупателей");
	СписокОтчетов.Добавить("Отчет.Заявки");
	СписокОтчетов.Добавить("Отчет.РеестрПриходныхНакладных");
	СписокОтчетов.Добавить("Отчет.РеестрРасходныхНакладных");
	СписокОтчетов.Добавить("Отчет.РеестрВозвратовПоставщикам");
	СписокОтчетов.Добавить("Отчет.РеестрВозвратовПокупателей");
	СписокОтчетов.Добавить("Отчет.РеестрРасходовДенег");
	СписокОтчетов.Добавить("Отчет.РеестрПоступленийДенег");
	СписокОтчетов.Добавить("Отчет.РеестрАктовСписаний");
	СписокОтчетов.Добавить("Отчет.ОтчетПоКассе");
	СписокОтчетов.Добавить("Отчет.Продажи");
	СписокОтчетов.Добавить("Отчет.ОтчетПоЗаказамПокупателей");
	СписокОтчетов.Добавить("Отчет.ОтчетПоЗаказамПоставщикам");
	СписокОтчетов.Добавить("Отчет.ЗаявкиПоМенеджерам");
	СписокОтчетов.Добавить("Отчет.РасчетЗарплатыПоТорговым");
	СписокОтчетов.Добавить("Отчет.ПроверкаБухКодов");
	СписокОтчетов.Добавить("Отчет.Баланс");
	СписокОтчетов.Добавить("Отчет.ОтчетПоЗатратам");
	СписокОтчетов.Добавить("Отчет.ОтчетПоДоходам");
	СписокОтчетов.Добавить("Отчет.ВедомостьПоЗарплате");
	СписокОтчетов.Добавить("Отчет.ТоварныйОтчет");
	СписокОтчетов.Добавить("Отчет.СводныйДневнойОтчет");
	СписокОтчетов.Добавить("Отчет.ВедомостьПоВзаиморасчетам");
	СписокОтчетов.Добавить("Отчет.ВедомостьПоЗарплате");
	СписокОтчетов.Добавить("Отчет.ВедомостьПоКредитамПолученным");
	СписокОтчетов.Добавить("Отчет.ВедомостьПоЗатратам");
	СписокОтчетов.Добавить("Отчет.ПрайсЛист_");
	СписокОтчетов.Добавить("Отчет.ЗаносДенегПоНаправлениям");
	СписокОтчетов.Добавить("Отчет.ЗаносДенегПоНаправлениям");
	СписокОтчетов.Добавить("Отчет.АнализВыполненияПлановПродаж");
	СписокОтчетов.Добавить("Отчет.Анализ_ПродажиКДебиторке");
	СписокОтчетов.Добавить("Отчет.СтоимостнаяОценкаСклада");
	СписокОтчетов.Добавить("Отчет.Анализ_Продажи");
	СписокОтчетов.Добавить("Отчет.Анализ_НумерическиеПоказатели");
	СписокОтчетов.Добавить("Отчет.ОтчетПоМерчендайзингу");
	СписокОтчетов.Добавить("Отчет.ОтчетПоСводнымПутевымЛистам");
	СписокОтчетов.Добавить("Отчет.ВедомостьПоТоварамВРознице");
	СписокОтчетов.Добавить("Отчет.Р_НакопленныеБонусы");
	СписокОтчетов.Добавить("Отчет.Р_ОтчетПоБонусам_Подробный");
	СписокОтчетов.Добавить("Отчет.Р_ПродажиПоДисконтнымКартам");
	СписокОтчетов.Добавить("Отчет.ПланированиеЗакупок");
	СписокОтчетов.Добавить("Отчет.Активисты");
	СписокОтчетов.Добавить("Отчет.ПродажиСАКБ");
	СписокОтчетов.Добавить("Отчет.СравнительныйАнализАКБ");
	СписокОтчетов.Добавить("Отчет.МерчендайзингИПродажи");
	СписокОтчетов.Добавить("Отчет.ГлубинаПолки");
	СписокОтчетов.Добавить("Отчет.АнализПосещений");
	СписокОтчетов.Добавить("Отчет.СравнительныйАнализОстатковИПродаж");
	СписокОтчетов.Добавить("Отчет.АнализВыполненияПлановПродаж");
	СписокОтчетов.Добавить("Отчет.Анализ_ПоказателиПодразделений");
	СписокОтчетов.Добавить("Отчет.Анализ_Продажи");
	СписокОтчетов.Добавить("Отчет.ДинамикаМаржинальности");
	СписокОтчетов.Добавить("Отчет.ДинамикаНумерическийПоказатель");
	СписокОтчетов.Добавить("Отчет.ДинамикаПросроченнойЗадолженности");
	СписокОтчетов.Добавить("Отчет.ДинамикаЧистойПрибыли");
	СписокОтчетов.Добавить("Отчет.ДинамикаВыполненияПланаПродаж");
	СписокОтчетов.Добавить("Отчет.ДинамикаВыполненияНормативаПоTQM");
	
	Возврат СписокОтчетов;
	
КонецФункции

// Функция возвращает структуру данных для переопределения командного интерфейса
// Пример кода:
//
//	Функция КомандныйИнтерфейс() Экспорт
//		ДанныеОПодсистемахВариантов = ВариантыОтчетов.НоваяСтруктураКомандногоИнтерфейса();
//		ВариантыОтчетов.ДобавитьПодсистемуВариантаВДопНастройках(ДанныеОПодсистемахВариантов, "Отчет.ДинамикаИзмененийФайлов\СводнаяДиаграммаИзменения", "Администрирование");
//		Возврат ДанныеОПодсистемахВариантов;
//	КонецФункции
//
Функция КомандныйИнтерфейс() Экспорт
	
	ДанныеОПодсистемахВариантов = ВариантыОтчетов.НоваяСтруктураКомандногоИнтерфейса();
	
	
	
	Возврат ДанныеОПодсистемахВариантов;
	
КонецФункции

// Процедура вызывается для стыковки с другими подсистемами
// Заполняет список дополнительных команд, которые должны располагаться на панели
//
Процедура СписокДополнительныхКоманд(ТаблицаДополнительныхКоманд, ПутиПодсистемы) Экспорт
	
	
	
КонецПроцедуры

// Процедура вызывается для стыковки с другими подсистемами.
// Стыкуемая подсистема должна хранить признак быстрого доступа. Эта процедура вызывается когда требуется запомнить 
// состояние быстрого команды подсистемы.
//
// Параметры:
//		МассивИдентификаторов   - массив - элемент массива - структуру со свойствами:
//		УникальныйИдентификатор - уникальный идентификатор команды
//		Видимость               - признак видимости команды на панели
//		ПараметрКоманды         - параметр команды
//
Процедура УстановитьБыстрыйДоступВнешнихКоманд(МассивИдентификаторов) Экспорт
	
	
	
КонецПроцедуры

