Функция ПолучитьТекстЗапросаПоПериодамКатегоризации()
	
	результат = 
	"ВЫБРАТЬ
	|	КД_КатегоризацияТорговыхТочек.Период КАК Период,
	|	КД_КатегоризацияТорговыхТочек.Подразделение КАК Подразделение,
	|	КД_КатегоризацияТорговыхТочек.ГруппаПродукции КАК ГруппаПродукции,
	|	КД_КатегоризацияТорговыхТочек.КаналСбыта КАК КаналСбыта,
	|	КД_КатегоризацияТорговыхТочек.ТипСтандарта КАК ТипСтандарта,
	|	КД_КатегоризацияТорговыхТочек.КатегорияТТ,
	|	МАКСИМУМ(ЕСТЬNULL(КД_КатегоризацияТорговыхТочек1.КоличествоSKUПорог, 0)) КАК Порог1,
	|	КД_КатегоризацияТорговыхТочек.КоличествоSKUПорог КАК Порог2
	|ПОМЕСТИТЬ ВТ_ПериодыКатегоризации
	|ИЗ
	|	РегистрСведений.КД_КатегоризацияТорговыхТочек КАК КД_КатегоризацияТорговыхТочек
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегоризацияТорговыхТочек КАК КД_КатегоризацияТорговыхТочек1
	|		ПО КД_КатегоризацияТорговыхТочек.Период = КД_КатегоризацияТорговыхТочек1.Период
	|			И КД_КатегоризацияТорговыхТочек.Подразделение = КД_КатегоризацияТорговыхТочек1.Подразделение
	|			И КД_КатегоризацияТорговыхТочек.ГруппаПродукции = КД_КатегоризацияТорговыхТочек1.ГруппаПродукции
	|			И КД_КатегоризацияТорговыхТочек.КаналСбыта = КД_КатегоризацияТорговыхТочек1.КаналСбыта
	|			И КД_КатегоризацияТорговыхТочек.ТипСтандарта = КД_КатегоризацияТорговыхТочек1.ТипСтандарта
	|			И КД_КатегоризацияТорговыхТочек.КоличествоSKUПорог > КД_КатегоризацияТорговыхТочек1.КоличествоSKUПорог
	|ГДЕ
	|	КД_КатегоризацияТорговыхТочек.КоличествоSKUПорог <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	КД_КатегоризацияТорговыхТочек.Период,
	|	КД_КатегоризацияТорговыхТочек.Подразделение,
	|	КД_КатегоризацияТорговыхТочек.ГруппаПродукции,
	|	КД_КатегоризацияТорговыхТочек.КаналСбыта,
	|	КД_КатегоризацияТорговыхТочек.ТипСтандарта,
	|	КД_КатегоризацияТорговыхТочек.КатегорияТТ,
	|	КД_КатегоризацияТорговыхТочек.КоличествоSKUПорог";
	
	Возврат результат;
	
КонецФункции