#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	___ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Ложь;
	
	Для Каждого СтрокаЗапасы Из Запасы Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.Номенклатура.КВЕД) Тогда
			___ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = ___ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных;
	
КонецПроцедуры

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

#КонецОбласти 