// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкакпкПланПосещений, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
   	 "ВЫБРАТЬ
   	 |	кпкПланПосещенийПланПродаж.Ссылка.Ссылка КАК ДокументПланирования,
   	 |	кпкПланПосещенийПланПродаж.Ссылка.Агент,
   	 |	кпкПланПосещенийПланПродаж.НоменклатурнаяГруппа,
   	 |	кпкПланПосещенийПланПродаж.Количество,
   	 |	кпкПланПосещенийПланПродаж.Сумма,
   	 |	кпкПланПосещенийПланПродаж.Ссылка.Дата КАК Период
   	 |ИЗ
   	 |	Документ.кпкПланПосещений.ПланПродаж КАК кпкПланПосещенийПланПродаж
   	 |ГДЕ
   	 |	кпкПланПосещенийПланПродаж.Ссылка.ВидОперации <> &ВидОперации
   	 |	И кпкПланПосещенийПланПродаж.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкакпкПланПосещений);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.кпкВидыОперацийПланирования.ПланированиеПосещений);
	 
	РезультатЗапроса = Запрос.Выполнить();
	 
 	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицакпкПланыПродаж", РезультатЗапроса.Выгрузить());

	
КонецПроцедуры