
#Область ОбраьртчикиСобытий

&НаКлиенте
Процедура ВидСменыПриИзменении(элемент)
	
	Если ПредопределенноеЗначение("Перечисление.ВидСменыСклада.ДневнаяСмена") = Объект.ВидСмены Тогда
		Объект.ВремяНачалаРаботы = "00010101080000";
		Объект.ВремяОкончанияРаботы = "00010101200000";
	Иначе
		Объект.ВремяОкончанияРаботы = "00010101080000";
		Объект.ВремяНачалаРаботы = "00010101200000";
	КонецЕсли;
	
	ПересчетТабличнойЧастиНаСервере("Грузчики");
	ПересчетТабличнойЧастиНаСервере("Кладовщики");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикиПриОкончанииРедактирования(элемент, новаяСтрока, отменаРедактирования)
	
	Если отменаРедактирования Тогда
		Возврат;			
	КонецЕсли;
	
	Если новаяСтрока Тогда
		ПересчетТабличнойЧастиНаСервере(элемент.Имя);
	Иначе
		ОбработатьДанныеСтрокПриИзменении(Элементы.Грузчики.ТекущиеДанные, элемент.Имя);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикиПослеУдаления(элемент)
	ПересчетТабличнойЧастиНаСервере(элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КладовщикиПриОкончанииРедактирования(элемент, новаяСтрока, отменаРедактирования)
	
	Если отменаРедактирования Тогда
		Возврат;			
	КонецЕсли;
	
	Если новаяСтрока Тогда
		ПересчетТабличнойЧастиНаСервере(элемент.Имя);
	Иначе
		ОбработатьДанныеСтрокПриИзменении(Элементы.Кладовщики.ТекущиеДанные, элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КладовщикиПослеУдаления(элемент)
	ПересчетТабличнойЧастиНаСервере(элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбщийВесПриИзменении(элемент)
	
	ПересчетТабличнойЧастиНаСервере("Грузчики");
	ПересчетТабличнойЧастиНаСервере("Кладовщики");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПересчетТабличнойЧастиНаСервере("Грузчики");
	ПересчетТабличнойЧастиНаСервере("Кладовщики");
	
КонецПроцедуры


#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервере
Процедура ПересчетТабличнойЧастиНаСервере(имяТабличнойЧасти)
	
	ДокументСменныйРапортСкладаСервер.ПересчетТабличнойЧастиДокумента(Объект, имяТабличнойЧасти); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеСтрокПриИзменении(данныеСтрок, имяТабличнойЧасти)
	
	ОбработатьДанныеСтрокПриИзмененииНаСервере(ОбработкаТабличныхЧастейКлиентСервер.ПолучитьИдентификаторыСтрок(данныеСтрок), Новый Структура("ИмяТабличнойЧасти",имяТабличнойЧасти));

КонецПроцедуры // ОбработатьДанныеСтрокПриИзменении()

&НаСервере
Процедура ОбработатьДанныеСтрокПриИзмененииНаСервере(Знач идентификаторыСтрок, Знач дополнительныеСвойства)

	дополнительныеСвойства.Вставить("Объект",Объект);
	
	ДокументСменныйРапортСкладаСервер.ОбработатьДанныеСтрокПриИзменении(идентификаторыСтрок, дополнительныеСвойства);

КонецПроцедуры // ОбработатьДанныеСтрокПриИзмененииНаСервере()

#КонецОбласти