
Функция ПолучитьСтруктуруПараметровпоПодразделению()
	
	результат = Новый Структура;
	
	Для Каждого ресурс Из Метаданные.РегистрыСведений.ПараметрыУчетаПоПодразделениям.Ресурсы Цикл
		результат.Вставить(ресурс.Имя);
	КонецЦикла;
	
	Возврат результат;
	
КонецФункции

Функция ПолучитьПараметрыУчетаПоПодразделению(датаСреза, подразделение, сПараметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если сПараметры = Неопределено Тогда
		сПараметры = ПолучитьСтруктуруПараметровпоПодразделению();
	КонецЕсли;
	
	// ПЕРЕДЕЛАТЬ!!! Добавить ресурс в регистр сведений
	//Если сПараметры.Свойство("СписаниеНаценкиПоИнкассации") Тогда
	//	Если подразделение.Код = "000000029" И датаСреза >= '20171001' Тогда
	//		сПараметры.СписаниеНаценкиПоИнкассации = Ложь;
	//	Иначе
	//		сПараметры.СписаниеНаценкиПоИнкассации = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если сПараметры.Свойство("СписаниеТарыНаЗатраты") Тогда
	//	
	//	розничныеПодразделения = "000000074,000000029,000000149,000000080,000000140";
	//	
	//	Если СтрНайти(подразделение.Код, розничныеПодразделения) > 0 И датаСреза >= '20180101' Тогда
	//		сПараметры.СписаниеТарыНаЗатраты = Ложь;
	//	Иначе
	//		сПараметры.СписаниеТарыНаЗатраты = Ложь;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Если сПараметры.Свойство("ВыполнятьПроверкуОстатковПриОгрузке") Тогда
	//	
	//	подразделения = "000000006";
	//	
	//	Если СтрНайти(подразделение.Код, подразделения) > 0 И датаСреза >= '20180212' Тогда
	//		сПараметры.ВыполнятьПроверкуОстатковПриОгрузке = Истина;
	//	Иначе
	//		сПараметры.ВыполнятьПроверкуОстатковПриОгрузке = Ложь;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ *
	|	
	|ИЗ
	|	РегистрСведений.ПараметрыУчетаПоПодразделениям.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &Подразделение) КАК ПараметрыУчетаПоПодразделениямСрезПоследних";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("ДатаСреза", датаСреза);
	запрос.УстановитьПараметр("Подразделение", подразделение);
	
	результатЗапроса = запрос.Выполнить();
	Если Не результатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(сПараметры, результатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
	
	
	Возврат сПараметры;
	
КонецФункции