
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Оповещения.Параметры.УстановитьЗначениеПараметра("Пользователь",Пользователи.ТекущийПользователь());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОповещенияОбновить",300,Ложь);
	ОповещенияОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияОбновить()
	Элементы.Оповещения.Обновить();
	КнопкаЗавершитьРаботуСистемыОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КнопкаЗавершитьРаботуСистемыОбновитьНаСервере()
	
	ЗавершитьРаботуСистемы = Ложь;
	
	запрос = Новый Запрос;
	
	Для Каждого ЭлементПараметры ИЗ Оповещения.Параметры.Элементы Цикл
		запрос.УстановитьПараметр(ЭлементПараметры.Параметр,ЭлементПараметры.Значение);
	КонецЦикла;
	
	запрос.Текст = Оповещения.ТекстЗапроса;
	
	запросРезультат = Запрос.Выполнить();
	
	Если НЕ запросРезультат.Пустой() Тогда
		
		тз = запросРезультат.Выгрузить();
		
		строки = тз.НайтиСтроки(Новый Структура("ЗавершитьРаботуСистемы",Истина));
		
		Если строки.Количество() > 0 Тогда
			ЗавершитьРаботуСистемы = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаЗавершитьРаботуСистемы.Видимость = ЗавершитьРаботуСистемы;
	Элементы.ГруппаЗавершитьРаботуСистемы.Доступность = ЗавершитьРаботуСистемы;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершитьРаботуСистемы(Команда)
	ЗавершитьРаботуСистемы(Ложь,Истина);
КонецПроцедуры
