
Процедура ПередЗаписью(Отказ, Замещение)
	
Для Каждого СтрЗап Из ЭтотОбъект Цикл
		Если (СтрЗап.ТипПО = Перечисления.Р_ТипыПОПОС.БлокАРМ2)
		 ИЛИ (СтрЗап.ТипПО = Перечисления.Р_ТипыПОПОС.ТерминалАЗС_01М)
		 ИЛИ (СтрЗап.ТипПО = Перечисления.Р_ТипыПОПОС.ResPOS_Petrol) Тогда
			Если ЗначениеЗаполнено(СтрЗап.Оператор) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Для типов ПО ""Блок АРМ-2"", ""ТерминалАЗС-01М"", ""Petrol+"" оператор НЕ заполняется, настройка задается для всего ПО", Отказ);
			КонецЕсли
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрЗап.Оператор) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнен оператор", Отказ);
		КонецЕсли
	КонецЦикла;
	 
	Если (НЕ Отказ) И ОбменДанными.Получатели.АвтоЗаполнение Тогда
		Для Каждого СтрЗап Из ЭтотОбъект Цикл
			СтрУзел = Р_ОбщегоНазначения_ПОС.ПолучитьУзелОбменаПОС(СтрЗап.ПОС, СтрЗап.ТипПО);
			Если ЗначениеЗаполнено(СтрУзел) Тогда
				ОбменДанными.Получатели.Добавить(СтрУзел);
				Прервать;
			КонецЕсли
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

