
Процедура ВыполнитьСлужбу(документ) Экспорт
	
	структураПараметры = Новый Структура;
	структураПараметры.Вставить("НастройкиОтчета", документ.НастройкаОтчёта);
	структураПараметры.Вставить("ПутьКФайлу", документ.КаталогСохраненияФайла);
	структураПараметры.Вставить("ИмяФайла", документ.ИмяФайла);
	структураПараметры.Вставить("ШаблонИнтернетПочтовогоСообщения", документ.ШаблонПочтовогоСообщения);
	
	Документы.Служба.СформироватьОтправитьОтчетПоНастройке(структураПараметры);
	
	РегистрыСведений.ОчередьВыполненияСлужб.ОбновитьЗаданиеВОчереди(документ, Перечисления.СтатусыВыполненияСлужб.Выполнено);
	
КонецПроцедуры