
&НаСервере
Процедура КомандаСохранитьСервер()
	Константы.Р_КаталогХраненияЖурналовОбменаПОС.Установить(КаталогХраненияЖурналаОбмена);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	Если ЗначениеЗаполнено(КаталогХраненияЖурналаОбмена) Тогда
		КомандаСохранитьСервер();
	Иначе
		Сообщить("Введите каталог журнала обмена", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КаталогХраненияЖурналаОбмена = Константы.Р_КаталогХраненияЖурналовОбменаПОС.Получить();
	
КонецПроцедуры
