
#Область ОбработчикиСобытий

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, объектКопирования);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(данныеЗаполнения, стандартнаяОбработка)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеНовогоДокумента(ЭтотОбъект, данныеЗаполнения);
	
	Если Подразделение.Пустая() Тогда
		Подразделение = ПользователиСервер.ПолучитьЗначениеНастройки("ОсновноеПодразделение");
	КонецЕсли; 
	
	Если Ответственный.Пустая() Тогда
		Ответственный = ПользователиСервер.ПолучитьЗначениеНастройки("ОсновнойОтветственный");
	КонецЕсли;
	
	Если ПериодДоставкиНачало = Дата('00010101') Тогда
		ПериодДоставкиНачало = НачалоМесяца(Дата);
	КонецЕсли;
	
	Если ПериодДоставкиОкончание = Дата('00010101') Тогда
		ПериодДоставкиОкончание = КонецМесяца(Дата);
	КонецЕсли;
	
	Если МинимальныйПроцентУдовлетворенияПокупателя = 0 Тогда
		МинимальныйПроцентУдовлетворенияПокупателя = 80;
	КонецЕсли;
	
	Если МинимальныйПроцентУдовлетворенияПоПоставщику = 0 Тогда
		МинимальныйПроцентУдовлетворенияПоПоставщику = 90;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти