#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПланыПродажСтрокиДокумента.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПланыПродажСтрокиДокумента.Ссылка.Подразделение,
	|	ПланыПродажСтрокиДокумента.Менеджер,
	|	ПланыПродажСтрокиДокумента.Ссылка.НоменклатурнаяГруппа,
	|	ПланыПродажСтрокиДокумента.План КАК Количество
	
	|ИЗ
	|	Документ.ПланыПродаж.СтрокиДокумента КАК ПланыПродажСтрокиДокумента
	|ГДЕ
	|	ПланыПродажСтрокиДокумента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ПланыПродаж = Движения.ПланыПродаж;
	ПланыПродаж.Загрузить(Запрос.Выполнить().Выгрузить());
	ПланыПродаж.Записать();
	
	
КонецПроцедуры

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

#КонецОбласти 