
&НаСервере
Функция НаименованиеМодели(Модель)

	Возврат Модель.Наименование;	

КонецФункции // наименованиеМодели()
 

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	Объект.Наименование = НаименованиеМодели(Объект.Модель);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Идентификатор) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	кпкКПК.Ссылка
		|ИЗ
		|	Справочник.кпкКПК КАК кпкКПК
		|ГДЕ
		|	кпкКПК.Ссылка <> &Ссылка
		|	И кпкКПК.Идентификатор = &Идентификатор");
		
		Запрос.УстановитьПараметр("Ссылка", 	   Объект.Ссылка);
		Запрос.УстановитьПараметр("Идентификатор", Объект.Идентификатор);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Устройство с идентификатором: " + Объект.Идентификатор + " уже есть в базе! Не допускается "
											  "использование нескольких одинаковых идентификаторов мобильных устройств!");
			Отказ = Истина;											
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

