&НаСервере
Процедура ПолучитьГраницыСервер()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТоварыГраницы.Подразделение,
	               |	ТоварыГраницы.Регистратор,
	               |	ТоварыГраницы.Период
	               |ИЗ
	               |	Последовательность.Товары.Границы КАК ТоварыГраницы";
				   
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Результат, "РезультатЗапроса");

	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьГраницы(Команда)
	
	ПолучитьГраницыСервер();
	
	а=1;
	
КонецПроцедуры


&НаСервере
Процедура ВосстановитьСервер()
	
	Отбор = Новый ТаблицаЗначений;
	Отбор.Колонки.Добавить("Подразделение");
	
	НоваяСтрока = Отбор.Добавить();
	НоваяСтрока.Подразделение = Подразделение;
	
	Если ЗначениеЗаполнено(ДатаГраницы) Тогда
		Последовательности.Товары.Восстановить(ДатаГраницы, Отбор);
	Иначе
		Последовательности.Товары.Восстановить(, Отбор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	ВосстановитьСервер();
КонецПроцедуры
