Процедура ОбновитьОбъект(Ссылка)
	Если Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	СуществующийЭлемент = Справочники.БПАГОрганизации.НайтиПоРеквизиту("Организация", Ссылка);
	Если СуществующийЭлемент = Справочники.БПАГОрганизации.ПустаяСсылка() Тогда
		СправочникОбъект = Справочники.БПАГОрганизации.СоздатьЭлемент();
	Иначе
		СправочникОбъект = СуществующийЭлемент.ПолучитьОбъект();
	КонецЕсли;
	СправочникОбъект.Организация = Ссылка;
	СправочникОбъект.Наименование = Ссылка.Наименование;
	СправочникОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаБПАГОрганизацийНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаБПАГОрганизацийПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ПеретаскиваемыеЗначения = ПараметрыПеретаскивания.Значение;
	
	Если ТипЗнч(ПеретаскиваемыеЗначения) = Тип("Массив") Тогда
		Для Каждого Перетаскиваемое Из ПеретаскиваемыеЗначения Цикл
			ОбновитьОбъект(Перетаскиваемое);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаБПАГОрганизацийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
	 Форма = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаОрганизации");
	 Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаБПАГОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущаяСтрока);
	Форма = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаОрганизации",ПараметрыФормы);	
	Форма.Открыть();
КонецПроцедуры


