////////////////////////////////////////////////////////////////////////////////
// Подсистема "Версионирование объектов".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Записывает версию объекта в информационную базу.
//
// Параметры
//  Источник - Объект - записываемый объект ИБ;
//  Отказ    - Булево - признак отказа от записи объекта.
//
Процедура ЗаписатьВерсиюОбъекта(источник, отказ) Экспорт
	
	Если источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВерсионированиеОбъектов.СоздатьВерсиюОбъекта(источник);
	
КонецПроцедуры

