// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ВыгрузитьЗаявкиНаСервере(списокУзлов)

	ANTLOGISTICSОбъект = Обработки.ANTLOGISTICS.Создать();
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбменСМуравьинойЛогистикой.Ссылка,
	|	ОбменСМуравьинойЛогистикой.Подразделение,
	|	ОбменСМуравьинойЛогистикой.РежимОтладки,
	|	ОбменСМуравьинойЛогистикой.ИмяПользователя,
	|	ОбменСМуравьинойЛогистикой.ПарольПользователя
	|ИЗ
	|	ПланОбмена.ОбменСМуравьинойЛогистикой КАК ОбменСМуравьинойЛогистикой
	|ГДЕ
	|	ОбменСМуравьинойЛогистикой.ИнтервалВыгрузки > 0
	|	И ОбменСМуравьинойЛогистикой.ПометкаУдаления = ЛОЖЬ";
	#КонецОбласти
	
	//результатЗапроса = запрос.Выполнить();
	
	//выборка = результатЗапроса.Выбрать();
	//Пока выборка.Следующий() Цикл
	Для индекс = 1 По списокУзлов.Количество() Цикл
		
		выборка = списокУзлов[индекс-1];
		
		Если выборка = ПланыОбмена.ОбменСМуравьинойЛогистикой.ЭтотУзел() Тогда
			Продолжить;
		КонецЕсли;
		
		ANTLOGISTICSОбъект.ANT_LOGIN 		= выборка.ИмяПользователя;
		ANTLOGISTICSОбъект.ANT_PASSWORD 	= выборка.ПарольПользователя;
		ANTLOGISTICSОбъект.ДатаМаршрутов 	= ТекущаяДатаСеанса();
		ANTLOGISTICSОбъект.ANT_DEBUG		= выборка.РежимОтладки;
		
		
		ответ = ANTLOGISTICSОбъект.ВыгрузитьЗаявкиПоУзлуОбмена(выборка.Ссылка);
		
		Если ответ.результат Тогда
			текстСообщения = НСтр(СтрШаблон("ru = 'Данные успешно выгружены: %1'", выборка.Подразделение));
			сообщить(текстСообщения);
		Иначе
			текстСообщения = НСтр(СтрШаблон("ru = 'Ошибка выгрузки: %1. Ответ сервера: %2'", выборка.Подразделение, ответ.сообщение));
			сообщить(текстСообщения, СтатусСообщения.Внимание);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВыгрузитьЗаявкиНаСервере()
 


&НаКлиенте
Процедура ОбработкаКоманды(параметрКоманды, параметрыВыполненияКоманды)
	ВыгрузитьЗаявкиНаСервере(параметрКоманды);
КонецПроцедуры
