
#Область ДействияКоманд

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ДобавитьЗаданиеОбмена(Агент, ПрофильОбменаДанными, НаправлениеОбмена);
	ВыполнитьОбменНаСервере();
	ПоказатьПредупреждение(, "Готово");
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Процедура ДобавитьЗаданиеОбмена(агент, профильОбменаДанными, направлениеОбмена)

	менеджерЗаписи = РегистрыСведений.ПанАгентОчередьОбменаДанными.СоздатьМенеджерЗаписи();
	менеджерЗаписи.Агент = агент;
	менеджерЗаписи.ПрофильОбменаДанными = профильОбменаДанными;
	менеджерЗаписи.НаправлениеОбмена = направлениеОбмена;
	
	менеджерЗаписи.Записать();

КонецПроцедуры // ДобавитьЗаданиеОбмена()

&НаСервере
Процедура ВыполнитьОбменНаСервере()
	
	обработкаОбъект = РеквизитФормыВЗначение("Объект");
	обработкаОбъект.ВыполнитьОчередьОбменаДанными();
	
КонецПроцедуры

#КонецОбласти
