//&НаКлиенте
//Процедура КнопкаВыполнитьНажатие(Кнопка)
//	Цвет = Элементы.ТабличноеПолеЦвета.ТекущиеДанные.Цвет;
//	Если СтрДлина(Цвет) = 9 Тогда
//		ЭтаФорма.Закрыть(Цвет);
//	Иначе
//		ЭтаФорма.Закрыть();
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТабличноеПолеЦвета.Очистить();
	РаскраситьТЗ();
КонецПроцедуры

Процедура РаскраситьТЗ()
	Цвета = ПолучитьЦвета();
	Для i = 0 По Цвета.ВГраница() Цикл
		НоваяСтрока = ТабличноеПолеЦвета.Добавить();
		НоваяСтрока.Цвет = Цвета[i];
		//ТмпСписок = Новый СписокЗначений;
		//ТмпСписок.Добавить("000000000");
			
	КонецЦикла;
КонецПроцедуры	

Функция ПолучитьЦвета()
	
	Цвета = Новый Массив(20);
	
	Цвета[0] = "000000000";
	Цвета[1] = "255255255";
	Цвета[2] = "255000000";
	Цвета[3] = "000255000";
	Цвета[4] = "000000255";
	Цвета[5] = "255255000";
	Цвета[6] = "255000255";
	Цвета[7] = "000255255";
	Цвета[8] = "083106194";
	Цвета[9] = "218165032";
	Цвета[10] = "178034034";
	Цвета[11] = "218112214";
	Цвета[12] = "050205050";
	Цвета[13] = "000128000";
	Цвета[14] = "065105225";
	Цвета[15] = "218165032";
	Цвета[16] = "255099071";
	Цвета[17] = "112128144";
	Цвета[18] = "189183107";
	Цвета[19] = "173255047";
	
	Возврат Цвета;

КонецФункции

&НаКлиенте
Процедура ТабличноеПолеЦветаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Цвет = Элементы.ТабличноеПолеЦвета.ТекущиеДанные.Цвет;
	Если СтрДлина(Цвет) = 9 Тогда
		ЭтаФорма.Закрыть(Цвет);
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

