
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт
	
	//СтруктураДанные = Новый Структура();
	//СтруктураДанные.Вставить("Организация", ЭтаФорма.Объект.Организация);

	//СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(СтруктураДанные);
	
	// Расчет скидки на весе
	Если СтрокаТабличнойЧасти.Свойство("ПроцентСкидкиНаВес") Тогда	
		СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.КоличествоОтгружено - СтрокаТабличнойЧасти.КоличествоОтгружено*СтрокаТабличнойЧасти.ПроцентСкидкиНаВес/100;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.Свойство("КоличествоОтклонение") Тогда	
		Если НЕ(СтрокаТабличнойЧасти.КоличествоЗаказано = 0) Тогда
			СтрокаТабличнойЧасти.КоличествоОтклонение = СтрокаТабличнойЧасти.КоличествоЗаказано - СтрокаТабличнойЧасти.Количество; 	
		КонецЕсли;		
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаБезСкидки = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.Скидка 		= СтрокаТабличнойЧасти.СуммаБезСкидки * СтрокаТабличнойЧасти.ПроцентСкидки/ 100;
	СтрокаТабличнойЧасти.Сумма 			= СтрокаТабличнойЧасти.СуммаБезСкидки - СтрокаТабличнойЧасти.Скидка;
	
	// Расчет НДС
	Если СтрокаТабличнойЧасти.Свойство("СуммаНДС") Тогда	
		
		СуммаБезНДС = 100 * СтрокаТабличнойЧасти.СуммаБезСкидки / (100 + 20);
		
		СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаБезСкидки - СуммаБезНДС;
		
	КонецЕсли;
	
КонецПроцедуры
