&НаСервере
Процедура ЗаполнитьНаОснованииСервер()
	
	а=1;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаВыполнить(Команда)
	ЗаполнитьНаОснованииСервер();
	Закрыть(Новый Структура("КонтрагентОснование", КонтрагентОснование));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	а=1;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОснованиеПриИзменении(Элемент)
	
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	//ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	//ЭлементОтбора.Использование    = Истина;
	//ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры
