&НаКлиенте
Функция ПолучитьВидДокумента(СсылкаДок)
	
	Если ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ВидДокументаОтбор = "ПКО";
	ИначеЕсли  ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда 
		ВидДокументаОтбор = "РКО";
	ИначеЕсли ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Или  ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ВидДокументаОтбор = "Поступление";
	ИначеЕсли ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ВидДокументаОтбор = "Перемещение";
	ИначеЕсли ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда		
		ВидДокументаОтбор = "Реализация";
	ИначеЕсли ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.ЗаказКлиента") Тогда		
		ВидДокументаОтбор = "Заказ";				
	ИначеЕсли ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.апПосещение") Тогда		
		ВидДокументаОтбор = "Посещение";			
	ИначеЕсли ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.апМерчендайзинг") Тогда		
		ВидДокументаОтбор = "Мерчендайзинг";			
	КонецЕсли;
			
	Возврат ВидДокументаОтбор;
	
КонецФункции    

&НаКлиенте
Процедура КатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидДокументаОтбор = ПолучитьВидДокумента(Запись.Документ);
	
	СтандартнаяОбработка = Ложь;
	
	ВыбранноеЗначение = ОткрытьФормуМодально("Справочник.апКатегорииДокументов.ФормаВыбора", Новый Структура("ПараметрВидДокумента", ВидДокументаОтбор), ЭтаФорма);   	
	 
	Если Не ВыбранноеЗначение = Неопределено Тогда
		Запись.Категория = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияДляДолгаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидДокументаОтбор = ПолучитьВидДокумента(Запись.Документ);
			
	СтандартнаяОбработка = Ложь;
	
	ВыбранноеЗначение = ОткрытьФормуМодально("Справочник.апКатегорииДокументов.ФормаВыбора", Новый Структура("ПараметрВидДокумента, ПараметрфлДолги", ВидДокументаОтбор, Истина), ЭтаФорма);   	
	 
	Если Не ВыбранноеЗначение = Неопределено Тогда
		Запись.КатегорияДолга = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры
        
&НаСервере
Процедура ОпределитьВидДокумента(Док)

	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.Заказ;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.Возврат;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.апМерчендайзинг") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.Мерчендайзинг;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.Перемещение;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.ПКО;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.РКО;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.апПосещение") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.Посещение;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.Поступление;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Запись.ВидДокумента = Перечисления.апВидыДокументов.Реализация;
	КонецЕсли; 	
	
КонецПроцедуры   

&НаКлиенте
Процедура ДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОпределитьВидДокумента(ВыбранноеЗначение);	
		
КонецПроцедуры

&НаКлиенте
Процедура Фотографии(Команда)
	
	ПараметрыФормы = Новый Структура("Документ", Запись.Документ);
	ОткрытьФорму("Справочник.апФотографииДокументов.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры
