
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ДатаНач = НачалоМесяца(ТекущаяДата());
	ДатаКон = КонецМесяца(ТекущаяДата());
	ТипОтчета = 3;
	ПланФормирования = 0;
	Проведенные = Истина;
	ЗаказПокупателя = Истина;
	Посещение = Истина;
	Мерчендайзинг = Истина;
КонецПроцедуры

&НаСервере
Функция ПроверкаФормы()
	ВсеХорошо = Истина;
	
	Если ДатаНач>ДатаКон Тогда 
		ВсеХорошо = Ложь;
	КонецЕсли;
	
	Если ПолеАгент = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		ВсеХорошо = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Пожалуйста выберите Агента!!!";
		Сообщение.Сообщить(); 
	КонецЕсли; 
	
	Возврат ВсеХорошо;
КонецФункции

&НаСервере
Функция СписокДокументов()
	
	СписВидДок = Новый СписокЗначений;
	
    СписВидДок.Очистить();                 	
	СписВидДок.Добавить("ЗаказПокупателя", 		      "Заказ покупателя", 		       ЗаказПокупателя);
	СписВидДок.Добавить("кпкПосещение", 			  "Посещение", 					   Посещение);
	СписВидДок.Добавить("кпкМерчендайзинг", 		  "Мерчендайзинг",		           Мерчендайзинг);
    СписВидДок.Добавить("ПоступлениеВКассу",   		  "Приходный кассовый ордер",      ПоступлениеВКассу);
	СписВидДок.Добавить("РасходИзКассы",    		 "Расходный кассовый ордер", 	   РасходИзКассы);	
	
	//СписокВидов.Добавить("ЗаказПокупателя",               "Заявка покупателя",   Истина);
	//СписокВидов.Добавить("ПоступлениеВКассу", 			  "ПКО", 			     Истина);
	//СписокВидов.Добавить("РасходИзКассы",    			  "РКО",  			     Истина);		
	//СписокВидов.Добавить("кпкМерчендайзинг", 			  "Мерчендайзинг", 	     Истина);	
	//СписокВидов.Добавить("кпкПосещение", 				  "Посещение", 		     Истина);
	
	Возврат СписВидДок;
КонецФункции

&НаСервере
Процедура СформироватьОтчет()
	
	Агент  	   = ПолеАгент;
	ДатаНач    = ДатаНач;
	ДатаКон    = ДатаКон;
	СписВидДок = СписокДокументов();
	ИспТочек = Константы.кпкРежимТоргТочек.Получить();
	
	//ОчиститьСообщения();
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	кпкПланПосещений.Ссылка,
	|	кпкПланПосещений.ТипПлана КАК ТипПлана
	|ИЗ
	|	Документ.кпкПланПосещений КАК кпкПланПосещений
	|ГДЕ
	|	кпкПланПосещений.Дата МЕЖДУ &НачПер И &КонПер
	|	И кпкПланПосещений.Агент = &Агент
	|	И кпкПланПосещений.ПометкаУдаления = ЛОЖЬ
	|	И кпкПланПосещений.ВидОперации <> &ВидОперации
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТипПлана)
	|ПО
	|	ОБЩИЕ");
	
	Запрос.УстановитьПараметр("НачПер", 	 ДатаНач);
	Запрос.УстановитьПараметр("КонПер", 	 ДатаКон);
	Запрос.УстановитьПараметр("Агент",  	 Агент);  	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.кпкВидыОперацийПланирования.ПланированиеПродаж);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Выборка.Следующий();
	
	КолРазл = Выборка.ТипПлана;
	
	НужнаяДата = ДатаКон;
	Если КолРазл = 2 Тогда
		Сообщить("В выбранном периоде есть документы, введенные разными типами планирования (типы планирования посещений: по контрагентам и по торговым точкам)", СтатусСообщения.Важное);
		Сообщить("Формирование отчета за весь выбранный период невозможно!", СтатусСообщения.Важное);
		ВыборкаДок = Выборка.Выбрать();
		Если ВыборкаДок.Следующий() Тогда
			ИспТочек = ВыборкаДок.ТипПлана;
			Сообщить("Найдены следующие планы посещений: ", СтатусСообщения.Внимание);								
		КонецЕсли;			  		
		
		ВыборкаДок.Сбросить();
		Пока ВыборкаДок.Следующий() Цикл
			ТипПл = ?(ВыборкаДок.ТипПлана, "торговым точкам", "контрагентам");
			Сообщить(Строка(ВыборкаДок.Ссылка) + " тип планирования по " + ТипПл, СтатусСообщения.Внимание);								
			Если ВыборкаДок.ТипПлана<>ИспТочек Тогда				
				НужнаяДата = ВыборкаДок.Ссылка.Дата - 1;			
			КонецЕсли;		                            			
		КонецЦикла; 
		
		//Режим = РежимДиалогаВопрос.ДаНет;
		//Ответ = Вопрос("Вы хотите сформировать отчет за возможный период (период отчета будет изменен)?", Режим, 0);
		//Если Ответ = КодВозвратаДиалога.Да Тогда
		//	ДатаКон = НужнаяДата;			 
		//	Сообщить("Период отчета изменен! Период формирования отчета " + кпкАгентПлюс.ПолучитьПредставлениеПериода(ДатаНач, ДатаКон), СтатусСообщения.Информация);
		//	Сообщить("Отчет сформирован!", СтатусСообщения.Информация);
		//Иначе
		//	Возврат;
		//КонецЕсли;
			ДатаКон = НужнаяДата;			 
			Сообщить("Период отчета изменен! Период формирования отчета " + кпкАгентПлюс.ПолучитьПредставлениеПериода(ДатаНач, ДатаКон), СтатусСообщения.Информация);
			Сообщить("Отчет сформирован!", СтатусСообщения.Информация);
		
	Иначе
		ВыборкаДок = Выборка.Выбрать();
		Если ВыборкаДок.Следующий() Тогда
			ИспТочек = ВыборкаДок.ТипПлана;
		КонецЕсли;			
	КонецЕсли;
	
	Если ИспТочек Тогда
		РазмерСписка = СписВидДок.Количество()-1;
		Для Сч = 0 По РазмерСписка Цикл				
			ТекЭлемент = СписВидДок.Получить(Сч);
			
			МетаданныеДокумента = Документы[ТекЭлемент.Значение].ПустаяСсылка().Метаданные();
			
			ТорговаяТочка = "";
			Если МетаданныеДокумента.Реквизиты.Найти("кпкТорговаяТочка") = Неопределено и 
				МетаданныеДокумента.Реквизиты.Найти("ТорговаяТочка") = Неопределено Тогда				
				СписВидДок.Удалить(ТекЭлемент);
				Сч = Сч - 1;
				РазмерСписка = РазмерСписка - 1;
				Если Сч = РазмерСписка Тогда Прервать; КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
    Таб = Результат;
    Таб.Очистить();
    
    Таб.ФиксацияСверху = 6;
    
    Если ИспТочек = 1 Тогда  
    	Таб.ФиксацияСлева = 4;
    	Пар = "ТорговаяТочка";		
    Иначе		
    	Таб.ФиксацияСлева = 3;
    	Пар = "Контрагент";		
    КонецЕсли;

    ТЗ = Новый ТаблицаЗначений;	
    ТЗ.Колонки.Добавить(Пар);
    ТЗ.Колонки.Добавить("ВнеПлана");
    
    Поз = 0;
    ТекДата = ДатаНач;
    Пока ТекДата <= ДатаКон Цикл
    	ТЗ.Колонки.Добавить("Д" + Поз);
    	ТекДата = ТекДата + 86400;
    	Поз = Поз + 1;
    КонецЦикла;
    ТЗ.Колонки.Добавить("Д" + Поз);
    ТЗКолДней = Поз;
    	
    СтАгент = Новый Структура;
    СтАгент.Вставить("Агент", Агент);
    Док = Документы.КпкПланПосещений.Выбрать(ДатаНач, ДатаКон, СтАгент, "Дата");
    Пока Док.Следующий() Цикл
    	Если Док.Проведен Тогда
    		
    		Смещение = (НачалоДня(Док.Дата) - ДатаНач) / 86400;
    		Граница = ?(ТЗКолДней <= Док.ИнтервалПланирования, ТЗКолДней, Док.ИнтервалПланирования);			
    		Если (Граница + Смещение > ТЗКолДней) Тогда
    			Граница = Мин(Граница, ТЗКолДней - Смещение);
    		КонецЕсли;
    		
    		Для Каждого Стр Из Док.Дни Цикл
    			
    			ТЗСтр = ТЗ.Найти(Стр[Пар], Пар);
    			
    			Если ТЗСтр = Неопределено Тогда
    				ТЗСтр = ТЗ.Добавить();
    				ТЗСтр[Пар] = Стр[Пар];
    				ТЗСтр.ВнеПлана = Ложь;
    				Поз = 0;
    				Пока Поз < Граница Цикл
    					ТЗСтр["Д" + Строка(Поз + Смещение)] = Число(Стр["Д" + Строка(Поз + 1)]);
    					Поз = Поз + 1;
    				КонецЦикла;
    			Иначе
    				Поз = 0;
    				Пока Поз < Граница  Цикл
    					ТЗСтр["Д" + Строка(Поз + Смещение)] = Число(Стр["Д" + Строка(Поз + 1)]);
    					Поз = Поз + 1;
    				КонецЦикла;
    			КонецЕсли;
    		КонецЦикла;
    	КонецЕсли;
    КонецЦикла;
    
    Поз = 0;
    Для Поз = 0 По СписВидДок.Количество() - 1 Цикл
    	Эл = СписВидДок.Получить(Поз);
    	Если Эл.Пометка Тогда  				
    		
    		Если ИспТочек Тогда
    			МетаданныеДокумента = Документы[Эл.Значение].ПустаяСсылка().Метаданные();
    			
    			ТорговаяТочка = "";
    			Если МетаданныеДокумента.Реквизиты.Найти("кпкТорговаяТочка") <> Неопределено Тогда 
    				ТорговаяТочка = "Док.кпкТорговаяТочка КАК ТоргТочка,";
    				ПарДок = "кпкТорговаяТочка";
    			ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ТорговаяТочка") <> Неопределено Тогда				
    				ТорговаяТочка = "Док.ТорговаяТочка КАК ТоргТочка,";				
    				ПарДок = "ТорговаяТочка";
    			КонецЕсли;
    		Иначе
    			ТорговаяТочка = "";				
    			ПарДок = "";			
    		КонецЕсли;
    		
    		УслПроведенные = ?(Проведенные, "И Док.Проведен = Истина", "");
  
    		ПарДок = ?(ИспТочек, ПарДок, "Контрагент");
    		
    		Если ИспТочек Тогда
    			ТекстТочки = " И Док." + ПарДок + " <> &ПустаяТочка";
    		Иначе
    			ТекстТочки = "";
    		КонецЕсли;    			
    					
    		Если ПланФормирования Тогда
    			ТекстДаты = "Док.Дата";
    		Иначе
    			ТекстДаты = "ВложенныйЗапрос.ДатаВремяСоздания";				
    		КонецЕсли; 		
    					
    		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
    		|	Док.Контрагент КАК Клиент," 
    		+ ТорговаяТочка + "
    		|	Док.Ссылка КАК Ссылка,"
    		+ ТекстДаты + " КАК Дата,
    		|	ВложенныйЗапрос.Агент,
    		|	ВложенныйЗапрос.ДатаВремяСоздания
    		|ИЗ
    		|	(ВЫБРАТЬ
    		|		кпкСведенияДокумента.КПКДокумент КАК КПКДокумент,
    		|		кпкСведенияДокумента.Агент КАК Агент,
    		|		кпкСведенияДокумента.ДатаВремяСоздания КАК ДатаВремяСоздания
    		|	ИЗ
    		|		РегистрСведений.кпкСведенияДокумента КАК кпкСведенияДокумента 
    		| ГДЕ 
    		|		кпкСведенияДокумента.Агент В(&ПарАгент))  КАК ВложенныйЗапрос
    		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + Эл.Значение + " КАК Док
    		|		ПО ВложенныйЗапрос.КПКДокумент = Док.Ссылка
    		|ГДЕ
    		|	" + ТекстДаты + " МЕЖДУ &ДатаНач И &ДатаКон
    		|	И Док.ПометкаУдаления = ЛОЖЬ " + УслПроведенные + ТекстТочки + "
    		|УПОРЯДОЧИТЬ ПО
    		|	Ссылка"; 	 
    		
    		Запрос = Новый Запрос(ТекстЗапроса);
    		
    		Запрос.УстановитьПараметр("ДатаНач",     НачалоДня(ДатаНач));
    		Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаКон));
    		Запрос.УстановитьПараметр("ПарАгент",    Агент);
    		Запрос.УстановитьПараметр("ПустаяТочка", Справочники.кпкТорговыеТочки.ПустаяСсылка());
    					
    		Выборка = Запрос.Выполнить().Выбрать();
    		Пока Выборка.Следующий() Цикл
    			Док = Выборка.Ссылка;
    			Смещение = (НачалоДня(Выборка.Дата) - ДатаНач) / 86400;
    			
    			ТЗСтр = ТЗ.Найти(Док[ПарДок], Пар);
    											
    			Если ТЗСтр = Неопределено Тогда
    				ТЗСтр = ТЗ.Добавить();					
    				ТЗСтр[Пар] = Док[ПарДок];					
    				ТЗСтр["Д" + Строка(Смещение)] = -1;					
    				ТЗСтр.ВнеПлана = Истина;
    			Иначе
    				ЗначПос = ТЗСтр["Д" + Строка(Смещение)];
    				Если ЗначПос = Неопределено Тогда 
    					ТЗСтр["Д" + Строка(Смещение)] = -1;
    				Иначе
    					ТЗСтр["Д" + Строка(Смещение)] = ?(ЗначПос >= 1, 2, -1);					
    				КонецЕсли;			
    			КонецЕсли;
    		КонецЦикла;
    		
    	КонецЕсли;
    КонецЦикла;
    
    ТЗИтогДата = Новый ТаблицаЗначений;
    ТЗИтогДата.Колонки.Добавить("План");
    ТЗИтогДата.Колонки.Добавить("Факт");
    ТЗИтогДата.Колонки.Добавить("Вне");
    
    ТЗИтогТочка = Новый ТаблицаЗначений;
    ТЗИтогТочка.Колонки.Добавить("План");
    ТЗИтогТочка.Колонки.Добавить("Факт");
    ТЗИтогТочка.Колонки.Добавить("Вне");
    
    Для Каждого ТЗСтр Из ТЗ Цикл
    	ТФ = 0;
    	ТП = 0;
    	ТВ = 0;
    	Поз = 0;
    	Пока Поз < ТЗКолДней Цикл
    		Если ТЗСтр["Д" + Строка(Поз)] = -1 Тогда
    			ТВ = ТВ + 1;
    		ИначеЕсли ТЗСтр["Д" + Строка(Поз)] = 1 Тогда
    			ТП = ТП + 1;
    		ИначеЕсли ТЗСтр["Д" + Строка(Поз)] = 2 Тогда
    			ТП = ТП + 1;
    			ТФ = ТФ + 1;
    		КонецЕсли;
    		Поз = Поз + 1;
    	КонецЦикла;
    	СтрТочка = ТЗИтогТочка.Добавить();
    	СтрТочка.План = ТП;
    	СтрТочка.Факт = ТФ;
    	СтрТочка.Вне = ТВ;
    КонецЦикла;
    
    Поз = 0;
    Пока Поз < ТЗКолДней Цикл
    	ДФ = 0;
    	ДП = 0;
    	ДВ = 0;
    	Для Каждого ТЗСтр Из ТЗ Цикл
    		Если ТЗСтр["Д" + Строка(Поз)] = -1 Тогда
    			ДВ = ДВ + 1;
    		ИначеЕсли ТЗСтр["Д" + Строка(Поз)] = 1 Тогда
    			ДП = ДП + 1;
    		ИначеЕсли ТЗСтр["Д" + Строка(Поз)] = 2 Тогда
    			ДП = ДП + 1;
    			ДФ = ДФ + 1;
    		КонецЕсли;
    	КонецЦикла;
    	СтрДата = ТЗИтогДата.Добавить();
    	СтрДата.План = ДП;
    	СтрДата.Факт = ДФ;
    	СтрДата.Вне = ДВ;
    	Поз = Поз + 1;
    КонецЦикла;
    	
    Макет = Отчеты.кпкВыполнениеПланаПосещений.ПолучитьМакет("ПланПосещений");
    
    ОбластьШапки = Макет.ПолучитьОбласть("Шапка|Номер");
    
    ОбластьШапки.Параметры.ПечПериод = кпкАгентПлюс.ПолучитьПредставлениеПериода(ДатаНач, ДатаКон);
    ОбластьШапки.Параметры.ПечАгент = Агент.Наименование;
    Таб.Вывести(ОбластьШапки);
    
    ОбластьШапкиКлиент = Макет.ПолучитьОбласть("Шапка|Клиент");	
    Таб.Присоединить(ОбластьШапкиКлиент);
    
    Если ИспТочек Тогда
    	ОбластьШапкиТоргТочка = Макет.ПолучитьОбласть("Шапка|ТоргТочка");	
    	Таб.Присоединить(ОбластьШапкиТоргТочка);		
    КонецЕсли;
    
    ОбластьШапкиАдрес = Макет.ПолучитьОбласть("Шапка|Адрес");	
    Таб.Присоединить(ОбластьШапкиАдрес);
    
    ТекДата = ДатаНач;
    Пока ТекДата <= ДатаКон Цикл
    	Если ДеньНедели(ТекДата) = 6 Тогда
    		ДопОбластьШапки = Макет.ПолучитьОбласть("Шапка|Субб");
    	ИначеЕсли ДеньНедели(ТекДата) = 7 Тогда
    		ДопОбластьШапки = Макет.ПолучитьОбласть("Шапка|Воскр");
    	Иначе
    		ДопОбластьШапки = Макет.ПолучитьОбласть("Шапка|День");
    	КонецЕсли;
    	ДопОбластьШапки.Параметры.ДеньНед = кпкАгентПлюс.ДеньНеделиСтр(ДеньНедели(ТекДата));
    	ДопОбластьШапки.Параметры.ДеньМес = Строка(День(ТекДата)) + "." + Формат(ТекДата, "ДФ=""ММ"";");
    	Таб.Присоединить(ДопОбластьШапки);
    	ТекДата = ТекДата + 86400;
    КонецЦикла;
    
    ВсегоОбластьШапки = Макет.ПолучитьОбласть("Шапка|Всего");
    Таб.Присоединить(ВсегоОбластьШапки);
    
    Ном = 1;
    
    Для Каждого ТЗСтр Из ТЗ Цикл
    	
    	ВнеПлана = ТЗСтр.ВнеПлана;
    	Желтый = Новый Цвет(255,255,0);
    	
    	ОбластьСтрНомер = Макет.ПолучитьОбласть("Строка|Номер");
    	ОбластьСтрНомер.Параметры.Ном = Ном;		
    	
    	Если ВнеПлана Тогда
    		ОбластьСтрНомер.ТекущаяОбласть.ЦветФона = Желтый;								
    	КонецЕсли;
    	Таб.Вывести(ОбластьСтрНомер);
    	//
    	
    	ОбластьСтрКлиент = Макет.ПолучитьОбласть("Строка|Клиент");		
    	ПечКлиент = ?(ИспТочек, ТЗСтр.ТорговаяТочка.Владелец, ТЗСтр.Контрагент);		
    	ОбластьСтрКлиент.Параметры.ПечКлиент = ПечКлиент;
    	ОбластьСтрКлиент.Параметры.ПечКлиентРас = ПечКлиент;
    	
    	Если ВнеПлана Тогда
    		ОбластьСтрКлиент.ТекущаяОбласть.ЦветФона = Желтый;								
    	КонецЕсли;
    	Таб.Присоединить(ОбластьСтрКлиент);
    	//
    	
    	ПечТочка = Справочники.кпкТорговыеТочки.ПустаяСсылка();
    	Если ИспТочек Тогда 
    		ОбластьСтрТоргТочка = Макет.ПолучитьОбласть("Строка|ТоргТочка");		
    		ПечТочка = ТЗСтр.ТорговаяТочка;			
    		ОбластьСтрТоргТочка.Параметры.ПечТочка = ПечТочка;			
    		ОбластьСтрТоргТочка.Параметры.ПечТочкаРас = ПечТочка;			
    		
    		Если ВнеПлана Тогда
    			ОбластьСтрТоргТочка.ТекущаяОбласть.ЦветФона = Желтый;								
    		КонецЕсли;
    	
    		Таб.Присоединить(ОбластьСтрТоргТочка);
    	КонецЕсли;                                               		
    	//
    	ОбластьСтрАдрес = Макет.ПолучитьОбласть("Строка|Адрес");				
    	ОбластьСтрАдрес.Параметры.ПечАдрес = ?(ИспТочек, ТЗСтр.ТорговаяТочка.Адрес, УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(ТЗСтр.Контрагент,"Фактический"));
    	
    	Если ВнеПлана Тогда
    		ОбластьСтрАдрес.ТекущаяОбласть.ЦветФона = Желтый;								
    	КонецЕсли;
    	Таб.Присоединить(ОбластьСтрАдрес);
    	
    	Поз = 0;
    	ТекДата = ДатаНач;
    	Пока ТекДата <= ДатаКон Цикл
    		Если ДеньНедели(ТекДата) = 6 Тогда
    			ДопОбластьСтр = Макет.ПолучитьОбласть("Строка|Субб");
    		ИначеЕсли ДеньНедели(ТекДата) = 7 Тогда
    			ДопОбластьСтр = Макет.ПолучитьОбласть("Строка|Воскр");
    		Иначе
    			ДопОбластьСтр = Макет.ПолучитьОбласть("Строка|День");
    		КонецЕсли;
    		
    		СтруктураРасш = Новый Структура("День, Контрагент, ТоргТочка");
    		
    		Если ТЗСтр["Д" + Строка(Поз)] = -1 Тогда
    			ДопОбластьСтр.Параметры.ПечРабота = "x";				
    			Синий = Новый Цвет(0, 0, 255);
    			
    			СтруктураРасш.День 			= ТекДата;
    			СтруктураРасш.Контрагент 	= ПечКлиент;
    			СтруктураРасш.ТоргТочка 	= ПечТочка;
    			ДопОбластьСтр.Параметры.Док = СтруктураРасш;
    			
    			ДопОбластьСтр.ТекущаяОбласть.ЦветТекста = Синий;								
    		ИначеЕсли ТЗСтр["Д" + Строка(Поз)] = 1 Тогда
    			ДопОбластьСтр.Параметры.ПечРабота = "o";
    			Красный = Новый Цвет(255, 0, 0);
    			ДопОбластьСтр.ТекущаяОбласть.ЦветТекста = Красный;				
    			
    			СтруктураРасш.День          = ТекДата;
    			СтруктураРасш.Контрагент    = ПечКлиент;
    			СтруктураРасш.ТоргТочка     = ПечТочка;
    			ДопОбластьСтр.Параметры.Док = СтруктураРасш;
    			
    		ИначеЕсли ТЗСтр["Д" + Строка(Поз)] = 2 Тогда
    			ДопОбластьСтр.Параметры.ПечРабота = "n";								
    			
    			СтруктураРасш.День 			= ТекДата;
    			СтруктураРасш.Контрагент 	= ПечКлиент;
    			СтруктураРасш.ТоргТочка 	= ПечТочка;
    			ДопОбластьСтр.Параметры.Док = СтруктураРасш;				
    		КонецЕсли;
    		
    		Поз = Поз + 1;
    		ТекДата = ТекДата + 86400;
    		
    		Если ВнеПлана Тогда
    			ДопОбластьСтр.ТекущаяОбласть.ЦветФона = Желтый;								
    		КонецЕсли;
    	
    		Таб.Присоединить(ДопОбластьСтр);
    					 			
    	КонецЦикла;
    	
    	ВсегоОбластьСтр = Макет.ПолучитьОбласть("Строка|Всего");
    	ВсегоСтр = ТЗИтогТочка.Получить(Ном - 1);
    	ВсегоОбластьСтр.Параметры.ВсегоФакт = ВсегоСтр.Факт;
    	ВсегоОбластьСтр.Параметры.ВсегоПлан = ВсегоСтр.План;
    	ВсегоОбластьСтр.Параметры.ВсегоВ = ВсегоСтр.Вне;
    	ВсегоОбластьСтр.Параметры.Выполнение = Формат(?(ВсегоСтр.План = 0, 0, (ВсегоСтр.Факт * 100) / ВсегоСтр.План), "ЧЦ=15; ЧДЦ=2;");
    	
    	Если ВнеПлана Тогда
    		ВсегоОбластьСтр.Области.ОблВсего.ЦветФона = Желтый;								
    	КонецЕсли;
    	
    	Таб.Присоединить(ВсегоОбластьСтр);
    	
    	Ном = Ном + 1;
    КонецЦикла;
    
    ОбластьИтоговНомер = Макет.ПолучитьОбласть("Подвал|Номер");
    Таб.Вывести(ОбластьИтоговНомер);
    
    ОбластьИтоговКлиент = Макет.ПолучитьОбласть("Подвал|Клиент");
    Таб.Присоединить(ОбластьИтоговКлиент);	
    
    Если ИспТочек Тогда 
    	ОбластьИтоговТоргТочка = Макет.ПолучитьОбласть("Подвал|ТоргТочка");
    	Таб.Присоединить(ОбластьИтоговТоргТочка);
    КонецЕсли;
    
    ОбластьИтоговАдрес = Макет.ПолучитьОбласть("Подвал|Адрес");
    Таб.Присоединить(ОбластьИтоговАдрес);
    
    Поз = 0;
    ТекДата = ДатаНач;
    Пока ТекДата <= ДатаКон Цикл
    	Если ДеньНедели(ТекДата) = 6 Тогда
    		ДопОбластьИтогов = Макет.ПолучитьОбласть("Подвал|Субб");
    	ИначеЕсли ДеньНедели(ТекДата) = 7 Тогда
    		ДопОбластьИтогов = Макет.ПолучитьОбласть("Подвал|Воскр");
    	Иначе
    		ДопОбластьИтогов = Макет.ПолучитьОбласть("Подвал|День");
    	КонецЕсли;
    	ВсегоСтр = ТЗИтогДата.Получить(Поз);
    	ДопОбластьИтогов.Параметры.ПечИтогФ = ВсегоСтр.Факт;
    	ДопОбластьИтогов.Параметры.ПечИтогП = ВсегоСтр.План;
    	ДопОбластьИтогов.Параметры.ПечИтогВ = ВсегоСтр.Вне;
    	ДопОбластьИтогов.Параметры.Выполнение = Формат(?(ВсегоСтр.План = 0, 0, (ВсегоСтр.Факт * 100) / ВсегоСтр.План), "ЧЦ=15; ЧДЦ=2;");
    	Таб.Присоединить(ДопОбластьИтогов);
    	Поз = Поз + 1;
    	ТекДата = ТекДата + 86400;
    КонецЦикла;
    
    ВсегоФакт = ТЗИтогТочка.Итог("Факт");
    ВсегоВне = ТЗИтогТочка.Итог("Вне");
    ВсегоПлан = ТЗИтогТочка.Итог("План");
    
    ВсегоОбластьИтогов = Макет.ПолучитьОбласть("Подвал|Всего");
    ВсегоОбластьИтогов.Параметры.ВсегоФакт = ВсегоФакт;
    ВсегоОбластьИтогов.Параметры.ВсегоВ = ВсегоВне;
    ВсегоОбластьИтогов.Параметры.ВсегоПлан = ВсегоПлан;
    ВсегоОбластьИтогов.Параметры.ВсегоВыполнение = Формат(?(ВсегоПлан = 0, 0, (ВсегоФакт * 100) / ВсегоПлан), "ЧЦ=15; ЧДЦ=2;");
    Таб.Присоединить(ВсегоОбластьИтогов);  	
    
    Таб.ТолькоПросмотр = Истина;
    Таб.АвтоМасштаб = Истина;
    //Таб.Показать();
    
    
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ПроверкаФормы() Тогда
		СформироватьОтчет();
	Иначе Сообщение = Новый СообщениеПользователю;
		  Сообщение.Текст = "Проверьте правильность заполнения формы!!!";
		  Сообщение.Сообщить(); 
	КонецЕсли;
КонецПроцедуры

