
&НаСервере
Процедура ЗаписатьЦветВопроса(Цвет)
	
	Объект.ЦветВопроса = Цвет;
	
	
	Если Цвет = "000000000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Черный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Черный;
	ИначеЕсли Цвет = "255255255" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Белый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Белый;
	ИначеЕсли Цвет = "255000000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Красный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Красный;
	ИначеЕсли Цвет = "000255000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ЗеленоЖелтый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ЗеленоЖелтый;
	ИначеЕсли Цвет = "000000255" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Синий;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Синий;
	ИначеЕсли Цвет = "255255000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Желтый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Желтый;
	ИначеЕсли Цвет = "255000255" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.НасыщенноРозовый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.НасыщенноРозовый;
	ИначеЕсли Цвет = "000255255" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Бирюзовый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Бирюзовый;
	ИначеЕсли Цвет = "083106194" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.СинеСерый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.СинеСерый;
	ИначеЕсли Цвет = "218165032" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Золотистый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Золотистый;
	ИначеЕсли Цвет = "178034034" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Малиновый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Малиновый;
	ИначеЕсли Цвет = "218112214" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ТеплоРозовый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ТеплоРозовый;
	ИначеЕсли Цвет = "050205050" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ЛимонноЗеленый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ЛимонноЗеленый;
	ИначеЕсли Цвет = "000128000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ТемноЗеленый;
	ИначеЕсли Цвет = "065105225" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.КоролевскиГолубой;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.КоролевскиГолубой;
	ИначеЕсли Цвет = "218165032" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ХакиТемный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ХакиТемный;
	ИначеЕсли Цвет = "255099071" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Лосось;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Лосось;
	ИначеЕсли Цвет = "112128144" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ГрифельноСерый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ГрифельноСерый;
	ИначеЕсли Цвет = "189183107" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Древесный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Древесный;
	ИначеЕсли Цвет = "173255047" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ЗеленаяЛужайка;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ЗеленаяЛужайка;
	Иначе	
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Черный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЦветВопросаНажатие(Элемент)
		ФормаВыбораЦвета = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаВыбораЦвета");
		Цвет = ФормаВыбораЦвета.ОткрытьМодально();
		
		Если СтрДлина(Цвет) = 9 Тогда
			ЗаписатьЦветВопроса(Цвет);
		КонецЕсли;
		Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦветОтвета(Цвет)
	
	Объект.ЦветОтвета = Цвет;
	
	
	Если Цвет = "000000000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Черный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Черный;
	ИначеЕсли Цвет = "255255255" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Белый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Белый;
	ИначеЕсли Цвет = "255000000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Красный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Красный;
	ИначеЕсли Цвет = "000255000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ЗеленоЖелтый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ЗеленоЖелтый;
	ИначеЕсли Цвет = "000000255" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Синий;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Синий;
	ИначеЕсли Цвет = "255255000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Желтый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Желтый;
	ИначеЕсли Цвет = "255000255" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.НасыщенноРозовый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.НасыщенноРозовый;
	ИначеЕсли Цвет = "000255255" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Бирюзовый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Бирюзовый;
	ИначеЕсли Цвет = "083106194" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.СинеСерый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.СинеСерый;
	ИначеЕсли Цвет = "218165032" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Золотистый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Золотистый;
	ИначеЕсли Цвет = "178034034" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Малиновый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Малиновый;
	ИначеЕсли Цвет = "218112214" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ТеплоРозовый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ТеплоРозовый;
	ИначеЕсли Цвет = "050205050" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ЛимонноЗеленый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ЛимонноЗеленый;
	ИначеЕсли Цвет = "000128000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ТемноЗеленый;
	ИначеЕсли Цвет = "065105225" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.КоролевскиГолубой;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.КоролевскиГолубой;
	ИначеЕсли Цвет = "218165032" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ХакиТемный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ХакиТемный;
	ИначеЕсли Цвет = "255099071" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Лосось;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Лосось;
	ИначеЕсли Цвет = "112128144" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ГрифельноСерый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ГрифельноСерый;
	ИначеЕсли Цвет = "189183107" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Древесный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Древесный;
	ИначеЕсли Цвет = "173255047" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ЗеленаяЛужайка;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ЗеленаяЛужайка;
	Иначе	
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Черный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЦветОтветаНажатие(Элемент)
		ФормаВыбораЦвета = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаВыбораЦвета");
		Цвет = ФормаВыбораЦвета.ОткрытьМодально();
		
		Если СтрДлина(Цвет) = 9 Тогда
			ЗаписатьЦветОтвета(Цвет);
		КонецЕсли;
		Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦветОтветаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗаписатьЦветОтвета(Текст);
КонецПроцедуры

&НаКлиенте
Процедура ЦветВопросаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗаписатьЦветВопроса(Текст);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
	Если Объект.ЦветВопроса = "000000000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Черный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "255255255" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Белый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Белый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "255000000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Красный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;

	Если Объект.ЦветВопроса = "000255000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ЗеленоЖелтый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ЗеленоЖелтый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "000000255" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Синий;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Синий;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "255255000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Желтый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Желтый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "255000255" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.НасыщенноРозовый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.НасыщенноРозовый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "000255255" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Бирюзовый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Бирюзовый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "083106194" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.СинеСерый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.СинеСерый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "218165032" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Золотистый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Золотистый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "178034034" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Малиновый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Малиновый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "218112214" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ТеплоРозовый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ТеплоРозовый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "050205050" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ЛимонноЗеленый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ЛимонноЗеленый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "000128000" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ТемноЗеленый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "065105225" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.КоролевскиГолубой;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.КоролевскиГолубой;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "218165032" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ХакиТемный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ХакиТемный;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "255099071" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Лосось;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Лосось;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "112128144" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ГрифельноСерый;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ГрифельноСерый;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "189183107" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.Древесный;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.Древесный;
	КонецЕсли;
	
	Если Объект.ЦветВопроса = "173255047" Тогда
		Элементы.ДекорацияЦветВопроса.ЦветФона = WebЦвета.ЗеленаяЛужайка;
		Элементы.ДекорацияЦветВопроса.ЦветТекста = WebЦвета.ЗеленаяЛужайка;
	КонецЕсли;

	
	Если Объект.ЦветОтвета = "000000000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Черный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "255255255" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Белый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Белый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "255000000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Красный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;

	Если Объект.ЦветОтвета = "000255000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ЗеленоЖелтый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ЗеленоЖелтый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "000000255" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Синий;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Синий;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "255255000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Желтый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Желтый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "255000255" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.НасыщенноРозовый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.НасыщенноРозовый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "000255255" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Бирюзовый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Бирюзовый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "083106194" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.СинеСерый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.СинеСерый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "218165032" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Золотистый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Золотистый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "178034034" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Малиновый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Малиновый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "218112214" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ТеплоРозовый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ТеплоРозовый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "050205050" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ЛимонноЗеленый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ЛимонноЗеленый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "000128000" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ТемноЗеленый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "065105225" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.КоролевскиГолубой;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.КоролевскиГолубой;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "218165032" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ХакиТемный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ХакиТемный;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "255099071" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Лосось;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Лосось;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "112128144" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ГрифельноСерый;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ГрифельноСерый;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "189183107" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.Древесный;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.Древесный;
	КонецЕсли;
	
	Если Объект.ЦветОтвета = "173255047" Тогда
		Элементы.ДекорацияЦветОтвета.ЦветФона = WebЦвета.ЗеленаяЛужайка;
		Элементы.ДекорацияЦветОтвета.ЦветТекста = WebЦвета.ЗеленаяЛужайка;
	КонецЕсли;	
КонецПроцедуры

