
Процедура ПередЗаписью(отказ, замещение)
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		
		записьНабора = ЭтотОбъект[0];
		
		запрос = Новый Запрос;
		
		#Область ТекстЗапроса
		
		запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязанныеДокументы.КлючСвязи
		|ИЗ
		|	Последовательность.СвязанныеДокументы КАК СвязанныеДокументы
		|ГДЕ
		|	СвязанныеДокументы.Регистратор = &Регистратор";
		
		#КонецОбласти
		
		запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Регистратор);
		
		результатЗапроса = запрос.Выполнить();
		
		Если Не результатЗапроса.Пустой() Тогда
			записьНабора.ключСвязи = результатЗапроса.Выгрузить()[0].КлючСвязи;
		КонецЕсли;
		
		Если ПустаяСтрока(записьНабора.ключСвязи) Тогда
			записьНабора.ключСвязи = ЭтотОбъект.Регистратор.УникальныйИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


