
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запись_       = РеквизитФормыВЗначение("Запись");
	
	ТаблицаЦен = Запись_.ТипыЦен.Получить();
	
	Если Не ТаблицаЦен = Неопределено Тогда
		Для Каждого ТекСтрока Из ТаблицаЦен Цикл
			НоваяСтрока 		  = СписокЦен.Добавить();
			НоваяСтрока.Выгружать = ТекСтрока.Выгружать;
			НоваяСтрока.ТипыЦен   = ТекСтрока.ТипыЦен;
			Если Не ТаблицаЦен.Колонки.Найти("Код") = Неопределено Тогда
				НоваяСтрока.Код	= ТекСтрока.Код;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого ТекСтрока Из СписокЦен Цикл
		ТекСтрока.Выгружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого ТекСтрока Из СписокЦен Цикл
		ТекСтрока.Выгружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

 &НаСервере
Процедура ВыгрузитьВидыЦен()

	СписокТипЦен = Справочники.ТипыЦен.Выбрать();
	Сч = 1;
	Пока СписокТипЦен.Следующий() Цикл
		Если СписокТипЦен.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		НоваяСтрока 		= СписокЦен.Добавить();
		НоваяСтрока.ТипыЦен = СписокТипЦен.Ссылка;
		НоваяСтрока.Код 	= Сч;
		Сч = Сч + 1;
	КонецЦикла;

КонецПроцедуры // ВыгрузитьВидыЦен()

&НаКлиенте
Процедура ЗаполнитьПоСправочнику(Команда)
	Если СписокЦен.Количество() > 0 Тогда
		ОчиститьТаблицу = Вопрос("Перед заполнением список цен будет очищен. Если уже производилась выгрузка данных в МУ, то возможны проблемы при обмене данными. Продолжить заполнение?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если ОчиститьТаблицу = КодВозвратаДиалога.Да Тогда
			СписокЦен.Очистить();
		Иначе
			Возврат;		
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
	ВыгрузитьВидыЦен();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запись_       = РеквизитФормыВЗначение("Запись");

	Запись_.ТипыЦен = Новый ХранилищеЗначения(СписокЦен.Выгрузить());
	
	Запись_.Записать();
	
	ЗначениеВРеквизитФормы(Запись_, "Запись");

КонецПроцедуры
