
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		// Раздел установки параметров сеанса при начале сеанса (ИменаПараметровСеанса = Неопределено)
		// Выполняется установка параметров сеанса, которые можно инициализировать 
		// при начале работы системы
		
	Иначе
		// Установка параметров сеанса "по требованию"
		
		// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
		// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
		УстановленныеПараметры = Новый Массив;
		Для каждого ИмяПараметра Из ТребуемыеПараметры Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


// Установить значения параметров сеанса и возвратить имена установленных параметров сеанса
// в параметре УстановленныеПараметры.
//
// Параметры
//  ИмяПараметра  - Строка - имя параметра сеанса, который требуется установить (проинициализировать).
//  УстановленныеПараметры  - Массив - массив, в который добавляются имена
//                                     установленных (проинициализированных) параметров.
//
Процедура УстановитьЗначениеПараметраСеанса(Знач имяПараметра, установленныеПараметры)
	
	// СтандартныеПодсистемы
	// Если в данном вызове УстановкаПараметровСеанса параметр ИмяПараметра уже 
	// установлен - возврат.
	Если УстановленныеПараметры.Найти(имяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Пользователи
	Пользователи.ОпределитьТекущегоПользователя(имяПараметра, установленныеПараметры);
	
	
	// Для установки параметров сеанса можно использовать шаблон:
	//Если ИмяПараметра = <ИмяПараметра> Тогда
	//   УстановленныеПараметры.Добавить(<ИмяПараметра>);
	//ИначеЕсли
	
	//ПодключаемоеОборудование
	//МенеджерОборудованияСервер.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры);
	// Конец ПодключаемоеОборудование
	
	Если имяПараметра = "ОбластьДанных" Тогда
		ПараметрыСеанса.ОбластьДанных = Пользователи.ОпределитьТекущуюОбластьДанных();
		УстановленныеПараметры.Добавить(имяПараметра);
	КонецЕсли;

	Если имяПараметра = "Кладовщик" Тогда
		ПараметрыСеанса.Кладовщик = Справочники.Сотрудники.ПустаяСсылка();
		УстановленныеПараметры.Добавить(имяПараметра);
	КонецЕсли;
	
	Если имяПараметра = "Наборщик" Тогда
		ПараметрыСеанса.Наборщик = Справочники.Сотрудники.ПустаяСсылка();
		УстановленныеПараметры.Добавить(имяПараметра);
	КонецЕсли;
	
	Если имяПараметра = "ДоступныеСклады" Тогда
		
		ПользователиПривилегированный.ИнициализироватьДоступныеСклады();
		УстановленныеПараметры.Добавить(имяПараметра);
		
	КонецЕсли; 
	
	Если имяПараметра = "ДоступныеПоставщики" Тогда
		
		ПользователиПривилегированный.ИнициализироватьДоступныеПоставщики();
		УстановленныеПараметры.Добавить(имяПараметра);
		
	КонецЕсли; 
	
	Если имяПараметра = "ДоступныеМенеджеры" Тогда
		
		ПользователиПривилегированный.ИнициализироватьДоступныеМенеджеры();
		УстановленныеПараметры.Добавить(имяПараметра);
		
	КонецЕсли; 
	
	Если имяПараметра = "ДоступныеПодразделения" Тогда
		
		ПользователиПривилегированный.ИнициализироватьДоступныеПодразделения();
		УстановленныеПараметры.Добавить(имяПараметра);
		
	КонецЕсли;
	
	Если имяПараметра = "ДоступныеКатегорииРаботников" Тогда
		
		ПользователиПривилегированный.ИнициализироватьДоступныеКатегорииРаботников();
		УстановленныеПараметры.Добавить(имяПараметра);
		
	КонецЕсли;

КонецПроцедуры

