#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(данныеЗаполнения, стандартнаяОбработка)

	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеНовогоДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(отказ, режимПроведения)
	
	Движения.КД_ВыполнениеСтандартаМерчендайзинга.Записывать = Истина;
	Движения.КД_ВыполнениеСтандартаПрисутствия.Записывать = Истина;
	
	менеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = менеджерВременныхТаблиц;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(БПАГМерчандайзингТовары.Ссылка.Дата, ДЕНЬ) КАК Период,
	|	БПАГМерчандайзингТовары.Ссылка.Подразделение,
	|	БПАГМерчандайзингТовары.Ссылка.Контрагент КАК ТорговаяТочка,
	|	БПАГМерчандайзингТовары.Номенклатура.КД_Группа КАК ГруппаПродукта,
	|	СУММА(0) КАК ОбщееКоличествоSKU,
	|	БПАГМерчандайзингТовары.Ссылка.Контрагент.КД_КаналСбыта КАК КаналСбыта,
	|	БПАГМерчандайзингТовары.Ссылка.Контрагент.КД_ТипСтандартаПрисутствия КАК ТипСтандарта
	|ПОМЕСТИТЬ ВТ_ГруппыПродукта
	|ИЗ
	|	Документ.БПАГМерчандайзинг.Товары КАК БПАГМерчандайзингТовары
	|ГДЕ
	|	БПАГМерчандайзингТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БПАГМерчандайзингТовары.Ссылка.Подразделение,
	|	БПАГМерчандайзингТовары.Ссылка.Контрагент,
	|	БПАГМерчандайзингТовары.Номенклатура.КД_Группа,
	|	КОНЕЦПЕРИОДА(БПАГМерчандайзингТовары.Ссылка.Дата, ДЕНЬ),
	|	БПАГМерчандайзингТовары.Ссылка.Контрагент.КД_КаналСбыта,
	|	БПАГМерчандайзингТовары.Ссылка.Контрагент.КД_ТипСтандартаПрисутствия";
		
	#КонецОбласти
	
	//запрос.УстановитьПараметр("ДатаСреза", КонецДня(Дата));
	запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	запрос.Выполнить();
	
	#Область ПолучениеВиртуальныхТаблиц
		запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_ГруппыПродукта";
		запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_СвойстваТорговойТочкиПоГруппеПродукта";
	#КонецОбласти
	
	Справочники.Контрагенты.ДобавитьЗапросСвойствТорговойТочки(менеджерВременныхТаблиц);
	
	#Область ТекстЗапроса
	
	запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.ДлинаВитриныИзСправочника,
	|	ВложенныйЗапрос.ДлинаВитриныМинимальная,
	|	ВложенныйЗапрос.КаналСбыта,
	|	ВложенныйЗапрос.КатегорияТТ,
	|	ВложенныйЗапрос.КатегорияТТИзСправочника,
	|	ВложенныйЗапрос.КоличествоSKUИзСправочника,
	|	ВложенныйЗапрос.КоличествоSKUПорог,
	|	ВложенныйЗапрос.ОбщееКоличествоSKU,
	|	ВложенныйЗапрос.ПериодКатегоризацияТорговыхТочек,
	|	ВложенныйЗапрос.ПериодКатегорииТорговыхТочек,
	|	ВложенныйЗапрос.ТипСтандарта,
	|	ВложенныйЗапрос.ТорговаяТочка,
	|	ВложенныйЗапрос.ГруппаПродукта,
	|	ВложенныйЗапрос.ПериодСтандартПрисутствия,
	|	КД_СтандартПрисутствия.Номенклатура,
	|	КД_СтандартПрисутствия.ПриоритетПродукта,
	|	КД_СтандартПрисутствия.ТипПриоритета,
	|	КД_СтандартПрисутствия.Фэйсинг КАК ФэйсингСтандарт,
	|	КД_СтандартПрисутствия.ВидПродукции,
	|	1 КАК Стандарт
	|ПОМЕСТИТЬ ВТ_СтандартПрисутствия
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.Период КАК Период,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.Подразделение КАК Подразделение,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ДлинаВитриныИзСправочника КАК ДлинаВитриныИзСправочника,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ДлинаВитриныМинимальная КАК ДлинаВитриныМинимальная,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КаналСбыта КАК КаналСбыта,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КатегорияТТ КАК КатегорияТТ,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КатегорияТТИзСправочника КАК КатегорияТТИзСправочника,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КоличествоSKUИзСправочника КАК КоличествоSKUИзСправочника,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КоличествоSKUПорог КАК КоличествоSKUПорог,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ОбщееКоличествоSKU КАК ОбщееКоличествоSKU,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ПериодКатегоризацияТорговыхТочек КАК ПериодКатегоризацияТорговыхТочек,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ПериодКатегорииТорговыхТочек КАК ПериодКатегорииТорговыхТочек,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ТипСтандарта КАК ТипСтандарта,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ТорговаяТочка КАК ТорговаяТочка,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ГруппаПродукта КАК ГруппаПродукта,
	|		МАКСИМУМ(КД_СтандартПрисутствия.Период) КАК ПериодСтандартПрисутствия
	|	ИЗ
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта КАК ВТ_СвойстваТорговойТочкиПоГруппеПродукта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_СтандартПрисутствия КАК КД_СтандартПрисутствия
	|			ПО ВТ_СвойстваТорговойТочкиПоГруппеПродукта.Подразделение = КД_СтандартПрисутствия.Подразделение
	|				И ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ГруппаПродукта = КД_СтандартПрисутствия.ГруппаПродукции
	|				И ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КатегорияТТ = КД_СтандартПрисутствия.КатегорияТТ
	|				И ВТ_СвойстваТорговойТочкиПоГруппеПродукта.Период >= КД_СтандартПрисутствия.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.Период,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.Подразделение,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ДлинаВитриныИзСправочника,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ДлинаВитриныМинимальная,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КаналСбыта,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КатегорияТТ,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КатегорияТТИзСправочника,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КоличествоSKUИзСправочника,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КоличествоSKUПорог,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ОбщееКоличествоSKU,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ПериодКатегоризацияТорговыхТочек,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ПериодКатегорииТорговыхТочек,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ТипСтандарта,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ТорговаяТочка,
	|		ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ГруппаПродукта) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_СтандартПрисутствия КАК КД_СтандартПрисутствия
	|		ПО ВложенныйЗапрос.Подразделение = КД_СтандартПрисутствия.Подразделение
	|			И ВложенныйЗапрос.ГруппаПродукта = КД_СтандартПрисутствия.ГруппаПродукции
	|			И ВложенныйЗапрос.КатегорияТТ = КД_СтандартПрисутствия.КатегорияТТ
	|			И ВложенныйЗапрос.ПериодСтандартПрисутствия = КД_СтандартПрисутствия.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта.Период,
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта.Подразделение,
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ГруппаПродукта,
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КатегорияТТ,
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КатегорияТТИзСправочника,
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ТорговаяТочка,
	|	БПАГМерчандайзингТовары.Ссылка.Агент.Менеджер КАК Менеджер,
	|	БПАГМерчандайзингТовары.Номенклатура,
	|	0 КАК ФэйсингФакт,
	|	ВЫБОР
	|		КОГДА ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ДлинаВитриныИзСправочника >= ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ДлинаВитриныМинимальная
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЕстьСтандартМерчендайзинга,
	|	ЗНАЧЕНИЕ(Перечисление.КД_ВидОтчетаПоСтандарту.МониторингСтандартов) КАК ВидОтчетаПоСтандарту,
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ОбщееКоличествоSKU,
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта.КатегорийнаяГруппа
	|ПОМЕСТИТЬ ВТ_ДокументСостав
	|ИЗ
	|	ВТ_СвойстваТорговойТочкиПоГруппеПродукта КАК ВТ_СвойстваТорговойТочкиПоГруппеПродукта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.БПАГМерчандайзинг.Товары КАК БПАГМерчандайзингТовары
	|		ПО ВТ_СвойстваТорговойТочкиПоГруппеПродукта.ГруппаПродукта = БПАГМерчандайзингТовары.Номенклатура.КД_Группа
	|ГДЕ
	|	БПАГМерчандайзингТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.ГруппаПродукта,
	|	ВложенныйЗапрос.КатегорияТТ,
	|	ВложенныйЗапрос.КатегорияТТИзСправочника КАК КатегорияТТИзКарточки,
	|	ВложенныйЗапрос.ТорговаяТочка,
	|	ВложенныйЗапрос.Менеджер,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ФэйсингФакт,
	|	ВложенныйЗапрос.ФэйсингСтандарт,
	|	ВложенныйЗапрос.ВидОтчетаПоСтандарту,
	|	ВложенныйЗапрос.КатегорийнаяГруппа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ДокументСостав.Период КАК Период,
	|		ВТ_ДокументСостав.Подразделение КАК Подразделение,
	|		ВТ_ДокументСостав.ГруппаПродукта КАК ГруппаПродукта,
	|		ВТ_ДокументСостав.КатегорияТТ КАК КатегорияТТ,
	|		ВТ_ДокументСостав.КатегорияТТИзСправочника КАК КатегорияТТИзСправочника,
	|		ВТ_ДокументСостав.ТорговаяТочка КАК ТорговаяТочка,
	|		ВТ_ДокументСостав.Менеджер КАК Менеджер,
	|		ВТ_ДокументСостав.Номенклатура КАК Номенклатура,
	|		ВЫБОР
	|			КОГДА ВТ_ДокументСостав.ФэйсингФакт = 0
	|				ТОГДА ЕСТЬNULL(ВТ_СтандартПрисутствия.ФэйсингСтандарт, 0)
	|			ИНАЧЕ ВТ_ДокументСостав.ФэйсингФакт
	|		КОНЕЦ КАК ФэйсингФакт,
	|		ЕСТЬNULL(ВТ_СтандартПрисутствия.ФэйсингСтандарт, 0) КАК ФэйсингСтандарт,
	|		ВТ_ДокументСостав.ВидОтчетаПоСтандарту КАК ВидОтчетаПоСтандарту,
	|		ВТ_ДокументСостав.КатегорийнаяГруппа КАК КатегорийнаяГруппа
	|	ИЗ
	|		ВТ_ДокументСостав КАК ВТ_ДокументСостав
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартПрисутствия КАК ВТ_СтандартПрисутствия
	|			ПО ВТ_ДокументСостав.Период = ВТ_СтандартПрисутствия.Период
	|				И ВТ_ДокументСостав.Подразделение = ВТ_СтандартПрисутствия.Подразделение
	|				И ВТ_ДокументСостав.КатегорияТТ = ВТ_СтандартПрисутствия.КатегорияТТ
	|				И ВТ_ДокументСостав.Номенклатура = ВТ_СтандартПрисутствия.Номенклатура
	|	ГДЕ
	|		ВТ_ДокументСостав.ЕстьСтандартМерчендайзинга <> 0) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.ФэйсингФакт <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументСостав.Период,
	|	ВТ_ДокументСостав.Подразделение,
	|	ВТ_ДокументСостав.ГруппаПродукта,
	|	ВТ_ДокументСостав.КатегорияТТ,
	|	ВТ_ДокументСостав.КатегорияТТИзСправочника КАК КатегорияТТИзКарточки,
	|	ВТ_ДокументСостав.ТорговаяТочка,
	|	ВТ_ДокументСостав.Менеджер,
	|	ВТ_ДокументСостав.Номенклатура,
	|	СУММА(ЕСТЬNULL(ВТ_СтандартПрисутствияПоПриоритетам.Стандарт, 0)) КАК НормаКоличествоSKUПоПриоритету,
	|	ВТ_ДокументСостав.ОбщееКоличествоSKU КАК ОбщКоличествоSKU,
	|	ЕСТЬNULL(ВТ_СтандартПрисутствия.ПриоритетПродукта, ЗНАЧЕНИЕ(Справочник.КД_ПриоритетыПродукта.Вывод)) КАК ПриоритетПродукта,
	|	ЕСТЬNULL(ВТ_СтандартПрисутствия.ТипПриоритета, ЗНАЧЕНИЕ(Перечисление.КД_ТипыПриоритетовПродукта.НеРекомендуемый)) КАК ТипПриоритета,
	|	1 КАК ФактКоличествоSKUПоПриоритету,
	|	ВТ_ДокументСостав.ВидОтчетаПоСтандарту,
	|	ВТ_ДокументСостав.КатегорийнаяГруппа
	|ИЗ
	|	ВТ_ДокументСостав КАК ВТ_ДокументСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартПрисутствия КАК ВТ_СтандартПрисутствия
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартПрисутствия КАК ВТ_СтандартПрисутствияПоПриоритетам
	|			ПО (ВТ_СтандартПрисутствияПоПриоритетам.ПриоритетПродукта = ВТ_СтандартПрисутствия.ПриоритетПродукта)
	|		ПО ВТ_ДокументСостав.Номенклатура = ВТ_СтандартПрисутствия.Номенклатура
	|ГДЕ
	|	ВТ_ДокументСостав.КатегорияТТ <> NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДокументСостав.Номенклатура,
	|	ЕСТЬNULL(ВТ_СтандартПрисутствия.ПриоритетПродукта, ЗНАЧЕНИЕ(Справочник.КД_ПриоритетыПродукта.Вывод)),
	|	ЕСТЬNULL(ВТ_СтандартПрисутствия.ТипПриоритета, ЗНАЧЕНИЕ(Перечисление.КД_ТипыПриоритетовПродукта.НеРекомендуемый)),
	|	ВТ_ДокументСостав.ОбщееКоличествоSKU,
	|	ВТ_ДокументСостав.Период,
	|	ВТ_ДокументСостав.Подразделение,
	|	ВТ_ДокументСостав.ГруппаПродукта,
	|	ВТ_ДокументСостав.КатегорияТТ,
	|	ВТ_ДокументСостав.ТорговаяТочка,
	|	ВТ_ДокументСостав.Менеджер,
	|	ВТ_ДокументСостав.КатегорияТТИзСправочника,
	|	ВТ_ДокументСостав.ВидОтчетаПоСтандарту,
	|	ВТ_ДокументСостав.КатегорийнаяГруппа";
	
	#КонецОбласти
	
	
	
	
	результатЗапроса = запрос.ВыполнитьПакет();
	
	#Область ПолучениеВиртуальныхТаблиц
		запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_СтандартПрисутствия";
		запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_ДокументСостав";
	#КонецОбласти 
	
	Движения.КД_ВыполнениеСтандартаМерчендайзинга.Загрузить(результатЗапроса[2].Выгрузить());
	Движения.КД_ВыполнениеСтандартаПрисутствия.Загрузить(результатЗапроса[3].Выгрузить());
	
КонецПроцедуры

Процедура ПередЗаписью(отказ, режимЗаписи, режимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Подразделение.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Запись невозможна без заполнения Подразделения.'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "Подразделение");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, объектКопирования);
	
КонецПроцедуры

#КонецОбласти