

&НаКлиенте
Процедура ТаблицаАссортиментовПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСоставСписка(Элемент.ТекущаяСтрока);
	
КонецПроцедуры

Процедура ОбновитьСоставСписка(Элемент)
	 ЭтаФорма.ОбъектАссортимент = Элемент;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСоставаАссортиментаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	ЗаписатьАссортимет(ЭтаФорма.ОбъектАссортимент,ПараметрыПеретаскивания.Значение);
	ЭтаФорма.ОтобразитьИзменениеДанных(ЭтаФорма.ОбъектАссортимент,ВидИзмененияДанных.Изменение);
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

Процедура ЗаписатьАссортимет(ОбъектАссортимент,МассивОбъектов)
	
	ТекОбъектАссортимент = ОбъектАссортимент.ПолучитьОбъект();
	ТабЧасть = ТекОбъектАссортимент.Состав;
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда
		Для Каждого Перетаскиваемое Из МассивОбъектов Цикл
			НайденныеСтроки = ТабЧасть.Найти(Перетаскиваемое,"Номенклатура");
			Если НайденныеСтроки = Неопределено Тогда
				НоваяСтрока = ТабЧасть.Добавить();
				НоваяСтрока.Номенклатура = Перетаскиваемое;
			КонецЕсли;
		КонецЦикла;
		
		ТекОбъектАссортимент.Записать();
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСоставаАссортиментаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСоставаАссортиментаПередУдалением(Элемент, Отказ)
	// Вставить содержимое обработчика.
	
КонецПроцедуры

Процедура УдалитьТекАссортимент(ТекСтрока)
	ТекОбъект =  ОбъектАссортимент.ПолучитьОбъект();
	ТекОбъект.Состав.Удалить(ТекСтрока);
	ТекОбъект.Записать();
КонецПроцедуры


&НаКлиенте
Процедура УдалитьАссортимент(Команда)
	ТекСтрока = ЭтаФорма.Элементы.ТаблицаСоставаАссортимента.ТекущаяСтрока;
	УдалитьТекАссортимент(ТекСтрока);
	ЭтаФорма.ОтобразитьИзменениеДанных(ЭтаФорма.ОбъектАссортимент,ВидИзмененияДанных.Изменение);
	ОбновитьСоставСписка(ОбъектАссортимент);
КонецПроцедуры



