Процедура ПриКомпоновкеРезультата(документРезультат, данныеРасшифровки, стандартнаяОбработка)

	документРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
   	документРезультат.АвтоМасштаб = Истина;
	
	стандартнаяОбработка = Ложь;
	
	массивЗаголовковРесурсов = Новый Массив;
	настройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	компоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	макетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, настройкиОтчета, данныеРасшифровки);

	//Создадим и инициализируем процессор компоновки, предварительно проверим параметры
	Если Не макетКомпоновки.ЗначенияПараметров.Найти("НачалоПериода") = Неопределено 
		И Не макетКомпоновки.ЗначенияПараметров.Найти("КонецПериода") = Неопределено 
		И Не макетКомпоновки.ЗначенияПараметров["НачалоПериода"].Значение = Дата(1,1,1)
		И Не макетКомпоновки.ЗначенияПараметров["КонецПериода"].Значение = Дата(1,1,1)
		И макетКомпоновки.ЗначенияПараметров["НачалоПериода"].Значение > макетКомпоновки.ЗначенияПараметров["КонецПериода"].Значение Тогда
		
		сообщение	 		= Новый СообщениеПользователю;
		сообщение.Текст	 	= "Дата начала периода не должна превышать дату окончания";
		сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;

	процессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	процессорКомпоновки.Инициализировать(макетКомпоновки, , данныеРасшифровки, Истина);

	//Создадим и инициализируем процессор вывода результата
	процессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	процессорВывода.УстановитьДокумент(документРезультат);

	//Обозначим начало вывода
	процессорВывода.НачатьВывод();
	таблицаЗафиксирована = Ложь;

	документРезультат.ФиксацияСверху = 0;
	//Основной цикл вывода отчета
	Пока Истина Цикл
		//Получим следующий элемент результата компоновки
		элементРезультата = ПроцессорКомпоновки.Следующий();

		Если элементРезультата = Неопределено Тогда
			//Следующий элемент не получен - заканчиваем цикл вывода
			Прервать;
		Иначе
			// Зафиксируем шапку
			Если  Не таблицаЗафиксирована 
				  И элементРезультата.ЗначенияПараметров.Количество() > 0 
				  И ТипЗнч(компоновщикНастроек.Настройки.Структура[0]) <> Тип("ДиаграммаКомпоновкиДанных") Тогда

				таблицаЗафиксирована = Истина;
				документРезультат.ФиксацияСверху = документРезультат.ВысотаТаблицы;

			КонецЕсли;
			//Элемент получен - выведем его при помощи процессора вывода
			процессорВывода.ВывестиЭлемент(элементРезультата);
			
		КонецЕсли;
		
	КонецЦикла;

	процессорВывода.ЗакончитьВывод();

КонецПроцедуры