
&НаКлиенте
// Процедура вызывает печать ТТН
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") И ПараметрКоманды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = ОткрытьФормуМодально("Обработка.ПечатьТТН.Форма", Новый Структура("Документ", ПараметрКоманды[0]));
	
	Если ТипЗНЧ(ПараметрыПечати) = Тип("Структура") Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.НалоговаяНакладная", "ТТН", ПараметрКоманды, ПараметрыВыполненияКоманды, ПараметрыПечати);
	КонецЕсли;
	
КонецПроцедуры
