Перем мФормаДокумента;
Перем мКолонкиСоставНабора;

Перем мКартинкаСерийныеНомера;

Перем ссылкаДок;
Перем СтруктураИсходныхПараметров;
//Перем мЕстьЦена;

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура проверки заполнения табличной части состав набора.
//
// Параметры:
//  СтруктураОбязательныхПолей - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                      - флаг проверки.
//  Заголовок                  - строка, заголовок сообщения об ошибке.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиСоставНабора(СтруктураОбязательныхПолей, Отказ, Заголовок)

//	МетаданныеРеквизиты = ЭтотОбъект.Метаданные().ТабличныеЧасти.СоставНабора.Реквизиты;

//	// Цикл по строкам табличной части.
//	Для каждого СтрокаТаблицы Из СоставНабора Цикл

//		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
//		                                """ табличной части ""Состав набора"": ";

//		// Цикл по проверяемым полям
//		Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

//			Значение = СтрокаТаблицы[КлючЗначение.Ключ];
//			Если НЕ ЗначениеЗаполнено(Значение) Тогда

//				Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
//					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
//					СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
//				Иначе
//					СтрокаСообщения = КлючЗначение.Значение;
//				КонецЕсли;
//				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);

//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиСоставНабора()

// Процедура сохраняет в документе состав набора.
//
Процедура ЗаписатьСоставНабораВДокумент()

	Объект.Документ.СоставНабора.Загрузить(Объект.СоставНабора.Выгрузить());

КонецПроцедуры // ЗаписатьСоставНабораВДокумент()

// Процедура устанавливает значения исходных параметров.
//
Процедура УстановитьЗначенияИсходныхПараметров()
	Перем ДоступностьКнСерийныеНомера;
	
	ЗаголовокФормы = Неопределено;
	мТолькоПросмотр = Неопределено;
	//СтруктураИсходныхПараметров.Свойство("Номенклатура",				Объект.Номенклатура);
	//СтруктураИсходныхПараметров.Свойство("Количество",					Объект.Количество);
	//СтруктураИсходныхПараметров.Свойство("ЕдиницаИзмерения",			Объект.ЕдиницаИзмерения);
	//СтруктураИсходныхПараметров.Свойство("ДокументОбъект",				Объект.Документ);
	//СтруктураИсходныхПараметров.Свойство("ФормаДокумента",				мФормаДокумента);
	//СтруктураИсходныхПараметров.Свойство("ИмяТабличнойЧасти",			Объект.ИмяТабличнойЧасти);
	//СтруктураИсходныхПараметров.Свойство("КлючСтроки",					Объект.КлючСтроки);
	//СтруктураИсходныхПараметров.Свойство("ЗаголовокФормы",				ЗаголовокФормы);
	//СтруктураИсходныхПараметров.Свойство("ТолькоПросмотр",				мТолькоПросмотр);
	//СтруктураИсходныхПараметров.Свойство("ДоступностьКнСерийныеНомера",	ДоступностьКнСерийныеНомера);
	
	//ЭлементыФормы.КоманднаяПанельТовары.Кнопки.СерийныеНомера.Доступность = ДоступностьКнСерийныеНомера = Неопределено;
	
	//Если ЗаголовокФормы <> Неопределено Тогда
	//	ЭтаФорма.Заголовок = ЗаголовокФормы;
	//	ЭлементыФормы.РамкаГруппыСоставНабора.Заголовок = ЗаголовокФормы;
	//КонецЕсли;

	//мТолькоПросмотр = ?(мТолькоПросмотр = Неопределено, Ложь, мТолькоПросмотр);

	//ТолькоПросмотр = мТолькоПросмотр;

КонецПроцедуры // УстановитьЗначенияИсходныхПараметров()

// Процедура устанавливает отбор табличной части по реквизиту "КлючСтроки".
//
Процедура УстановитьОтборТабЧасти()

	Элементы.СоставНабора.ОтборСтрок.КлючСтроки.Установить(Объект.КлючСтроки);

КонецПроцедуры // УстановитьОтборТабЧасти()

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

// Процедура - обработчик события "ПередОткрытием" формы.
//
//Текствопроса = Параметры.ТекстВопроса;
	СтруктураИсходныхПараметров = Параметры.СтруктураИсходныхПараметров;
	СтруктураИсходныхПараметров.Свойство("Номенклатура",				Объект.Номенклатура);
	СтруктураИсходныхПараметров.Свойство("Количество",					Объект.Количество);
	СтруктураИсходныхПараметров.Свойство("ЕдиницаИзмерения",			Объект.ЕдиницаИзмерения);
	СтруктураИсходныхПараметров.Свойство("ДокументОбъект",				ссылкаДок);
	СтруктураИсходныхПараметров.Свойство("ФормаДокумента",				мФормаДокумента);
	СтруктураИсходныхПараметров.Свойство("ИмяТабличнойЧасти",			Объект.ИмяТабличнойЧасти);
	СтруктураИсходныхПараметров.Свойство("КлючСтроки",					Объект.КлючСтроки);
	//СтруктураИсходныхПараметров.Свойство("ЗаголовокФормы",				ЗаголовокФормы);
	//СтруктураИсходныхПараметров.Свойство("ТолькоПросмотр",				мТолькоПросмотр);
	//СтруктураИсходныхПараметров.Свойство("ДоступностьКнСерийныеНомера",	ДоступностьКнСерийныеНомера);

//Объект.Документ = ссылкаДок.получитьОбъект();

//Объект.Документ = РеквизитФормыВЗначение("Объект.Документ", Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") );

	// Проверим тип реквизита формы СтруктураПараметровФормы. Должен быть "Структура".
	// При неверном типе не будем запускать подбор.
	//Если ТипЗнч(СтруктураИсходныхПараметров) <> Тип("Структура") Тогда
	//	Отказ = Истина;
	//	Предупреждение("Не верный тип параметра ""СтруктураИсходныхПараметров""!
	//	               |Данная обработка вызывается из других процедур конфигурации.
	//	               |Вручную ее вызывать запрещено."); 
	//	Возврат;
	//КонецЕсли;

	УстановитьЗначенияИсходныхПараметров();

	//Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
	//	Предупреждение("Не выбрана номенклатура!");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;

	Объект.СоставНабора.Загрузить(ссылкаДок.СоставНабора.Выгрузить());

КонецПроцедуры // ПередОткрытием()
&НаКлиенте

// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии()

//	КолонкиТабЧастиДокумента = мФормаДокумента.Элементы[Объект.ИмяТабличнойЧасти].Колонки;
//	НастройкаОтбораСтрок     = Элементы.СоставНабора.НастройкаОтбораСтрок;

//	//мЕстьЦена = (КолонкиТабЧастиДокумента.Найти("Цена") <> Неопределено);
//	Если ТипЗнч(ЭтаФорма.ВладелецФормы.ДокументОбъект)=Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") Тогда
//		
//		колПроцентСкидки = мКолонкиСоставНабора.Добавить("Р_ПроцентСкидки", "% скидки");
//		колПроцентСкидки.Данные = "Р_ПроцентСкидки";
//		колПроцентСкидки.УстановитьЭлементУправления(Тип("ПолеВвода"));
//		
//		Элементы.СоставНабора.Колонки.Номенклатура.ЭлементУправления.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
//	КонецЕсли;

//	
//	
//	
//	
//	
//	// Установим видимость и доступность колонок
//	Для каждого Колонка Из мКолонкиСоставНабора Цикл
//		Имя = Колонка.Имя;
//		//НАЧАЛО ВСТАВКИ компании "МЦТ"
//		//Автор: Василенко А.В. Дата: 11.06.2015 14:29:45
//		//Комментарий:
//		Если ТипЗнч(ЭтаФорма.ВладелецФормы.ДокументОбъект)=Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") Тогда
//			Если (Объект.ИмяТабличнойЧасти = "Бонусы" 
//				И Имя = "Р_ПроцентСкидки") Тогда 
//				Продолжить;
//			КонецЕсли;
//			Если Имя = "Всего" Тогда
//				Колонка.Видимость         = Ложь;
//				Колонка.ИзменятьВидимость = Ложь;
//				Колонка.Доступность       = Ложь;
//			КонецЕсли
//		КонецЕсли;
//		//КОНЕЦ ВСТАВКИ компании "МЦТ"
//		Если Имя = "НомерСтроки"
//		 ИЛИ Имя = "Номенклатура"
//		 ИЛИ Имя = "Количество"
//		 ИЛИ Имя = "Всего"
//		 ИЛИ Имя = "ЕдиницаИзмерения" Тогда
//			Продолжить;
//		КонецЕсли;

//		Если КолонкиТабЧастиДокумента.Найти(Имя) = Неопределено Тогда
//			Видимость         = Ложь;
//			ИзменятьВидимость = Ложь;
//			Доступность       = Ложь;
//		Иначе
//			Видимость         = КолонкиТабЧастиДокумента[Имя].Видимость;
//			ИзменятьВидимость = КолонкиТабЧастиДокумента[Имя].ИзменятьВидимость;
//			Доступность       = КолонкиТабЧастиДокумента[Имя].Доступность;
//		КонецЕсли;

//		Колонка.Видимость         = Видимость;
//		Колонка.ИзменятьВидимость = ИзменятьВидимость;
//		Колонка.Доступность       = Видимость;

//		Если Имя <> "Код"
//		   И Имя <> "Артикул"
//		   И Имя <> "Всего" Тогда
//			НастройкаОтбораСтрок[Имя].Доступность = ИзменятьВидимость;
//		КонецЕсли;
//	КонецЦикла;

//	УстановитьОтборТабЧасти();

//	//Если мЕстьЦена Тогда
//	//	ЭлементыФормы.ПанельСуммарнаяЦенаКомплекта.Свертка = РежимСверткиЭлементаУправления.Нет;
//	//Иначе
//		//ЭлементыФормы.ПанельСуммарнаяЦенаКомплекта.Свертка = РежимСверткиЭлементаУправления.Низ;
//	//КонецЕсли;

//	//РаботаСДиалогами.УстановитьДоступностьКнопкиСерийныеНомера(ЭлементыФормы.КоманднаяПанельТовары.Кнопки);

//КонецПроцедуры // ПриОткрытии()

//// Процедура - обработчик события "ПриПовторномОткрытии" формы.
////
//Процедура ПриПовторномОткрытии(СтандартнаяОбработка)

//	//Если ЭтаФорма.Модифицированность Тогда
//	//	Ответ = Вопрос("Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);

//	//	Если Ответ = КодВозвратаДиалога.Да Тогда
//			ЗаписатьСоставНабораВДокумент();
//	//	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
//	//		Возврат;
//	//	КонецЕсли;
//	//КонецЕсли;

//	ЭтаФорма.Модифицированность = Ложь;

//	УстановитьЗначенияИсходныхПараметров();

//	//Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
//	//	Предупреждение("Не выбрана номенклатура!");
//	//	Отказ = Истина;
//	//	Возврат;
//	//КонецЕсли;

//	УстановитьОтборТабЧасти();

КонецПроцедуры // ПриПовторномОткрытии()

// Процедура - обработчик события "ПередЗакрытием" формы.
//
//Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

//	//Если ЭтаФорма.Модифицированность Тогда
//	//	Ответ = Вопрос("Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);

//	//	Если Ответ = КодВозвратаДиалога.Да Тогда
//			ЗаписатьСоставНабораВДокумент();
//	//	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
//	//		Отказ = Истина;
//	//	КонецЕсли;
//	//КонецЕсли;

//КонецПроцедуры // ПередЗакрытием()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура вызывается при нажатии кнопки "СерийныеНомера" командной панели
// табличного поля "Товары".
//
Процедура КоманднаяПанельТоварыСерийныеНомера(Кнопка)
	
	//СтрокаТабличнойЧасти = ЭлементыФормы.СоставНабора.ТекущиеДанные;
	//Если СтрокаТабличнойЧасти = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ЗаписатьСоставНабораВДокумент();
	//
	//СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("Номенклатура", 				СтрокаТабличнойЧасти.Номенклатура);
	//СтруктураПараметров.Вставить("ХарактеристикаНоменклатуры", 	СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	//СтруктураПараметров.Вставить("СерияНоменклатуры", 			СтрокаТабличнойЧасти.СерияНоменклатуры);
	//СтруктураПараметров.Вставить("Количество", 					СтрокаТабличнойЧасти.Количество);
	//СтруктураПараметров.Вставить("ЕдиницаИзмерения", 			СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//СтруктураПараметров.Вставить("СозданиеНовыхСерийныхНомеров",Ложь);
	//СтруктураПараметров.Вставить("ДокументОбъект", 				Объект.Документ);
	//СтруктураПараметров.Вставить("ОбработкаСоставНабора", 		Объект);
	//СтруктураПараметров.Вставить("ИмяТабличнойЧасти", 			"СоставНабора");
	//СтруктураПараметров.Вставить("ИмяТабличнойЧастиСерийныеНомера", "СерийныеНомераСоставНабора");
	//СтруктураПараметров.Вставить("НомерСтрокиТабличнойЧасти", 	СтрокаТабличнойЧасти.НомерСтроки);
	//СтруктураПараметров.Вставить("ПараметрыСвязиСтрокТЧ", 		Объект.Документ.мПараметрыСвязиСтрокТЧ);
	//СтруктураПараметров.Вставить("СоставНабораСтрокаТабличнойЧасти", СтрокаТабличнойЧасти);
	//
	//// Открываем форму подбора.
	//ФормаВводСерийныхНомеров = Обработки.ВводСерийныхНомеров.ПолучитьФорму("ОсновнаяФорма", ЭтаФорма, ЭтаФорма);
	//ФормаВводСерийныхНомеров.СтруктураИсходныхПараметров = СтруктураПараметров;
	//ФормаВводСерийныхНомеров.Открыть();

КонецПроцедуры // КоманднаяПанельТоварыСерийныеНомера()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТЧ СОСТАВ НАБОРА

// Процедура - обработчик события "ПриВыводеСтроки" табличной части
//
Процедура СоставНабораПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)

	//Если мКолонкиСоставНабора.Всего.Видимость Тогда
	//	ТекКоличество = ?(ДанныеСтроки.ЕдиницаИзмерения.Коэффициент <> 0, ДанныеСтроки.Количество * Количество * ЕдиницаИзмерения.Коэффициент / ДанныеСтроки.ЕдиницаИзмерения.Коэффициент, 0);
	//	ОформлениеСтроки.Ячейки.Всего.УстановитьТекст(СокрЛ(Формат(ТекКоличество, "ЧЦ=15; ЧДЦ=3")));
	//КонецЕсли;

	//РаботаСДиалогами.ПоказатьКодАртикул(мКолонкиСоставНабора, ОформлениеСтроки.Ячейки, ДанныеСтроки.Номенклатура);
	////НАЧАЛО ВСТАВКИ компании "МЦТ"
	////Автор: Василенко А.В. Дата: 11.06.2015 15:11:17
	////Комментарий:
	//Если ТипЗнч(ЭтаФорма.ВладелецФормы.ДокументОбъект) = Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") Тогда
	//	//ОформлениеСтроки.Ячейки.Количество.ОтметкаНезаполненного = Ложь;
	//	Если ДанныеСтроки.Номенклатура.ЭтоГруппа Тогда 
	//		ОформлениеСтроки.Ячейки.ЕдиницаИзмерения.ОтметкаНезаполненного = Ложь;
	//		ОформлениеСтроки.Ячейки.ЕдиницаИзмерения.ТолькоПросмотр = Истина;
	//	КонецЕсли
	//КонецЕсли;
	//КОНЕЦ ВСТАВКИ компании "МЦТ"

КонецПроцедуры // СоставНабораПриВыводеСтроки()

// Процедура - обработчик события "ПриПолученииДанных" табличной части
//
Процедура СоставНабораПриПолученииДанных(Элемент, ОформленияСтрок)
	
	//НАЧАЛО ВСТАВКИ компании "МЦТ"
	//Автор: Василенко А.В. Дата: 11.06.2015 15:02:12
	//Комментарий:
	Если ТипЗнч(ЭтаФорма.ВладелецФормы.ДокументОбъект)=Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") Тогда
		Возврат;
	КонецЕсли;
	//КОНЕЦ ВСТАВКИ компании "МЦТ"

	//РаботаСДиалогами.УстановитьКартинкиВСтрокахТЧ(ОформленияСтрок, мКартинкаСерийныеНомера, Неопределено, Истина, Ложь);
	
КонецПроцедуры // СоставНабораПриПолученииДанных()

// Процедура - обработчик события "ПриНачалеРедактирования" табличной части
//
Процедура СоставНабораПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.КлючСтроки = Объект.КлючСтроки;
	КонецЕсли;

КонецПроцедуры // СоставНабораПриНачалеРедактирования()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура вызывается при нажатии кнопки "ОК" командной панели формы.
//
Процедура КнопкаОКНажатие(Кнопка)

	Отказ = Ложь;
	ТекстЗаголовка = "Проверка заполнения состава набора документа """ + СокрЛП(Объект.Документ) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("ЕдиницаИзмерения");
	//НАЧАЛО ВСТАВКИ компании "МЦТ"
	//Автор: Василенко А.В. Дата: 11.06.2015 14:29:45
	//Комментарий:
	Если ТипЗнч(ЭтаФорма.ВладелецФормы.ДокументОбъект)=Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") Тогда
		СтруктураОбязательныхПолей = Новый Структура("");
	КонецЕсли;
	//КОНЕЦ ВСТАВКИ
	
	ПроверитьЗаполнениеТабличнойЧастиСоставНабора(СтруктураОбязательныхПолей, Отказ, ТекстЗаголовка);
	
	Если НЕ Отказ Тогда
		ЗаписатьСоставНабораВДокумент();

		//Если мЕстьЦена Тогда
		//	ТекЦена = ПолучитьСуммарнуюЦенуКомплекта();
		//	Если ТекЦена <> 0 Тогда
		//		СтрокаТЧ = Документ[ИмяТабличнойЧасти].Найти(КлючСтроки, "КлючСтроки");
		//		Если СтрокаТЧ.Цена = 0 Тогда
		//			УстановитьЦенуКомплектаВДокументе(СтрокаТЧ, ТекЦена);
		//		ИначеЕсли СтрокаТЧ.Цена <> ТекЦена Тогда
		//			Ответ = Вопрос("Изменить цену в документе на суммарную цену комплекта?", РежимДиалогаВопрос.ДаНет);
		//			Если Ответ = КодВозвратаДиалога.Да Тогда
		//				УстановитьЦенуКомплектаВДокументе(СтрокаТЧ, ТекЦена);
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;

		ЭтаФорма.Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры // КнопкаОКНажатие()

// Обработчик события "ПриИзменении" реквизита "Номенклатура" в ТЧ "СоставНабора".
//
Процедура СоставНабораНоменклатураПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.СоставНабора.ТекущиеДанные;

	ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.ЕдиницаХраненияОстатков;

	ЗаполнитьЦенуКомплектующей(ТекущаяСтрока);

	//НАЧАЛО ВСТАВКИ компании "МЦТ"
	//Автор: Василенко А.В. Дата: 11.06.2015 16:35:44
	//Комментарий:
	
	Если ТипЗнч(ЭтаФорма.ВладелецФормы.ДокументОбъект)=Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") Тогда
		ТекущаяСтрока.Количество = 1;
	КонецЕсли
		
		//КОНЕЦ ВСТАВКИ компании "МЦТ"
	
КонецПроцедуры // СоставНабораНоменклатураПриИзменении()

// Процедура - обработчик события "ОбновлениеОтображения" формы.
//
Процедура ОбновлениеОтображения()

	//Если мЕстьЦена Тогда
	//	ЭлементыФормы.СуммарнаяЦенаКомплекта.Значение = ОбщегоНазначения.ФорматСумм(ПолучитьСуммарнуюЦенуКомплекта());
	//КонецЕсли;

КонецПроцедуры // ОбновлениеОтображения()

// Функция возвращается суммарную цену комплекта.
//
// Возвращаемое значение:
//  Число.
//
Функция ПолучитьСуммарнуюЦенуКомплекта()

	//ТекЦена = 0;

	//Выборка = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(СоставНабора, Новый Структура("КлючСтроки", КлючСтроки)).Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	ТекЦена = ТекЦена + Выборка.Количество * Выборка.Цена;
	//КонецЦикла;

	//Возврат ТекЦена;

КонецФункции // ПолучитьСуммарнуюЦенуКомплекта()

// Процедура устанавливает цену комплекта в переданную строку табличной части документа
// и вызывает пересчет сумм в этой строке табличной части.
//
// Параметры:
//  СтрокаТЧ - строка табличной части, в которой нужно установить цену.
//  ТекЦена - значение цены, которое нужно установить.
//
Процедура УстановитьЦенуКомплектаВДокументе(СтрокаТЧ, ТекЦена)

	СтрокаТЧ.Цена = ТекЦена;
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТЧ, Объект.Документ);

	Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СтавкаНДС", Объект.Документ.Метаданные(), Объект.ИмяТабличнойЧасти) Тогда
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, Объект.Документ);
	КонецЕсли;

КонецПроцедуры // УстановитьЦенуКомплектаВДокументе()

// Процедура при необходимости заполняет цену комплектующей в переданной строке табличной части.
//
// Параметры:
//  ТекущаяСтрока - строка табличной части, в которой необходимо заполнить цену.
//
Процедура ЗаполнитьЦенуКомплектующей(ТекущаяСтрока)

	//Если мЕстьЦена Тогда
	//	ОбработкаТабличныхЧастей.ЗаполнитьЦенуПродажиТабЧасти(ТекущаяСтрока, Документ, глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	//КонецЕсли;

КонецПроцедуры // ЗаполнитьЦенуКомплектующей()

// Обработчик события "ПриИзменении" реквизита "ХарактеристикаНоменклатуры" в ТЧ "СоставНабора".
//
Процедура СоставНабораХарактеристикаНоменклатурыПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.СоставНабора.ТекущиеДанные;

	ЗаполнитьЦенуКомплектующей(ТекущаяСтрока);

КонецПроцедуры // СоставНабораХарактеристикаНоменклатурыПриИзменении()

Процедура СоставНабораСчетУчетаБУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	//СтандартнаяОбработка = РаботаСДиалогами.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	//Если ЭтаФорма.Модифицированность Тогда
	//	Ответ = Вопрос("Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);

	//	Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаписатьСоставНабораВДокумент();
	//	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;

КонецПроцедуры



//НАЧАЛО ВСТАВКИ компании "МЦТ"
//Автор: Василенко А.В. Дата: 11.06.2015 14:55:03
//Комментарий:

//Процедура Р_ПриОткрытии()
//	
//	ПриОткрытии();
//	
//	Если ТипЗнч(ЭтаФорма.ВладелецФормы.ДокументОбъект)=Тип("ДокументОбъект.УстановкаСкидокНоменклатуры") Тогда
//		
//		колПроцентСкидки = мКолонкиСоставНабора.Добавить("Р_ПроцентСкидки", "% скидки");
//		колПроцентСкидки.Данные = "Р_ПроцентСкидки";
//		колПроцентСкидки.УстановитьЭлементУправления(Тип("ПолеВвода"));
//		
//		ЭлементыФормы.СоставНабора.Колонки.Номенклатура.ЭлементУправления.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
//	КонецЕсли
//	
//КонецПроцедуры

//ЭтаФорма.УстановитьДействие("ПриОткрытии", Новый Действие("Р_ПриОткрытии"));


//КОНЕЦ ВСТАВКИ компании "МЦТ"

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мКолонкиСоставНабора = Элементы.СоставНабора.ПодчиненныеЭлементы;//Элементы.СоставНабора.Колонки;
//Новый Структура("СтруктураИсходныхПараметров", СтруктураПараметров)
