&НаСервере
процедура НаСервере()
	
	//ПланыОбмена.УдалитьРегистрациюИзменений(ПланыОбмена.ОбменУправлениеТорговлейБухгалтерия.НайтиПоКоду("001"));
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	НаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьИзмененияСервер()
	
	//Узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерия.НайтиПоКоду("001");
	
	
	тз.Очистить();
	
	
	Выборка = ПланыОбмена.ВыбратьИзменения(Узел, Узел.НомерОтправленного);
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Объект = СокрЛП(Выборка.Получить());
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьИзменения(Команда)
	ПрочитатьИзмененияСервер();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьСервер()
	
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		//Узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерия.НайтиПоКоду("001");
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		|	И РасходнаяНакладная.Организация.ЕстьНДС = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратОтПокупателя.Ссылка
		|ИЗ
		|	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
		|ГДЕ
		|	ВозвратОтПокупателя.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И ВозвратОтПокупателя.Проведен = ИСТИНА
		|	И ВозвратОтПокупателя.Организация.ЕстьНДС = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НалоговаяНакладная.Ссылка
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И НалоговаяНакладная.ПометкаУдаления = ЛОЖЬ
		|	И НалоговаяНакладная.Организация.ЕстьНДС = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Приложение2КНалоговойНакладной.Ссылка
		|ИЗ
		|	Документ.Приложение2КНалоговойНакладной КАК Приложение2КНалоговойНакладной
		|ГДЕ
		|	Приложение2КНалоговойНакладной.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И Приложение2КНалоговойНакладной.ПометкаУдаления = ЛОЖЬ
		|	И Приложение2КНалоговойНакладной.Организация.ЕстьНДС = ИСТИНА");
		
		
		//////Запрос.УстановитьПараметр("ПериодНачало", НачалоДня(Объект.ПериодМесяц));
		//////Запрос.УстановитьПараметр("ПериодОкончание", КонецМесяца(Объект.ПериодМесяц));
		Запрос.УстановитьПараметр("ПериодНачало", 		Объект.ДатаНачала);
		Запрос.УстановитьПараметр("ПериодОкончание", 	Объект.ДатаОкончания);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Ссылка = Объект.Пропустить Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.Контрагент) И НЕ(Выборка.Ссылка.Контрагент = Объект.Контрагент)Тогда
				Продолжить;
			КонецЕсли;
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Ссылка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВыполнитьНачальнуюВыгрузку Тогда
		
		// только справочники....
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&Ассортимент)");
		
		Ассортимент = Новый Массив;
		Для Каждого СтрокаСостава Из Узел.Ассортимент.Состав Цикл
			Ассортимент.Добавить(СтрокаСостава.НоменклатурнаяГруппа);
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Ассортимент", Ассортимент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		а=0;
		Пока Выборка.Следующий() Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Ссылка);
			
			//а=а+1;
			//Если а>=10 Тогда
			//	Прервать;
			//КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	ЗарегистрироватьСервер();
КонецПроцедуры

&НаСервере
Процедура УстановитьНомераСообщенийСервер()
	
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.НомерПринятого = НомерПринятого;
	УзелОбъект.НомерОтправленного = НомерОтправленого;
	УзелОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНомераСообщений(Команда)
	
	УстановитьНомераСообщенийСервер();
	
КонецПроцедуры

&НаСервере
Процедура УзелПриИзмененииСервер()
	
	НомерПринятого = Узел.НомерПринятого;
	НомерОтправленого = Узел.НомерОтправленного;
	
КонецПроцедуры

&НаКлиенте
Процедура УзелПриИзменении(Элемент)
	
	УзелПриИзмененииСервер();
	
КонецПроцедуры
