
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	стПараметрыФормы = Новый Структура("СформироватьПриОткрытии,Отбор,КлючВарианта,КлючНазначенияИспользования");
	стПараметрыФормы.СформироватьПриОткрытии = Истина;
	
	Документ = ПараметрыВыполненияКоманды.Источник.Объект;
	
	стПараметрыФормы.Отбор = Новый Структура("Контрагент,Подразделение,Менеджер", Документ.Контрагент, Документ.Подразделение, Документ.Менеджер);
	стПараметрыФормы.КлючВарианта = "ВедомостьПоМенеджерам";
	стПараметрыФормы.КлючНазначенияИспользования = "КпкЗаявка";
	
	ОткрытьФорму("Отчет.ВзаиморасчетыСПокупателями.Форма", стПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
