Функция ПолучитьКатегоризациюТочки(Объект) Экспорт
	
	мРезультат = Новый Массив;
	
	мСтруктураСтроки = Новый Структура("Подразделение, ТорговаяТочка, ГруппаПодукции, КатегорияТТ, ДлинаВитрины, КоличествоSKU, МВ, ТВ, ТСВ");
	
	// пока понятно только по МКИ
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
		
	#КонецОбласти 
	
	
	
КонецФункции	// ПолучитьКатегоризациюТочки()

Функция ПолучитьСтруктуруТорговойТочки(идентификатор) Экспорт
	
	результат = Новый Структура("Подразделение, Контрагент, Менеджер, ТипЦен,ГруппаПродукта",
		Справочники.СтруктурныеЕдиницы.ПустаяСсылка(),
		Справочники.Контрагенты.ПустаяСсылка(),
		Справочники.Менеджеры.ПустаяСсылка(),
		Справочники.ТипыЦен.ПустаяСсылка(),
		Справочники.КД_ГруппыНоменклатуры.ПустаяСсылка());
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтрагентыМенеджеры.Ссылка.Родитель.Подразделение КАК Подразделение,
	|	КонтрагентыМенеджеры.Ссылка КАК Контрагент,
	|	КонтрагентыМенеджеры.Менеджер,
	|	КонтрагентыМенеджеры.ТипЦен,
	|	КонтрагентыМенеджеры.ГруппаПродукта
	|ИЗ
	|	Справочник.Контрагенты.Менеджеры КАК КонтрагентыМенеджеры
	|ГДЕ
	|	КонтрагентыМенеджеры.ИД = &ИД";
		
	#КонецОбласти
	
	запрос.УстановитьПараметр("ИД", идентификатор);
	
	результатЗапроса = запрос.Выполнить();
	
	Если Не результатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(результат, результатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции	// ПолучитьСтруктуруТорговойТочки()

// Функция - Определить категорию торговой точки
//
// Параметры:
//  объект		 		 - СправочникСсылка.Контрагенты, ДанныеФормыСтруктура - Ссылка или данные формы, для которого будет получена категория
//  период		 		 - дата	 - дата среза
//  подразделение		 - 	 - 
//  группаПродукта		 - 	 - 
//  количествоSKU		 - число	 - 
//  твердыйСырВесовойSKU - число	 - 
//  маслоВесовоеSKU		 - число	 - 
//  творогВесовойSKU	 - число	 - 
// 
// Возвращаемое значение:
//   Структура - содержит свойства торговой точки:
//		ГруппаПродукции
//		КаналСбыта
//		КатегорияТТ
//		КатегорияТТИзКарточки
//		КоличествоSKU
//		КоличествоSKUПорог
//		Подразделение - СправочникСсылка.СтруктурныеЕдиницы - подразделение для которого получена категория торговой точки
//		ПодразделениеИзКарточки
//		ТипСтандарта
//		ТорговаяТочка
//		МинимальнаяДлинаВитрины
//		
//
Функция ОпределитьКатегориюТорговойТочки(объект, период, подразделение, группаПродукта, количествоSKU=0, твердыйСырВесовойSKU=0, маслоВесовоеSKU=0, творогВесовойSKU=0) Экспорт
	
	результат = Новый Структура(
	"ГруппаПродукции,
	|	КаналСбыта,
	|	КатегорияТТ,
	|	КатегорияТТИзКарточки,
	|	КоличествоSKU,
	|	КоличествоSKUПорог,
	|	Подразделение,
	|	ПодразделениеИзКарточки,
	|	ТипСтандарта,
	|	ТорговаяТочка,
	|	МинимальнаяДлинаВитрины,
	|	КатегорийнаяГруппа,
	|	ДлинаВитриныИзКарточки");
	
	запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	&Подразделение,
	|	Контрагенты.Ссылка КАК Контрагент,
	|	&Период КАК Дата,
	|	&ГрпуппаПродукта КАК ГруппаПродукта,
	|	ВЫРАЗИТЬ(&КоличествоSKU КАК ЧИСЛО(10, 0)) КАК ОбщSKU,
	|	Контрагенты.КД_КаналСбыта КАК КаналСбыта,
	|	Контрагенты.КД_ТипСтандартаПрисутствия КАК ТипСтандарта
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КД_КатегорииТорговыхТочек.Подразделение,
	|	КД_КатегорииТорговыхТочек.ТорговаяТочка,
	|	КД_КатегорииТорговыхТочек.ГруппаПродукции,
	|	КД_КатегорииТорговыхТочек.КатегорияТТ,
	|	КД_КатегорииТорговыхТочек.Период КАК ДатаНачала,
	|	МИНИМУМ(КОНЕЦПЕРИОДА(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(КД_КатегорииТорговыхТочек1.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(2999, 12, 31, 0, 0, 0)), ДЕНЬ)) КАК ДатаОкончания,
	|	КД_КатегорииТорговыхТочек.КатегорияТТ.Родитель КАК КатегорийнаяГруппа,
	|	КД_КатегорииТорговыхТочек.ДлинаВитрины
	|ПОМЕСТИТЬ ВТ_КатегорииТТПоПериодам
	|ИЗ
	|	РегистрСведений.КД_КатегорииТорговыхТочек КАК КД_КатегорииТорговыхТочек
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегорииТорговыхТочек КАК КД_КатегорииТорговыхТочек1
	|		ПО КД_КатегорииТорговыхТочек.Подразделение = КД_КатегорииТорговыхТочек1.Подразделение
	|			И КД_КатегорииТорговыхТочек.ГруппаПродукции = КД_КатегорииТорговыхТочек1.ГруппаПродукции
	|			И КД_КатегорииТорговыхТочек.ТорговаяТочка = КД_КатегорииТорговыхТочек1.ТорговаяТочка
	|			И КД_КатегорииТорговыхТочек.Период < КД_КатегорииТорговыхТочек1.Период
	|ГДЕ
	|	КД_КатегорииТорговыхТочек.ТорговаяТочка В
	|			(ВЫБРАТЬ
	|				ВТ_ИсходныеДанные.Контрагент
	|			ИЗ
	|				ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|			СГРУППИРОВАТЬ ПО
	|				ВТ_ИсходныеДанные.Контрагент)
	|
	|СГРУППИРОВАТЬ ПО
	|	КД_КатегорииТорговыхТочек.Подразделение,
	|	КД_КатегорииТорговыхТочек.КатегорияТТ,
	|	КД_КатегорииТорговыхТочек.ГруппаПродукции,
	|	КД_КатегорииТорговыхТочек.ТорговаяТочка,
	|	КД_КатегорииТорговыхТочек.Период,
	|	КД_КатегорииТорговыхТочек.ДлинаВитрины,
	|	КД_КатегорииТорговыхТочек.КатегорияТТ.Родитель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КД_КатегорииТорговыхТочек.Подразделение,
	|	КД_КатегорииТорговыхТочек.КатегорияТТ,
	|	КД_КатегорииТорговыхТочек.ГруппаПродукции,
	|	КД_КатегорииТорговыхТочек.ТорговаяТочка,
	|	ДатаНачала,
	|	ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.Подразделение КАК Подразделение,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.ГруппаПродукции КАК ГруппаПродукции,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.КаналСбыта КАК КаналСбыта,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.ТипСтандарта КАК ТипСтандарта,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.КатегорияТТ,
	|	МАКСИМУМ(ЕСТЬNULL(КД_КатегоризацияТорговыхТочекСрезПоследних1.КоличествоSKUПорог, 0)) КАК ПорогНачало,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.КоличествоSKUПорог КАК ПорогОкончание,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.МинимальнаяДлинаВитрины
	|ПОМЕСТИТЬ ВТ_КатегоризацияТТПоПорогам
	|ИЗ
	|	РегистрСведений.КД_КатегоризацияТорговыхТочек.СрезПоследних(
	|			&Период,
	|			Подразделение В
	|				(ВЫБРАТЬ
	|					ВТ_ИсходныеДанные.Подразделение
	|				ИЗ
	|					ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|				СГРУППИРОВАТЬ ПО
	|					ВТ_ИсходныеДанные.Подразделение)) КАК КД_КатегоризацияТорговыхТочекСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегоризацияТорговыхТочек.СрезПоследних КАК КД_КатегоризацияТорговыхТочекСрезПоследних1
	|		ПО КД_КатегоризацияТорговыхТочекСрезПоследних.Подразделение = КД_КатегоризацияТорговыхТочекСрезПоследних1.Подразделение
	|			И КД_КатегоризацияТорговыхТочекСрезПоследних.ГруппаПродукции = КД_КатегоризацияТорговыхТочекСрезПоследних1.ГруппаПродукции
	|			И КД_КатегоризацияТорговыхТочекСрезПоследних.КаналСбыта = КД_КатегоризацияТорговыхТочекСрезПоследних1.КаналСбыта
	|			И КД_КатегоризацияТорговыхТочекСрезПоследних.ТипСтандарта = КД_КатегоризацияТорговыхТочекСрезПоследних1.ТипСтандарта
	|			И КД_КатегоризацияТорговыхТочекСрезПоследних.КоличествоSKUПорог > КД_КатегоризацияТорговыхТочекСрезПоследних1.КоличествоSKUПорог
	|
	|СГРУППИРОВАТЬ ПО
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.ГруппаПродукции,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.Подразделение,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.КаналСбыта,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.КатегорияТТ,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.ТипСтандарта,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.КоличествоSKUПорог,
	|	КД_КатегоризацияТорговыхТочекСрезПоследних.МинимальнаяДлинаВитрины
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Подразделение,
	|	ГруппаПродукции,
	|	КаналСбыта,
	|	ТипСтандарта,
	|	ПорогНачало,
	|	ПорогОкончание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Контрагент КАК ТорговаяТочка,
	|	ВТ_ИсходныеДанные.Подразделение,
	|	ВТ_ИсходныеДанные.ГруппаПродукта,
	|	ВТ_ИсходныеДанные.КаналСбыта,
	|	ВТ_ИсходныеДанные.ТипСтандарта,
	|	ВТ_КатегоризацияТТПоПорогам.КатегорияТТ,
	|	ВТ_КатегоризацияТТПоПорогам.МинимальнаяДлинаВитрины,
	|	ВТ_КатегоризацияТТПоПорогам.ПорогНачало,
	|	ВТ_КатегоризацияТТПоПорогам.ПорогОкончание,
	|	ВТ_КатегорииТТПоПериодам.КатегорийнаяГруппа,
	|	ВТ_КатегорииТТПоПериодам.Подразделение КАК ПодразделениеИзКарточки,
	|	ВТ_КатегорииТТПоПериодам.КатегорияТТ КАК КатегорияТТИзКарточки,
	|	ВТ_КатегорииТТПоПериодам.ДлинаВитрины КАК ДлинаВитриныИзкарточки,
	|	ВТ_КатегорииТТПоПериодам.ДатаНачала,
	|	ВТ_КатегорииТТПоПериодам.ДатаОкончания
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КатегоризацияТТПоПорогам КАК ВТ_КатегоризацияТТПоПорогам
	|		ПО ВТ_ИсходныеДанные.Подразделение = ВТ_КатегоризацияТТПоПорогам.Подразделение
	|			И ВТ_ИсходныеДанные.ГруппаПродукта = ВТ_КатегоризацияТТПоПорогам.ГруппаПродукции
	|			И ВТ_ИсходныеДанные.КаналСбыта = ВТ_КатегоризацияТТПоПорогам.КаналСбыта
	|			И ВТ_ИсходныеДанные.ТипСтандарта = ВТ_КатегоризацияТТПоПорогам.ТипСтандарта
	|			И ВТ_ИсходныеДанные.ОбщSKU > ВТ_КатегоризацияТТПоПорогам.ПорогНачало
	|			И ВТ_ИсходныеДанные.ОбщSKU <= ВТ_КатегоризацияТТПоПорогам.ПорогОкончание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КатегорииТТПоПериодам КАК ВТ_КатегорииТТПоПериодам
	|		ПО ВТ_ИсходныеДанные.Подразделение = ВТ_КатегорииТТПоПериодам.Подразделение
	|			И ВТ_ИсходныеДанные.Контрагент = ВТ_КатегорииТТПоПериодам.ТорговаяТочка
	|			И ВТ_ИсходныеДанные.ГруппаПродукта = ВТ_КатегорииТТПоПериодам.ГруппаПродукции
	|			И ВТ_ИсходныеДанные.Дата >= ВТ_КатегорииТТПоПериодам.ДатаНачала
	|			И ВТ_ИсходныеДанные.Дата <= ВТ_КатегорииТТПоПериодам.ДатаОкончания";
		
	#КонецОбласти
	
	запрос.УстановитьПараметр("Контрагент", объект);
	запрос.УстановитьПараметр("Период", период);
	запрос.УстановитьПараметр("Подразделение", подразделение);
	запрос.УстановитьПараметр("ГрпуппаПродукта", группаПродукта);
	запрос.УстановитьПараметр("КоличествоSKU", количествоSKU);
	
	результатЗапроса = запрос.Выполнить();
	
	#Область ПолучениеВременныхТаблиц
	
	запрос.Текст =
	"ВЫБРАТЬ * ИЗ ВТ_ИсходныеДанные;
	|ВЫБРАТЬ * ИЗ ВТ_КатегорииТТПоПериодам;
	|ВЫБРАТЬ * ИЗ ВТ_КатегоризацияТТПоПорогам";
	
	#КонецОбласти
	
	Если Не результатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(результат, результатЗапроса.Выгрузить().Получить(0));
	КонецЕсли;
	
	Возврат результат
	
КонецФункции	// ОпределитьКатегориюТорговойТочки()

Функция ДобавитьЗапросСвойствТорговойТочки(менеджерВременныхТаблиц) Экспорт
	
	запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = менеджерВременныхТаблиц;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.ТорговаяТочка,
	|	ВложенныйЗапрос.ГруппаПродукта,
	|	ВложенныйЗапрос.КаналСбыта,
	|	ВложенныйЗапрос.ТипСтандарта,
	|	ВложенныйЗапрос.ПериодКатегоризацияТорговыхТочек,
	|	ВложенныйЗапрос.ПериодКатегорииТорговыхТочек,
	|	КД_КатегорииТорговыхТочек.КатегорияТТ КАК КатегорияТТИзСправочника,
	|	КД_КатегорииТорговыхТочек.ДлинаВитрины КАК ДлинаВитриныИзСправочника,
	|	КД_КатегорииТорговыхТочек.КоличествоSKU КАК КоличествоSKUИзСправочника,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ОбщееКоличествоSKU = 0
	|			ТОГДА КД_КатегорииТорговыхТочек.КоличествоSKU
	|		ИНАЧЕ ВложенныйЗапрос.ОбщееКоличествоSKU
	|	КОНЕЦ КАК ОбщееКоличествоSKU
	|ПОМЕСТИТЬ ВТ_КарточкаТорговойТочкиПоГруппеПродукта
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ГруппыПродукта.Период КАК Период,
	|		ВТ_ГруппыПродукта.Подразделение КАК Подразделение,
	|		ВТ_ГруппыПродукта.ТорговаяТочка КАК ТорговаяТочка,
	|		ВТ_ГруппыПродукта.ГруппаПродукта КАК ГруппаПродукта,
	|		ВТ_ГруппыПродукта.КаналСбыта КАК КаналСбыта,
	|		ВТ_ГруппыПродукта.ТипСтандарта КАК ТипСтандарта,
	|		МАКСИМУМ(КД_КатегоризацияТорговыхТочек.Период) КАК ПериодКатегоризацияТорговыхТочек,
	|		МАКСИМУМ(КД_КатегорииТорговыхТочек.Период) КАК ПериодКатегорииТорговыхТочек,
	|		ВТ_ГруппыПродукта.ОбщееКоличествоSKU КАК ОбщееКоличествоSKU
	|	ИЗ
	|		ВТ_ГруппыПродукта КАК ВТ_ГруппыПродукта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегорииТорговыхТочек КАК КД_КатегорииТорговыхТочек
	|			ПО ВТ_ГруппыПродукта.Подразделение = КД_КатегорииТорговыхТочек.Подразделение
	|				И ВТ_ГруппыПродукта.ГруппаПродукта = КД_КатегорииТорговыхТочек.ГруппаПродукции
	|				И ВТ_ГруппыПродукта.ТорговаяТочка = КД_КатегорииТорговыхТочек.ТорговаяТочка
	|				И ВТ_ГруппыПродукта.Период >= КД_КатегорииТорговыхТочек.Период
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегоризацияТорговыхТочек КАК КД_КатегоризацияТорговыхТочек
	|			ПО ВТ_ГруппыПродукта.Подразделение = КД_КатегоризацияТорговыхТочек.Подразделение
	|				И ВТ_ГруппыПродукта.ГруппаПродукта = КД_КатегоризацияТорговыхТочек.ГруппаПродукции
	|				И ВТ_ГруппыПродукта.КаналСбыта = КД_КатегоризацияТорговыхТочек.КаналСбыта
	|				И ВТ_ГруппыПродукта.ТипСтандарта = КД_КатегоризацияТорговыхТочек.ТипСтандарта
	|				И ВТ_ГруппыПродукта.Период >= КД_КатегоризацияТорговыхТочек.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ГруппыПродукта.Период,
	|		ВТ_ГруппыПродукта.Подразделение,
	|		ВТ_ГруппыПродукта.ТорговаяТочка,
	|		ВТ_ГруппыПродукта.ГруппаПродукта,
	|		ВТ_ГруппыПродукта.КаналСбыта,
	|		ВТ_ГруппыПродукта.ТипСтандарта,
	|		ВТ_ГруппыПродукта.ОбщееКоличествоSKU) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегорииТорговыхТочек КАК КД_КатегорииТорговыхТочек
	|		ПО ВложенныйЗапрос.Подразделение = КД_КатегорииТорговыхТочек.Подразделение
	|			И ВложенныйЗапрос.ТорговаяТочка = КД_КатегорииТорговыхТочек.ТорговаяТочка
	|			И ВложенныйЗапрос.ГруппаПродукта = КД_КатегорииТорговыхТочек.ГруппаПродукции
	|			И ВложенныйЗапрос.ПериодКатегорииТорговыхТочек = КД_КатегорииТорговыхТочек.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.ТорговаяТочка,
	|	ВложенныйЗапрос.ГруппаПродукта,
	|	ВложенныйЗапрос.КаналСбыта,
	|	ВложенныйЗапрос.ТипСтандарта,
	|	ВложенныйЗапрос.ПериодКатегоризацияТорговыхТочек,
	|	ВложенныйЗапрос.ПериодКатегорииТорговыхТочек,
	|	КД_КатегорииТорговыхТочек.КатегорияТТ,
	|	КД_КатегорииТорговыхТочек.ДлинаВитрины,
	|	КД_КатегорииТорговыхТочек.КоличествоSKU,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ОбщееКоличествоSKU = 0
	|			ТОГДА КД_КатегорииТорговыхТочек.КоличествоSKU
	|		ИНАЧЕ ВложенныйЗапрос.ОбщееКоличествоSKU
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.ТорговаяТочка,
	|	ВложенныйЗапрос.ГруппаПродукта,
	|	ВложенныйЗапрос.КаналСбыта,
	|	ВложенныйЗапрос.ТипСтандарта,
	|	ВложенныйЗапрос.ПериодКатегоризацияТорговыхТочек,
	|	ВложенныйЗапрос.ПериодКатегорииТорговыхТочек,
	|	ВложенныйЗапрос.КатегорияТТИзСправочника,
	|	ВложенныйЗапрос.ДлинаВитриныИзСправочника,
	|	ВложенныйЗапрос.КоличествоSKUИзСправочника,
	|	ВложенныйЗапрос.ОбщееКоличествоSKU,
	|	ВложенныйЗапрос.КоличествоSKUПорог,
	|	КД_КатегоризацияТорговыхТочек.КатегорияТТ,
	|	КД_КатегоризацияТорговыхТочек.МинимальнаяДлинаВитрины КАК ДлинаВитриныМинимальная,
	|	КД_КатегоризацияТорговыхТочек.КатегорияТТ.Родитель КАК КатегорийнаяГруппа
	|ПОМЕСТИТЬ ВТ_СвойстваТорговойТочкиПоГруппеПродукта
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.Период КАК Период,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.Подразделение КАК Подразделение,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ТорговаяТочка КАК ТорговаяТочка,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ГруппаПродукта КАК ГруппаПродукта,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.КаналСбыта КАК КаналСбыта,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ТипСтандарта КАК ТипСтандарта,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ПериодКатегоризацияТорговыхТочек КАК ПериодКатегоризацияТорговыхТочек,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ПериодКатегорииТорговыхТочек КАК ПериодКатегорииТорговыхТочек,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.КатегорияТТИзСправочника КАК КатегорияТТИзСправочника,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ДлинаВитриныИзСправочника КАК ДлинаВитриныИзСправочника,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.КоличествоSKUИзСправочника КАК КоличествоSKUИзСправочника,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ОбщееКоличествоSKU КАК ОбщееКоличествоSKU,
	|		МИНИМУМ(КД_КатегоризацияТорговыхТочек.КоличествоSKU) КАК КоличествоSKUПорог
	|	ИЗ
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта КАК ВТ_КарточкаТорговойТочкиПоГруппеПродукта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегоризацияТорговыхТочек КАК КД_КатегоризацияТорговыхТочек
	|			ПО ВТ_КарточкаТорговойТочкиПоГруппеПродукта.Подразделение = КД_КатегоризацияТорговыхТочек.Подразделение
	|				И ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ГруппаПродукта = КД_КатегоризацияТорговыхТочек.ГруппаПродукции
	|				И ВТ_КарточкаТорговойТочкиПоГруппеПродукта.КаналСбыта = КД_КатегоризацияТорговыхТочек.КаналСбыта
	|				И ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ТипСтандарта = КД_КатегоризацияТорговыхТочек.ТипСтандарта
	|				И ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ПериодКатегоризацияТорговыхТочек = КД_КатегоризацияТорговыхТочек.Период
	|				И ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ОбщееКоличествоSKU <= КД_КатегоризацияТорговыхТочек.КоличествоSKU
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.Период,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.Подразделение,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ТорговаяТочка,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ГруппаПродукта,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.КаналСбыта,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ТипСтандарта,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ПериодКатегоризацияТорговыхТочек,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ПериодКатегорииТорговыхТочек,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.КатегорияТТИзСправочника,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ДлинаВитриныИзСправочника,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.КоличествоSKUИзСправочника,
	|		ВТ_КарточкаТорговойТочкиПоГруппеПродукта.ОбщееКоличествоSKU) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегоризацияТорговыхТочек КАК КД_КатегоризацияТорговыхТочек
	|		ПО ВложенныйЗапрос.Подразделение = КД_КатегоризацияТорговыхТочек.Подразделение
	|			И ВложенныйЗапрос.ГруппаПродукта = КД_КатегоризацияТорговыхТочек.ГруппаПродукции
	|			И ВложенныйЗапрос.КаналСбыта = КД_КатегоризацияТорговыхТочек.КаналСбыта
	|			И ВложенныйЗапрос.ТипСтандарта = КД_КатегоризацияТорговыхТочек.ТипСтандарта
	|			И ВложенныйЗапрос.ПериодКатегоризацияТорговыхТочек = КД_КатегоризацияТорговыхТочек.Период
	|			И ВложенныйЗапрос.КоличествоSKUПорог = КД_КатегоризацияТорговыхТочек.КоличествоSKU";
		
	#КонецОбласти 
	
	результатЗапроса = запрос.Выполнить();
	
	#Область ПолучениеВиртуальныхТаблица
	
	запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_ГруппыПродукта";
	запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_КарточкаТорговойТочкиПоГруппеПродукта";
	запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_СвойстваТорговойТочкиПоГруппеПродукта";
		
	#КонецОбласти 
	
	Возврат Не результатЗапроса.Пустой();
	
КонецФункции	// ДобавитьЗапросСвойствТорговойТочки()