#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(отказ, режимПроведения)
	
	// ВЗАИМОРАСЧЕТЫ
	ВзаиморасчетыСПокупателями = ЭтотОбъект.Движения.ВзаиморасчетыСПокупателями;
	ВзаиморасчетыСПоставщиками = ЭтотОбъект.Движения.ВзаиморасчетыСПоставщиками;
	
	Для Каждого СтрокиТаблицы Из ЭтотОбъект.Покупатель Цикл
	
		Движение = ВзаиморасчетыСПокупателями.Добавить();
		
		Движение.Период 		= ЭтотОбъект.Дата;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Контрагент		= СтрокиТаблицы.Контрагент;
		Движение.Подразделение	= Подразделение;
		Движение.Менеджер		= СтрокиТаблицы.Менеджер;
		
		Движение.КредитныйДокумент = СтрокиТаблицы.КредитныйДокумент;
		Движение.Сумма 			= СтрокиТаблицы.Сумма;
	
	КонецЦикла;
	
	Для Каждого СтрокиТаблицы Из ЭтотОбъект.Поставщик Цикл
	
		Движение = ВзаиморасчетыСПоставщиками.Добавить();
		
		Движение.Период 		= ЭтотОбъект.Дата;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Контрагент		= СтрокиТаблицы.Контрагент;
		Движение.Подразделение	= Подразделение;
		Движение.Сумма 			= СтрокиТаблицы.Сумма;
	
	КонецЦикла;
	
	
	
	ВзаиморасчетыСПокупателями.Записать();
	ВзаиморасчетыСПоставщиками.Записать();

КонецПроцедуры

Процедура ПередЗаписью(отказ, режимЗаписи, режимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Подразделение.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Запись невозможна без заполнения Подразделения.'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "Подразделение");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

#КонецОбласти 