
#Область ОбработчикиСобытий

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, объектКопирования);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(данныеЗаполнения, стандартнаяОбработка)
	
	заполненНаОснованииДокумента = Ложь;

	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеНовогоДокумента(ЭтотОбъект, данныеЗаполнения);
	
	// Заполнение по умолчанию
	Если Подразделение.Пустая() Тогда
		Подразделение = ПользователиСервер.ПолучитьЗначениеНастройки("ОсновноеПодразделение");
	КонецЕсли; 
	
	Если Ответственный.Пустая() Тогда
		Ответственный = ПользователиСервер.ПолучитьЗначениеНастройки("ОсновнойОтветственный");
	КонецЕсли;
	
	// Ввод на основании.
	типДанныхЗаполнения = ТипЗнч(данныеЗаполнения);
	
	Если типДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьДокументПоОтбору(данныеЗаполнения);
		
	ИначеЕсли типДанныхЗаполнения = Тип("ДокументСсылка.Планирование_ЛистЗадач") Тогда
		
		ЗаполнитьДокументНаОснованииЛистаЗадач(данныеЗаполнения);
		заполненНаОснованииДокумента = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(отказ, режимПроведения)
	
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ФинансовыйРезультат.Записывать = Истина;
	Движения.РасчетыПоОплатеТруда.Записывать = Истина;
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Ссылка.Подразделение,
	|	НАЧАЛОПЕРИОДА(Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Ссылка.Дата, МЕСЯЦ) КАК ПериодРегистрации,
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Ссылка.Дата КАК Период,
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Сотрудник,
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.ВидРасчета,
	|	СУММА(Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Результат) КАК Результат,
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Сотрудник.КатегорияРаботника.СтатьяЗатратПоЗарплате КАК СтатьяЗатрат
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.Планирование_ВыполнениеЛистаЗадач.РасчетЗарплаты КАК Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты
	|ГДЕ
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Ссылка = &Ссылка
	|	И Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Результат <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Ссылка.Подразделение,
	|	НАЧАЛОПЕРИОДА(Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Ссылка.Дата, МЕСЯЦ),
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Сотрудник,
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.ВидРасчета,
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Сотрудник.КатегорияРаботника.СтатьяЗатратПоЗарплате,
	|	Планирование_ВыполнениеЛистаЗадачРасчетЗарплаты.Ссылка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_ДанныеДокумента.Период,
	|	ВТ_ДанныеДокумента.Подразделение,
	|	ВТ_ДанныеДокумента.Сотрудник,
	|	ЗНАЧЕНИЕ(ПланСчетов.Внутренний.Зарплата) КАК СчетУчета,
	|	ВТ_ДанныеДокумента.Результат КАК Сумма
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Период,
	|	ВТ_ДанныеДокумента.Подразделение,
	|	ВТ_ДанныеДокумента.СтатьяЗатрат,
	|	СУММА(ВТ_ДанныеДокумента.Результат) КАК СуммаРасходов
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДокумента.Период,
	|	ВТ_ДанныеДокумента.Подразделение,
	|	ВТ_ДанныеДокумента.СтатьяЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Период,
	|	ВТ_ДанныеДокумента.Подразделение,
	|	ВТ_ДанныеДокумента.Сотрудник,
	|	ВТ_ДанныеДокумента.ПериодРегистрации,
	|	ВТ_ДанныеДокумента.ВидРасчета,
	|	ВТ_ДанныеДокумента.Результат
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	результатЗапроса = запрос.ВыполнитьПакет();
	
	Движения.ВзаиморасчетыССотрудниками.Загрузить(результатЗапроса[1].Выгрузить());
	Движения.ФинансовыйРезультат.Загрузить(результатЗапроса[2].Выгрузить());
	Движения.РасчетыПоОплатеТруда.Загрузить(результатЗапроса[3].Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеПоОснованию

Процедура ЗаполнитьДокументПоОтбору(Знач данныеЗаполнения)
	
КонецПроцедуры	

Процедура ЗаполнитьДокументНаОснованииЛистаЗадач(Знач данныеЗаполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Заполнение реквизитов документа.
	ЗаполнениеОбъектовСервер.ЗаполнитьРеквизитыДокументаПриВводеНаОсновании(ЭтотОбъект, данныеЗаполнения);
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Планирование_ЛистЗадачСостав.Задача,
	|	Планирование_ЛистЗадачСостав.Менеджер КАК Менеджер,
	|	Планирование_ЛистЗадачСостав.Ссылка.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_СоставЛистаЗадач
	|ИЗ
	|	Документ.Планирование_ЛистЗадач.Состав КАК Планирование_ЛистЗадачСостав
	|ГДЕ
	|	Планирование_ЛистЗадачСостав.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Подразделение,
	|	Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоставЛистаЗадач.Задача,
	|	ВТ_СоставЛистаЗадач.Менеджер
	|ИЗ
	|	ВТ_СоставЛистаЗадач КАК ВТ_СоставЛистаЗадач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Менеджеры.Менеджер,
	|	КД_НазначенияТорговыхПредставителейСрезПоследних.Сотрудник
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_СоставЛистаЗадач.Менеджер КАК Менеджер,
	|		ВТ_СоставЛистаЗадач.Подразделение КАК Подразделение
	|	ИЗ
	|		ВТ_СоставЛистаЗадач КАК ВТ_СоставЛистаЗадач
	|	ГДЕ
	|		ВТ_СоставЛистаЗадач.Менеджер.ЭтоГруппа = ЛОЖЬ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_СоставЛистаЗадач.Менеджер,
	|		ВТ_СоставЛистаЗадач.Подразделение) КАК Менеджеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_НазначенияТорговыхПредставителей.СрезПоследних(&ДатаСреза, ) КАК КД_НазначенияТорговыхПредставителейСрезПоследних
	|		ПО Менеджеры.Подразделение = КД_НазначенияТорговыхПредставителейСрезПоследних.Подразделение
	|			И Менеджеры.Менеджер = КД_НазначенияТорговыхПредставителейСрезПоследних.Менеджер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Супервайзеры.Менеджер,
	|	КД_НазначенияСупервайзеровСрезПоследних.Сотрудник
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_СоставЛистаЗадач.Менеджер КАК Менеджер,
	|		ВТ_СоставЛистаЗадач.Подразделение КАК Подразделение
	|	ИЗ
	|		ВТ_СоставЛистаЗадач КАК ВТ_СоставЛистаЗадач
	|	ГДЕ
	|		ВТ_СоставЛистаЗадач.Менеджер.ЭтоГруппа = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_СоставЛистаЗадач.Менеджер,
	|		ВТ_СоставЛистаЗадач.Подразделение) КАК Супервайзеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_НазначенияСупервайзеров.СрезПоследних(&ДатаСреза, ) КАК КД_НазначенияСупервайзеровСрезПоследних
	|		ПО Супервайзеры.Подразделение = КД_НазначенияСупервайзеровСрезПоследних.Подразделение
	|			И Супервайзеры.Менеджер = КД_НазначенияСупервайзеровСрезПоследних.Менеджер";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("Ссылка", данныеЗаполнения);
	запрос.УстановитьПараметр("ДатаСреза", КонецМесяца(данныеЗаполнения.Дата));
	
	результатЗапроса = запрос.ВыполнитьПакет();
	
	ЭтотОбъект.ИсходныеДанные.Загрузить(результатЗапроса[1].Выгрузить());
	ЭтотОбъект.БазыРасчетаЗарплаты.Загрузить(результатЗапроса[2].Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти