
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РемонтыАвтомобилей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РемонтыАвтомобилей.Автомобиль,
	|	РемонтыАвтомобилей.ВидРемонта,
	|	РемонтыАвтомобилей.Водитель,
	|	РемонтыАвтомобилей.Дата,
	|	РемонтыАвтомобилей.Контрагент,
	|	РемонтыАвтомобилей.Номер,
	|	РемонтыАвтомобилей.ОперацияДокумента,
	|	РемонтыАвтомобилей.Подразделение,
	|	РемонтыАвтомобилей.ПоказанияСпидометра,
	|	РемонтыАвтомобилей.СуммаДокумента,
	|	РемонтыАвтомобилей.ВыполненныеРаботы.(
	|		НомерСтроки,
	|		ВидРабот,
	|		Сумма
	|	),
	|	РемонтыАвтомобилей.ИспользованныеЗапчасти.(
	|		НомерСтроки,
	|		Запчасть,
	|		СтранаПроизводитель,
	|		ФирмаПроизводитель,
	|		Качество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РемонтыАвтомобилей КАК РемонтыАвтомобилей
	|ГДЕ
	|	РемонтыАвтомобилей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВыполненныеРаботыШапка = Макет.ПолучитьОбласть("ВыполненныеРаботыШапка");
	ОбластьВыполненныеРаботы = Макет.ПолучитьОбласть("ВыполненныеРаботы");
	ОбластьИспользованныеЗапчастиШапка = Макет.ПолучитьОбласть("ИспользованныеЗапчастиШапка");
	ОбластьИспользованныеЗапчасти = Макет.ПолучитьОбласть("ИспользованныеЗапчасти");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВыполненныеРаботыШапка);
		ВыборкаВыполненныеРаботы = Выборка.ВыполненныеРаботы.Выбрать();
		Пока ВыборкаВыполненныеРаботы.Следующий() Цикл
			ОбластьВыполненныеРаботы.Параметры.Заполнить(ВыборкаВыполненныеРаботы);
			ТабДок.Вывести(ОбластьВыполненныеРаботы, ВыборкаВыполненныеРаботы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьИспользованныеЗапчастиШапка);
		ВыборкаИспользованныеЗапчасти = Выборка.ИспользованныеЗапчасти.Выбрать();
		Пока ВыборкаИспользованныеЗапчасти.Следующий() Цикл
			ОбластьИспользованныеЗапчасти.Параметры.Заполнить(ВыборкаИспользованныеЗапчасти);
			ТабДок.Вывести(ОбластьИспользованныеЗапчасти, ВыборкаИспользованныеЗапчасти.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
