
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрПериод = НастройкиОсновнойСхемы.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	Если ПараметрПериод.ДатаНачала <> НачалоМесяца(ПараметрПериод.ДатаНачала) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Начало выбранного периода должно быть кратно началу месяца.'");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
	
	КонецЕсли; 
	Если ПараметрПериод.ДатаОкончания <> КонецМесяца(ПараметрПериод.ДатаОкончания) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Окончание выбранного периода должно быть кратно концу месяца.'");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
	
	КонецЕсли; 
	
КонецПроцедуры
