#Область ОбработчикмСобытий

Процедура ОбработкаПроведения(отказ, режимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Движение = Движения.ВзаиморасчетыСПоставщиками.Добавить();
	
	Движение.Период = ЭтотОбъект.Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Контрагент	= ЭтотОбъект.Поставщик;
	Движение.Подразделение	= Подразделение;
	Движение.Сумма = -1*ЭтотОбъект.СуммаДокумента;
	
	
	Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
	
	Движение.Период 		= ЭтотОбъект.Дата;
	Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
	Движение.Подразделение	= ЭтотОбъект.Подразделение;
	Движение.Контрагент		= Отдел.Магазин;
	//Движение.КредитныйДокумент = Ссылка;
	Движение.Менеджер 		= Справочники.Менеджеры.БезМенеджера;
	Движение.Сумма 			= -1*ЭтотОбъект.СуммаДокумента;	
	
	// Регистр "Продажи"
	Движение = Движения.Продажи.Добавить();
	Движение.Период 		= Дата;
	Движение.Подразделение 	= Подразделение;
	Движение.Контрагент 	= Отдел.Магазин;
	Движение.Менеджер 		= Справочники.Менеджеры.БезМенеджера;
	Движение.ПродСтоимость	= -1*СуммаДокумента;
	Движение.ЭтоВозврат		= Истина;
	
	
	// Допроведем розницу .... ОБЯЗАТЕЛЬНО !!! после выполнения проверки документа
	
	Если НЕ Отдел.Подразделение = Неопределено Тогда
		
		// Партии товаров в рознице
		Движение = Движения.ПартииТоваровНаСкладах.Добавить();
		
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Подразделение 	= Отдел.Подразделение;
		Движение.Склад 			= Отдел.Склад;
		Движение.ЦФО 			= Отдел;
		Движение.Стоимость 		= -1*СуммаДокумента;
		Движение.ПродСтоимость 	= -1*СуммаБезСкидки;
		
		// Взаиморасчеты с "Поставщиками"
		Движение = Движения.ВзаиморасчетыСПоставщиками.Добавить();
		
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Подразделение	= Отдел.Подразделение;
		Движение.Контрагент 	= ДополнительныеСвойства.УчетнаяПолитика.Контрагент;
		Движение.ЦФО 			= Отдел;
		Движение.Сумма 			= -1*СуммаДокумента;
		
	КонецЕсли;
		
	Движения.ВзаиморасчетыСПокупателями.Записать();
	Движения.ВзаиморасчетыСПоставщиками.Записать();
	Движения.ПартииТоваровНаСкладах.Записать();
	Движения.Продажи.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(отказ, режимЗаписи, режимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Подразделение.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Запись невозможна без заполнения Подразделения.'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "Подразделение");
		
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, объектКопирования);
	
КонецПроцедуры

#КонецОбласти 