
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(данныеЗаполнения, стандартнаяОбработка)

	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеНовогоДокумента(ЭтотОбъект, данныеЗаполнения);
	
	// Заполнение по умолчанию.
	Если Подразделение.Пустая() Тогда
		Подразделение = ПользователиСервер.ПолучитьЗначениеНастройки("ОсновноеПодразделение");
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(отказ, режимПроведения)
	
	
	Движения.КД_ВыполнениеСтандартаМерчендайзинга.Записывать = Истина;
	Движения.КД_ВыполнениеСтандартаПрисутствия.Записывать = Истина;
	
	// переделать с учетом изменившихся реквизитов
	Если 1=2 Тогда
		
		свойстваКонтрагента = Справочники.Контрагенты.ОпределитьКатегориюТорговойТочки(КД_ТорговаяТочка, Дата, Подразделение, КД_ГруппаПродукта, КД_МКИ_SKU, КД_ТСВ_SKU, КД_МВ_SKU, КД_ТВ_SKU);
		
		запрос = Новый Запрос;
		запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		#Область ТекстЗапроса
		
		запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(КД_СтандартПрисутствияСрезПоследних.Период) КАК ДатаВводаСтандарта,
		|	КД_СтандартПрисутствияСрезПоследних.Подразделение,
		|	КД_СтандартПрисутствияСрезПоследних.ГруппаПродукции,
		|	КД_СтандартПрисутствияСрезПоследних.КатегорияТТ,
		|	КД_СтандартПрисутствияСрезПоследних.ТорговаяТочка,
		|	КД_СтандартПрисутствия.Номенклатура,
		|	КД_СтандартПрисутствия.ПриоритетПродукта,
		|	КД_СтандартПрисутствия.ТипПриоритета,
		|	КД_СтандартПрисутствия.Фэйсинг,
		|	1 КАК Стандарт,
		|	КД_КатегоризацияТорговыхТочекСрезПоследних.МинимальнаяДлинаВитрины
		|ПОМЕСТИТЬ ВТ_СтандартПрисутствия
		|ИЗ
		|	РегистрСведений.КД_СтандартПрисутствия.СрезПоследних(
		|			&ДатаСреза,
		|			Подразделение = &Подразделение
		|				И ГруппаПродукции = &ГруппаПродукции
		|				И КатегорияТТ = &КатегорияТТ) КАК КД_СтандартПрисутствияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_СтандартПрисутствия КАК КД_СтандартПрисутствия
		|		ПО КД_СтандартПрисутствияСрезПоследних.Подразделение = КД_СтандартПрисутствия.Подразделение
		|			И КД_СтандартПрисутствияСрезПоследних.ГруппаПродукции = КД_СтандартПрисутствия.ГруппаПродукции
		|			И КД_СтандартПрисутствияСрезПоследних.КатегорияТТ = КД_СтандартПрисутствия.КатегорияТТ
		|			И КД_СтандартПрисутствияСрезПоследних.Период = КД_СтандартПрисутствия.Период
		|			И КД_СтандартПрисутствияСрезПоследних.ТорговаяТочка = КД_СтандартПрисутствия.ТорговаяТочка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегоризацияТорговыхТочек.СрезПоследних(
		|				&ДатаСреза,
		|				КаналСбыта = &КаналСбыта
		|					И ТипСтандарта = &ТипСтандарта) КАК КД_КатегоризацияТорговыхТочекСрезПоследних
		|		ПО КД_СтандартПрисутствияСрезПоследних.Подразделение = КД_КатегоризацияТорговыхТочекСрезПоследних.Подразделение
		|			И КД_СтандартПрисутствияСрезПоследних.КатегорияТТ = КД_КатегоризацияТорговыхТочекСрезПоследних.КатегорияТТ
		|			И КД_СтандартПрисутствияСрезПоследних.ГруппаПродукции = КД_КатегоризацияТорговыхТочекСрезПоследних.ГруппаПродукции
		|
		|СГРУППИРОВАТЬ ПО
		|	КД_СтандартПрисутствияСрезПоследних.Подразделение,
		|	КД_СтандартПрисутствияСрезПоследних.ГруппаПродукции,
		|	КД_СтандартПрисутствияСрезПоследних.КатегорияТТ,
		|	КД_СтандартПрисутствияСрезПоследних.ТорговаяТочка,
		|	КД_СтандартПрисутствия.Номенклатура,
		|	КД_СтандартПрисутствия.ПриоритетПродукта,
		|	КД_СтандартПрисутствия.ТипПриоритета,
		|	КД_СтандартПрисутствия.Фэйсинг,
		|	КД_КатегоризацияТорговыхТочекСрезПоследних.МинимальнаяДлинаВитрины
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БПАГСторЧекСостав.Ссылка.Дата КАК Период,
		|	БПАГСторЧекСостав.Ссылка.Подразделение,
		|	БПАГСторЧекСостав.Ссылка.КД_ГруппаПродукта КАК ГруппаПродукта,
		|	&КатегорияТТ,
		|	КД_КатегорииТорговыхТочекСрезПоследних.КатегорияТТ КАК КатегорияТТИзКарточки,
		|	&КатегорийнаяГруппа,
		|	БПАГСторЧекСостав.Ссылка.КД_ТорговаяТочка КАК ТорговаяТочка,
		|	БПАГСторЧекСостав.Ссылка.Менеджер,
		|	БПАГСторЧекСостав.Ссылка.КД_МКИ_SKU КАК ОбщКоличествоSKU,
		|	БПАГСторЧекСостав.Номенклатура,
		|	БПАГСторЧекСостав.Фэйсинг,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КД_КатегорииТорговыхТочекСрезПоследних.ДлинаВитрины, 0) >= ЕСТЬNULL(КД_КатегоризацияТорговыхТочекСрезПоследних.МинимальнаяДлинаВитрины, 100500)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЕстьСтандартМерчендайзинга,
		|	ЗНАЧЕНИЕ(Перечисление.КД_ВидОтчетаПоСтандарту.ВыполнениеСтандартов) КАК ВидОтчетаПоСтандарту
		|ПОМЕСТИТЬ ВТ_ДокументСостав
		|ИЗ
		|	Документ.БПАГСторЧек.Состав КАК БПАГСторЧекСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегоризацияТорговыхТочек.СрезПоследних(&ДатаСреза, ) КАК КД_КатегоризацияТорговыхТочекСрезПоследних
		|		ПО БПАГСторЧекСостав.Ссылка.Подразделение = КД_КатегоризацияТорговыхТочекСрезПоследних.Подразделение
		|			И БПАГСторЧекСостав.Ссылка.КД_ГруппаПродукта = КД_КатегоризацияТорговыхТочекСрезПоследних.ГруппаПродукции
		|			И (&КатегорияТТ = КД_КатегоризацияТорговыхТочекСрезПоследних.КатегорияТТ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КД_КатегорииТорговыхТочек.СрезПоследних(&ДатаСреза, ) КАК КД_КатегорииТорговыхТочекСрезПоследних
		|		ПО БПАГСторЧекСостав.Ссылка.КД_ГруппаПродукта = КД_КатегорииТорговыхТочекСрезПоследних.ГруппаПродукции
		|			И БПАГСторЧекСостав.Ссылка.КД_ТорговаяТочка = КД_КатегорииТорговыхТочекСрезПоследних.ТорговаяТочка
		|ГДЕ
		|	БПАГСторЧекСостав.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.ГруппаПродукта,
		|	ВложенныйЗапрос.КатегорияТТ,
		|	ВложенныйЗапрос.КатегорияТТИзКарточки,
		|	ВложенныйЗапрос.КатегорийнаяГруппа,
		|	ВложенныйЗапрос.ТорговаяТочка,
		|	ВложенныйЗапрос.Менеджер,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ФэйсингФакт = 0
		|			ТОГДА ВложенныйЗапрос.ФэйсингСтандарт
		|		ИНАЧЕ ВложенныйЗапрос.ФэйсингФакт
		|	КОНЕЦ КАК ФэйсингФакт,
		|	ВложенныйЗапрос.ФэйсингСтандарт,
		|	ВложенныйЗапрос.ВидОтчетаПоСтандарту
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ДокументСостав.Период КАК Период,
		|		ВТ_ДокументСостав.Подразделение КАК Подразделение,
		|		ВТ_ДокументСостав.ГруппаПродукта КАК ГруппаПродукта,
		|		ВТ_ДокументСостав.КатегорияТТ КАК КатегорияТТ,
		|		ВТ_ДокументСостав.КатегорияТТИзКарточки КАК КатегорияТТИзКарточки,
		|		ВТ_ДокументСостав.КатегорийнаяГруппа КАК КатегорийнаяГруппа,
		|		ВТ_ДокументСостав.ТорговаяТочка КАК ТорговаяТочка,
		|		ВТ_ДокументСостав.Менеджер КАК Менеджер,
		|		ВТ_ДокументСостав.Номенклатура КАК Номенклатура,
		|		ВТ_ДокументСостав.Фэйсинг КАК ФэйсингФакт,
		|		ЕСТЬNULL(ВТ_СтандартПрисутствия.Фэйсинг, 0) КАК ФэйсингСтандарт,
		|		ВТ_ДокументСостав.ВидОтчетаПоСтандарту КАК ВидОтчетаПоСтандарту
		|	ИЗ
		|		ВТ_ДокументСостав КАК ВТ_ДокументСостав
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартПрисутствия КАК ВТ_СтандартПрисутствия
		|			ПО ВТ_ДокументСостав.Номенклатура = ВТ_СтандартПрисутствия.Номенклатура
		|	ГДЕ
		|		ВТ_ДокументСостав.ЕстьСтандартМерчендайзинга <> 0) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.ФэйсингСтандарт <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БПАГСторЧекСостав.Период,
		|	БПАГСторЧекСостав.Подразделение,
		|	БПАГСторЧекСостав.ГруппаПродукта,
		|	БПАГСторЧекСостав.КатегорияТТ,
		|	БПАГСторЧекСостав.КатегорияТТИзКарточки,
		|	БПАГСторЧекСостав.ТорговаяТочка,
		|	БПАГСторЧекСостав.Менеджер,
		|	БПАГСторЧекСостав.Номенклатура,
		|	СУММА(ЕСТЬNULL(ВТ_СтандартПрисутствияПоПриоритетам.Стандарт, 0)) КАК НормаКоличествоSKUПоПриоритету,
		|	БПАГСторЧекСостав.ОбщКоличествоSKU КАК ОбщКоличествоSKU,
		|	ЕСТЬNULL(ВТ_СтандартПрисутствия.ПриоритетПродукта, ЗНАЧЕНИЕ(Справочник.КД_ПриоритетыПродукта.Вывод)) КАК ПриоритетПродукта,
		|	ЕСТЬNULL(ВТ_СтандартПрисутствия.ТипПриоритета, ЗНАЧЕНИЕ(Перечисление.КД_ТипыПриоритетовПродукта.НеРекомендуемый)) КАК ТипПриоритета,
		|	1 КАК ФактКоличествоSKUПоПриоритету,
		|	БПАГСторЧекСостав.КатегорийнаяГруппа,
		|	БПАГСторЧекСостав.ВидОтчетаПоСтандарту
		|ИЗ
		|	ВТ_ДокументСостав КАК БПАГСторЧекСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартПрисутствия КАК ВТ_СтандартПрисутствия
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартПрисутствия КАК ВТ_СтандартПрисутствияПоПриоритетам
		|			ПО (ВТ_СтандартПрисутствияПоПриоритетам.ПриоритетПродукта = ВТ_СтандартПрисутствия.ПриоритетПродукта)
		|		ПО БПАГСторЧекСостав.Номенклатура = ВТ_СтандартПрисутствия.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	БПАГСторЧекСостав.Номенклатура,
		|	ЕСТЬNULL(ВТ_СтандартПрисутствия.ПриоритетПродукта, ЗНАЧЕНИЕ(Справочник.КД_ПриоритетыПродукта.Вывод)),
		|	ЕСТЬNULL(ВТ_СтандартПрисутствия.ТипПриоритета, ЗНАЧЕНИЕ(Перечисление.КД_ТипыПриоритетовПродукта.НеРекомендуемый)),
		|	БПАГСторЧекСостав.ОбщКоличествоSKU,
		|	БПАГСторЧекСостав.Период,
		|	БПАГСторЧекСостав.Подразделение,
		|	БПАГСторЧекСостав.ГруппаПродукта,
		|	БПАГСторЧекСостав.КатегорияТТ,
		|	БПАГСторЧекСостав.ТорговаяТочка,
		|	БПАГСторЧекСостав.Менеджер,
		|	БПАГСторЧекСостав.КатегорийнаяГруппа,
		|	БПАГСторЧекСостав.КатегорияТТИзКарточки,
		|	БПАГСторЧекСостав.ВидОтчетаПоСтандарту";
		
		#КонецОбласти
		
		запрос.УстановитьПараметр("ДатаСреза", КонецДня(Дата));
		запрос.УстановитьПараметр("Ссылка", Ссылка);
		запрос.УстановитьПараметр("Подразделение", Подразделение);
		запрос.УстановитьПараметр("КатегорийнаяГруппа", свойстваКонтрагента.КатегорияТТ.Родитель);
		//запрос.УстановитьПараметр("ДлинаВитриныИзКарточки", свойстваКонтрагента.ДлинаВитриныИзКарточки);
		
		запрос.УстановитьПараметр("ГруппаПродукции", КД_ГруппаПродукта);
		запрос.УстановитьПараметр("КатегорияТТ", свойстваКонтрагента.КатегорияТТ);
		
		запрос.УстановитьПараметр("КаналСбыта", свойстваКонтрагента.КаналСбыта);
		запрос.УстановитьПараметр("ТипСтандарта", свойстваКонтрагента.ТипСтандарта);
		
		
		результатЗапроса = запрос.ВыполнитьПакет();
		
		#Область ПолучениеВиртуальныхТаблиц
		запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_СтандартПрисутствия";
		запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_ДокументСостав";
		#КонецОбласти 
		
		Движения.КД_ВыполнениеСтандартаМерчендайзинга.Загрузить(результатЗапроса[2].Выгрузить());
		Движения.КД_ВыполнениеСтандартаПрисутствия.Загрузить(результатЗапроса[3].Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(отказ, режимЗаписи, режимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Подразделение.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Запись невозможна без заполнения Подразделения.'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "Подразделение");
		
	КонецЕсли;
	
	Если КатегорияТТ.Пустая() Тогда
		
		категорияТорговойТочки = Справочники.Контрагенты.ОпределитьКатегориюТорговойТочки(
						Контрагент,
						Дата,
						Подразделение,
						КД_ГруппаПродукта,
						ОбщSKU);
						
		КатегорияТТ = категорияТорговойТочки.КатегорияТТИзКарточки;
		КатегорияТТОтчет = категорияТорговойТочки.КатегорияТТ;
						
	КонецЕсли;
	
	Если Товары.Количество() > 0 И ОбщSKU <> 0 Тогда
		ДоляПолки = Товары.Количество() / ОбщSKU * 100;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(этотОбъект, объектКопирования);
	
КонецПроцедуры

#КонецОбласти