Перем СчетПрогрессораПеретаскивания;
Перем ПрогрессорПеретаскиванияВсего;

&НаКлиенте
Процедура СписокФизическихЛицПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокФизическихЛицПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ЗапуститьРекурсиюПеретаскивания(ПараметрыПеретаскивания.Значение, Элемент.ТекущийРодитель, 0);
КонецПроцедуры

Процедура ЗапуститьРекурсиюПеретаскивания(ПараметрыПеретаскивания, Строка, Папа = 0)
	
	//Если СчетПрогрессораПеретаскивания = Неопределено Тогда
	//	 СчетПрогрессораПеретаскивания = 0;
	//КонецЕсли;
	//СчетПрогрессораПеретаскивания = СчетПрогрессораПеретаскивания + 1;
	//БПАГ.глПрогрессор("Синхронизация: ", ПрогрессорПеретаскиванияВсего, СчетПрогрессораПеретаскивания);
	
	ПеретаскиваемыеЗначения = ПараметрыПеретаскивания;
	
	Если ТипЗнч(ПеретаскиваемыеЗначения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Перетаскиваемое = ПеретаскиваемыеЗначения;
		Если Перетаскиваемое.ПометкаУдаления Тогда
			Возврат;
		КонецЕсли;
		
		Если Перетаскиваемое.ЭтоГруппа Тогда
			//Создадим группу и отправим потомков по рекурсии
			//Но сначала проверим, нет ли зацикливания уровней
			
			Если Строка <> Неопределено Тогда
				Если Строка.ЭтоГруппа Тогда
					Если Перетаскиваемое = Строка.ФизЛицо Тогда
						//Предупреждение("Нельзя поместить группу в саму себя! Зацикливание уровней!");
						Возврат;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СуществующийЭлемент = Справочники.БПАГАгенты.НайтиПоРеквизиту("ФизЛицо", Перетаскиваемое);
			Если СуществующийЭлемент <> Справочники.БПАГАгенты.ПустаяСсылка() Тогда
				Объ = СуществующийЭлемент.ПолучитьОбъект();
			Иначе
				Объ = Справочники.БПАГАгенты.СоздатьГруппу();
			КонецЕсли;
			
			Если Папа = 0 Тогда
				Если Строка <> Неопределено Тогда
					Если Строка.ЭтоГруппа Тогда
						Объ.Родитель = Строка
					КонецЕсли;
				КонецЕсли;
			Иначе
				Объ.Родитель = Папа;
			КонецЕсли;
			
			Объ.ФизЛицо = Перетаскиваемое;
			Объ.Наименование = Перетаскиваемое.Наименование;
			Объ.Записать();
			
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Родитель = &Родитель
			|	И (НЕ ФизическиеЛица.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическиеЛица.Наименование";
			
			Запрос.УстановитьПараметр("Родитель", Перетаскиваемое);
			ТЗ = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Потомок Из ТЗ Цикл
				РекурсивныеПараметрыПеретаскивания = Потомок.Ссылка;
				ЗапуститьРекурсиюПеретаскивания(РекурсивныеПараметрыПеретаскивания, Строка, Объ.Ссылка);
			КонецЦикла;
			
		Иначе
			СуществующийЭлемент = Справочники.БПАГАгенты.НайтиПоРеквизиту("ФизЛицо", Перетаскиваемое);
			Если СуществующийЭлемент <> Справочники.БПАГАгенты.ПустаяСсылка() Тогда
				Объ = СуществующийЭлемент.ПолучитьОбъект();
			Иначе
				Объ = Справочники.БПАГАгенты.СоздатьЭлемент();
			КонецЕсли;
			
			Если Папа = 0 Тогда
				Если Строка <> Неопределено Тогда
					Если Строка.ЭтоГруппа Тогда
						Объ.Родитель = Строка
					КонецЕсли;
				КонецЕсли;
			Иначе
				Объ.Родитель = Папа;
			КонецЕсли;
			
			Объ.ФизЛицо = Перетаскиваемое;
			Объ.Наименование = Перетаскиваемое.Наименование;
			
			Объ.Записать();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ПеретаскиваемыеЗначения) = Тип("Массив") Тогда
		Для Каждого Перетаскиваемое Из ПеретаскиваемыеЗначения Цикл
			РекурсивныеПараметрыПеретаскивания = Перетаскиваемое;
			ЗапуститьРекурсиюПеретаскивания(РекурсивныеПараметрыПеретаскивания, Строка, 0);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	Если Элементы.СписокБПАГАгентов.ТекущаяСтрока = Неопределено Тогда
		Предупреждение("Не выбрано ни одного элемента!");
	Иначе
	ТекПараметры = Новый Структура;
	ТекПараметры.Вставить("Агент",Элементы.СписокБПАГАгентов.ТекущаяСтрока);
	Форма = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаНастроек",ТекПараметры);
	Форма.Открыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокБПАГАгентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущаяСтрока);
	Форма = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаАгента",ПараметрыФормы);	
	Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуНастроекДокументов(Команда)
	Если Элементы.СписокБПАГАгентов.ТекущаяСтрока = Неопределено Тогда
		Предупреждение("Не выбрано ни одного элемента!");
	Иначе
	ТекПараметры = Новый Структура;
	ТекПараметры.Вставить("Агент",Элементы.СписокБПАГАгентов.ТекущаяСтрока);
	Форма = ПолучитьФорму("Обработка.БПАГПанАгентЦентрУправления.Форма.УПФормаНастроекДокументов",ТекПараметры);
	Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

