

&НаСервере
Процедура ЗаписатьНаСервере()
	

	
	объектОбработка = РеквизитФормыВЗначение("Объект");
	
	макет = ОбъектОбработка.ПолучитьМакетЗаполнения();
	
	Для индекс = 2 по макет.ВысотаТаблицы Цикл
		
		наименование = Макет.Область(Индекс,1,Индекс,1).Текст;
		
		результатПоиска = Справочники.ВариантыОтчетов.НайтиПоНаименованию(наименование, Истина);
		
		Если Не результатПоиска.Пустая() Тогда
			вариантыОтчетовОбъект = результатПоиска.ПолучитьОбъект();
		Иначе
			вариантыОтчетовОбъект = Справочники.ВариантыОтчетов.СоздатьЭлемент();
		КонецЕсли;
		
		
		вариантыОтчетовОбъект.Наименование = Макет.Область(Индекс,1,Индекс,1).Текст;
 		вариантыОтчетовОбъект.ТипВариантаОтчета = Вычислить(Макет.Область(Индекс,2,Индекс,2).Текст);
		вариантыОтчетовОбъект.КлючВарианта = Макет.Область(Индекс,3,Индекс,3).Текст;
		вариантыОтчетовОбъект.КлючОбъекта = Макет.Область(Индекс,4,Индекс,4).Текст;
		
		вариантыОтчетовОбъект.Записать();
		
	КонецЦикла;
	
	
	//_ВариантОтчета.КлючВарианта = "Основной";
	//_ВариантОтчета.КлючОбъекта = "Отчет.ВзаиморасчетыСПокупателями";
	//_ВариантОтчета.Наименование = "Взаиморасчеты с покупателями (осн)";
	//_ВариантОтчета.ТипВариантаОтчета = Перечисления.ТипыВариантовОтчетов.Предопределенный;
	//
	//_ВариантОтчета.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры
