
Функция ТребуетсяВыполнение(спрРасписанияСсылка, датаДляПроверки, датаНачалаПоследнегоЗапуска = Неопределено, датаЗавершенияПоследнегоЗапуска = Неопределено) Экспорт
	
	новыйРасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	
	ЗаполнитьЗначенияСвойств(новыйРасписаниеРегламентногоЗадания, спрРасписанияСсылка);
	
	новыйРасписаниеРегламентногоЗадания.ДниНедели = спрРасписанияСсылка.ДниНедели.Выгрузить().ВыгрузитьКолонку("День");
	новыйРасписаниеРегламентногоЗадания.Месяцы = спрРасписанияСсылка.Месяцы.Выгрузить().ВыгрузитьКолонку("Месяц");
	
	Возврат новыйРасписаниеРегламентногоЗадания.ТребуетсяВыполнение(датаДляПроверки, датаНачалаПоследнегоЗапуска, датаЗавершенияПоследнегоЗапуска);
	
КонецФункции