
&НаКлиенте
Процедура СписокВыбор(элемент, выбраннаяСтрока, поле, стандартнаяОбработка)
	
	стандартнаяОбработка = Ложь;
	
	ИмяОбработки = ПодключитьВнешнююОбработку(выбраннаяСтрока);
	
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.Форма",,,Истина);
	
КонецПроцедуры

&НаСервере
Функция ПодключитьВнешнююОбработку(ссылкаНаДополнительныйОтчетОбрабтку)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийОбъект = ссылкаНаДополнительныйОтчетОбрабтку.ПолучитьОбъект();
	
	АдресДанныхОбработки = ПоместитьВоВременноеХранилище(
			ТекущийОбъект.ХранилищеОбработки.Получить(),
			УникальныйИдентификатор);
	
	Возврат ВнешниеОбработки.Подключить(АдресДанныхОбработки);
	
КонецФункции 