&НаСервере
Функция  НужнаПечатьПриложения2КНалоговойНакладной(ПараметрКоманды)
	
	СписокПриложений2 = Новый Массив;
	
	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Приложение2КНалоговойНакладнойСостав.Ссылка
	|ИЗ
	|	Документ.Приложение2КНалоговойНакладной.Состав КАК Приложение2КНалоговойНакладнойСостав
	|ГДЕ
	|	Приложение2КНалоговойНакладнойСостав.ВозвратнаяНакладная В(&СписокВозвратныхНакладных)");
	
	Запрос.УстановитьПараметр("СписокВозвратныхНакладных", ПараметрКоманды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СписокПриложений2.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат (СписокПриложений2);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ВозвратОтПокупателя", "Накладная", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);
	
	// проверим необходимость печати НалоговойНакладной
	СписокПриложений2 = НужнаПечатьПриложения2КНалоговойНакладной(ПараметрКоманды);
	Если  СписокПриложений2.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Приложение2КНалоговойНакладной", "Налоговая", СписокПриложений2, ПараметрыВыполненияКоманды, Неопределено);
	КонецЕсли;
	

КонецПроцедуры
