Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
   ДокументРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
   ДокументРезультат.АвтоМасштаб=Истина;
КонецПроцедуры

Процедура НастройкиОтчета(Настройки) Экспорт

	// Описание вариантов отчетов.
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "Ведомость", НСТР("ru = 'Отчет позволяет получить информацию о состоянии взаиморасчетов с поставщиками'"));
    //ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "Остатки", НСТР("ru = 'Отчет отображает состояние запасов на указанную дату'"));

КонецПроцедуры