
#Область Старт
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Инициатор = ПараметрыСеанса.ТекущийПользователь;
	Статус = Перечисления.СтатусыБизнесПроцессыЗадачи.Новый;
	
КонецПроцедуры
#КонецОбласти

#Область Утверждение
Процедура УтверждениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого задача Из ФормируемыеЗадачи Цикл
		
		задача.Статус			 = Статус;
		задача.Инициатор		 = Инициатор;
		задача.Подразделение	 = Подразделение;
		задача.Фамилия			 = Фамилия;
		задача.Имя				 = Имя;
		задача.Отчество			 = Отчество;
		задача.Телефон			 = Телефон;
		задача.Категория		 = Категория;
		задача.Должность		 = Должность;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УтверждениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Статус			 = Задача.Статус;
	Инициатор		 = Задача.Инициатор;
	Фамилия			 = Задача.Фамилия;
	Имя				 = Задача.Имя;
	Отчество		 = Задача.Отчество;
	Телефон			 = Задача.Телефон;
	Подразделение	 = Задача.Подразделение;
	Категория		 = Задача.Категория;
	Должность		 = Задача.Должность;
	Менеджер		 = Задача.Менеджер;
	Контрагент		 = Задача.Контрагент;
	ФизЛицо			 = Задача.ФизЛицо;
	Сотрудник		 = Задача.Сотрудник;
	
	Записать();
	
КонецПроцедуры
#КонецОбласти

#Область ПроверкаУтверждения
Процедура ПроверкаУтвержденияПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если Статус = Перечисления.СтатусыБизнесПроцессыЗадачи.Утвержден Тогда
		Результат = Истина;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

Процедура ДополнителнениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого задача Из ФормируемыеЗадачи Цикл
		
		задача.Статус			 = Статус;
		задача.Инициатор		 = Инициатор;
		задача.Подразделение	 = Подразделение;
		задача.Фамилия			 = Фамилия;
		задача.Имя				 = Имя;
		задача.Отчество			 = Отчество;
		задача.Телефон			 = Телефон;
		задача.Категория		 = Категория;
		задача.Должность		 = Должность;
		задача.Менеджер			 = Менеджер;
		задача.Контрагент		 = Контрагент;
		задача.ФизЛицо			 = ФизЛицо;
		задача.Сотрудник		 = Сотрудник;
		
		задача.ПлановыеНачисления.Загрузить(Сотрудник.ПлановыеНачисления.Выгрузить());
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнителнениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Статус			 = Задача.Статус;
	Инициатор		 = Задача.Инициатор;
	Фамилия			 = Задача.Фамилия;
	Имя				 = Задача.Имя;
	Отчество		 = Задача.Отчество;
	Телефон			 = Задача.Телефон;
	Подразделение	 = Задача.Подразделение;
	Категория		 = Задача.Категория;
	Должность		 = Задача.Должность;
	Менеджер		 = Задача.Менеджер;
	Контрагент		 = Задача.Контрагент;
	ФизЛицо			 = Задача.ФизЛицо;
	Сотрудник		 = Задача.Сотрудник;
	
	Записать();
	
	сотрудникОбъект = Задача.Сотрудник.ПолучитьОбъект();
	сотрудникОбъект.Менеджер = Задача.Менеджер;
	сотрудникОбъект.ПлановыеНачисления.Загрузить(Задача.ПлановыеНачисления.Выгрузить());
	сотрудникОбъект.Записать();
	
КонецПроцедуры
